Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x3f2 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xc2e7a): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x88d79): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x4b90c): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/Assign2_Ref_Implementation_FreeRTOS/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x10a36): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)

    <1ac>   DW_AT_name        : (indirect string, offset: 0x430e): osPriorityHigh5
    <1b0>   DW_AT_const_value : 45
 <2><1b1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1b2>   DW_AT_name        : (indirect string, offset: 0x85904): osPriorityHigh6
    <1b6>   DW_AT_const_value : 46
 <2><1b7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x85914): osPriorityHigh7
    <1bc>   DW_AT_const_value : 47
 <2><1bd>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1be>   DW_AT_name        : (indirect string, offset: 0xb5af0): osPriorityRealtime
    <1c2>   DW_AT_const_value : 48
 <2><1c3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x7e79b): osPriorityRealtime1
    <1c8>   DW_AT_const_value : 49
 <2><1c9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1ca>   DW_AT_name        : (indirect string, offset: 0x7e7af): osPriorityRealtime2
    <1ce>   DW_AT_const_value : 50
 <2><1cf>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x7e7c3): osPriorityRealtime3
    <1d4>   DW_AT_const_value : 51
 <2><1d5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x7e7d7): osPriorityRealtime4
    <1da>   DW_AT_const_value : 52
 <2><1db>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x7e7eb): osPriorityRealtime5
    <1e0>   DW_AT_const_value : 53
 <2><1e1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x7e7ff): osPriorityRealtime6
    <1e6>   DW_AT_const_value : 54
 <2><1e7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x7e813): osPriorityRealtime7
    <1ec>   DW_AT_const_value : 55
 <2><1ed>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1ee>   DW_AT_name        : (indirect string, offset: 0xcc2): osPriorityISR
    <1f2>   DW_AT_const_value : 56
 <2><1f3>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1f4>   DW_AT_name        : (indirect string, offset: 0xb1186): osPriorityError
    <1f8>   DW_AT_const_value : -1
 <2><1f9>: Abbrev Number: 13 (DW_TAG_enumerator)
    <1fa>   DW_AT_name        : (indirect string, offset: 0xbec32): osPriorityReserved
    <1fe>   DW_AT_const_value : 0x7fffffff
 <2><202>: Abbrev Number: 0
 <1><203>: Abbrev Number: 4 (DW_TAG_typedef)
    <204>   DW_AT_name        : (indirect string, offset: 0x93f4a): osPriority_t
    <208>   DW_AT_decl_file   : 4
    <209>   DW_AT_decl_line   : 136
    <20a>   DW_AT_decl_column : 3
    <20b>   DW_AT_type        : <0xb3>
 <1><20f>: Abbrev Number: 4 (DW_TAG_typedef)
    <210>   DW_AT_name        : (indirect string, offset: 0x6d37f): osThreadFunc_t
    <214>   DW_AT_decl_file   : 4
    <215>   DW_AT_decl_line   : 139
    <216>   DW_AT_decl_column : 16
    <217>   DW_AT_type        : <0x8e>
 <1><21b>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <21c>   DW_AT_encoding    : 5	(signed)
    <21d>   DW_AT_byte_size   : 4
    <21e>   DW_AT_type        : <0x29>
    <222>   DW_AT_decl_file   : 4
    <223>   DW_AT_decl_line   : 176
    <224>   DW_AT_decl_column : 14
    <225>   DW_AT_sibling     : <0x25d>
 <2><229>: Abbrev Number: 11 (DW_TAG_enumerator)
    <22a>   DW_AT_name        : (indirect string, offset: 0x9a9c0): osOK
    <22e>   DW_AT_const_value : 0
 <2><22f>: Abbrev Number: 12 (DW_TAG_enumerator)
    <230>   DW_AT_name        : (indirect string, offset: 0x5d2a3): osError
    <234>   DW_AT_const_value : -1
 <2><235>: Abbrev Number: 12 (DW_TAG_enumerator)
    <236>   DW_AT_name        : (indirect string, offset: 0x2279b): osErrorTimeout
    <23a>   DW_AT_const_value : -2
 <2><23b>: Abbrev Number: 12 (DW_TAG_enumerator)
    <23c>   DW_AT_name        : (indirect string, offset: 0x83dad): osErrorResource
    <240>   DW_AT_const_value : -3
 <2><241>: Abbrev Number: 12 (DW_TAG_enumerator)
    <242>   DW_AT_name        : (indirect string, offset: 0x340d3): osErrorParameter
    <246>   DW_AT_const_value : -4
 <2><247>: Abbrev Number: 12 (DW_TAG_enumerator)
    <248>   DW_AT_name        : (indirect string, offset: 0x22e69): osErrorNoMemory
    <24c>   DW_AT_const_value : -5
 <2><24d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <24e>   DW_AT_name        : (indirect string, offset: 0x361e9): osErrorISR
    <252>   DW_AT_const_value : -6
 <2><253>: Abbrev Number: 13 (DW_TAG_enumerator)
    <254>   DW_AT_name        : (indirect string, offset: 0x65d14): osStatusReserved
    <258>   DW_AT_const_value : 0x7fffffff
 <2><25c>: Abbrev Number: 0
 <1><25d>: Abbrev Number: 4 (DW_TAG_typedef)
    <25e>   DW_AT_name        : (indirect string, offset: 0x441a6): osStatus_t
    <262>   DW_AT_decl_file   : 4
    <263>   DW_AT_decl_line   : 185
    <264>   DW_AT_decl_column : 3
    <265>   DW_AT_type        : <0x21b>
 <1><269>: Abbrev Number: 4 (DW_TAG_typedef)
    <26a>   DW_AT_name        : (indirect string, offset: 0x24add): osThreadId_t
    <26e>   DW_AT_decl_file   : 4
    <26f>   DW_AT_decl_line   : 189
    <270>   DW_AT_decl_column : 15
    <271>   DW_AT_type        : <0x9f>
 <1><275>: Abbrev Number: 4 (DW_TAG_typedef)
    <276>   DW_AT_name        : (indirect string, offset: 0x87482): TZ_ModuleId_t
    <27a>   DW_AT_decl_file   : 4
    <27b>   DW_AT_decl_line   : 213
    <27c>   DW_AT_decl_column : 18
    <27d>   DW_AT_type        : <0x82>
 <1><281>: Abbrev Number: 14 (DW_TAG_structure_type)
    <282>   DW_AT_byte_size   : 36
    <283>   DW_AT_decl_file   : 4
    <284>   DW_AT_decl_line   : 218
    <285>   DW_AT_decl_column : 9
    <286>   DW_AT_sibling     : <0x300>
 <2><28a>: Abbrev Number: 15 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0xb3932): name
    <28f>   DW_AT_decl_file   : 4
    <290>   DW_AT_decl_line   : 219
    <291>   DW_AT_decl_column : 33
    <292>   DW_AT_type        : <0xad>
    <296>   DW_AT_data_member_location: 0
 <2><297>: Abbrev Number: 15 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0x83af1): attr_bits
    <29c>   DW_AT_decl_file   : 4
    <29d>   DW_AT_decl_line   : 220
    <29e>   DW_AT_decl_column : 28
    <29f>   DW_AT_type        : <0x82>
    <2a3>   DW_AT_data_member_location: 4
 <2><2a4>: Abbrev Number: 15 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x272a4): cb_mem
    <2a9>   DW_AT_decl_file   : 4
    <2aa>   DW_AT_decl_line   : 221
    <2ab>   DW_AT_decl_column : 30
    <2ac>   DW_AT_type        : <0x9f>
    <2b0>   DW_AT_data_member_location: 8
 <2><2b1>: Abbrev Number: 15 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0xbde79): cb_size
    <2b6>   DW_AT_decl_file   : 4
    <2b7>   DW_AT_decl_line   : 222
    <2b8>   DW_AT_decl_column : 30
    <2b9>   DW_AT_type        : <0x82>
    <2bd>   DW_AT_data_member_location: 12
 <2><2be>: Abbrev Number: 15 (DW_TAG_member)
    <2bf>   DW_AT_name        : (indirect string, offset: 0xb63b3): stack_mem
    <2c3>   DW_AT_decl_file   : 4
    <2c4>   DW_AT_decl_line   : 223
    <2c5>   DW_AT_decl_column : 27
    <2c6>   DW_AT_type        : <0x9f>
    <2ca>   DW_AT_data_member_location: 16
 <2><2cb>: Abbrev Number: 15 (DW_TAG_member)
    <2cc>   DW_AT_name        : (indirect string, offset: 0x7e878): stack_size
    <2d0>   DW_AT_decl_file   : 4
    <2d1>   DW_AT_decl_line   : 224
    <2d2>   DW_AT_decl_column : 27
    <2d3>   DW_AT_type        : <0x82>
    <2d7>   DW_AT_data_member_location: 20
 <2><2d8>: Abbrev Number: 15 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x4fb49): priority
    <2dd>   DW_AT_decl_file   : 4
    <2de>   DW_AT_decl_line   : 225
    <2df>   DW_AT_decl_column : 29
    <2e0>   DW_AT_type        : <0x203>
    <2e4>   DW_AT_data_member_location: 24
 <2><2e5>: Abbrev Number: 15 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x55c47): tz_module
    <2ea>   DW_AT_decl_file   : 4
    <2eb>   DW_AT_decl_line   : 226
    <2ec>   DW_AT_decl_column : 28
    <2ed>   DW_AT_type        : <0x275>
    <2f1>   DW_AT_data_member_location: 28
 <2><2f2>: Abbrev Number: 15 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0xb41ae): reserved
    <2f7>   DW_AT_decl_file   : 4
    <2f8>   DW_AT_decl_line   : 227
    <2f9>   DW_AT_decl_column : 29
    <2fa>   DW_AT_type        : <0x82>
    <2fe>   DW_AT_data_member_location: 32
 <2><2ff>: Abbrev Number: 0
 <1><300>: Abbrev Number: 4 (DW_TAG_typedef)
    <301>   DW_AT_name        : (indirect string, offset: 0x1fd1b): osThreadAttr_t
    <305>   DW_AT_decl_file   : 4
    <306>   DW_AT_decl_line   : 228
    <307>   DW_AT_decl_column : 3
    <308>   DW_AT_type        : <0x281>
 <1><30c>: Abbrev Number: 9 (DW_TAG_const_type)
    <30d>   DW_AT_type        : <0x300>
 <1><311>: Abbrev Number: 16 (DW_TAG_variable)
    <312>   DW_AT_name        : (indirect string, offset: 0x1563): consumerTaskHandle
    <316>   DW_AT_decl_file   : 1
    <317>   DW_AT_decl_line   : 51
    <318>   DW_AT_decl_column : 14
    <319>   DW_AT_type        : <0x269>
    <31d>   DW_AT_external    : 1
    <31d>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><323>: Abbrev Number: 16 (DW_TAG_variable)
    <324>   DW_AT_name        : (indirect string, offset: 0x68dd7): consumerTask_attributes
    <328>   DW_AT_decl_file   : 1
    <329>   DW_AT_decl_line   : 52
    <32a>   DW_AT_decl_column : 22
    <32b>   DW_AT_type        : <0x30c>
    <32f>   DW_AT_external    : 1
    <32f>   DW_AT_location    : 5 byte block: 3 a8 85 0 8 	(DW_OP_addr: 80085a8)
 <1><335>: Abbrev Number: 16 (DW_TAG_variable)
    <336>   DW_AT_name        : (indirect string, offset: 0xa2287): InitTaskHandle
    <33a>   DW_AT_decl_file   : 1
    <33b>   DW_AT_decl_line   : 58
    <33c>   DW_AT_decl_column : 14
    <33d>   DW_AT_type        : <0x269>
    <341>   DW_AT_external    : 1
    <341>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><347>: Abbrev Number: 16 (DW_TAG_variable)
    <348>   DW_AT_name        : (indirect string, offset: 0x97d7f): InitTask_attributes
    <34c>   DW_AT_decl_file   : 1
    <34d>   DW_AT_decl_line   : 59
    <34e>   DW_AT_decl_column : 22
    <34f>   DW_AT_type        : <0x30c>
    <353>   DW_AT_external    : 1
    <353>   DW_AT_location    : 5 byte block: 3 cc 85 0 8 	(DW_OP_addr: 80085cc)
 <1><359>: Abbrev Number: 17 (DW_TAG_subprogram)
    <35a>   DW_AT_external    : 1
    <35a>   DW_AT_name        : (indirect string, offset: 0xc69d3): osDelay
    <35e>   DW_AT_decl_file   : 4
    <35f>   DW_AT_decl_line   : 459
    <361>   DW_AT_decl_column : 12
    <362>   DW_AT_prototyped  : 1
    <362>   DW_AT_type        : <0x25d>
    <366>   DW_AT_declaration : 1
    <366>   DW_AT_sibling     : <0x370>
 <2><36a>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <36b>   DW_AT_type        : <0x82>
 <2><36f>: Abbrev Number: 0
 <1><370>: Abbrev Number: 17 (DW_TAG_subprogram)
    <371>   DW_AT_external    : 1
    <371>   DW_AT_name        : (indirect string, offset: 0x7015c): osThreadNew
    <375>   DW_AT_decl_file   : 4
    <376>   DW_AT_decl_line   : 349
    <378>   DW_AT_decl_column : 14
    <379>   DW_AT_prototyped  : 1
    <379>   DW_AT_type        : <0x269>
    <37d>   DW_AT_declaration : 1
    <37d>   DW_AT_sibling     : <0x391>
 <2><381>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <382>   DW_AT_type        : <0x20f>
 <2><386>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <387>   DW_AT_type        : <0x9f>
 <2><38b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <38c>   DW_AT_type        : <0x391>
 <2><390>: Abbrev Number: 0
 <1><391>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <392>   DW_AT_byte_size   : 4
    <393>   DW_AT_type        : <0x30c>
 <1><397>: Abbrev Number: 18 (DW_TAG_subprogram)
    <398>   DW_AT_external    : 1
    <398>   DW_AT_name        : (indirect string, offset: 0x163c2): StartTasks
    <39c>   DW_AT_decl_file   : 1
    <39d>   DW_AT_decl_line   : 143
    <39e>   DW_AT_decl_column : 13
    <39f>   DW_AT_prototyped  : 1
    <39f>   DW_AT_low_pc      : 0x0
    <3a3>   DW_AT_high_pc     : 0x10
    <3a7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3a9>   DW_AT_GNU_all_tail_call_sites: 1
    <3a9>   DW_AT_sibling     : <0x3bd>
 <2><3ad>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <3ae>   DW_AT_name        : (indirect string, offset: 0x2ade1): argument
    <3b2>   DW_AT_decl_file   : 1
    <3b3>   DW_AT_decl_line   : 143
    <3b4>   DW_AT_decl_column : 30
    <3b5>   DW_AT_type        : <0x9f>
    <3b9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><3bc>: Abbrev Number: 0
 <1><3bd>: Abbrev Number: 18 (DW_TAG_subprogram)
    <3be>   DW_AT_external    : 1
    <3be>   DW_AT_name        : (indirect string, offset: 0xa7e3): ConsumerTask
    <3c2>   DW_AT_decl_file   : 1
    <3c3>   DW_AT_decl_line   : 125
    <3c4>   DW_AT_decl_column : 13
    <3c5>   DW_AT_prototyped  : 1
    <3c5>   DW_AT_low_pc      : 0x0
    <3c9>   DW_AT_high_pc     : 0x10
    <3cd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3cf>   DW_AT_GNU_all_tail_call_sites: 1
    <3cf>   DW_AT_sibling     : <0x3e3>
 <2><3d3>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <3d4>   DW_AT_name        : (indirect string, offset: 0x2ade1): argument
    <3d8>   DW_AT_decl_file   : 1
    <3d9>   DW_AT_decl_line   : 125
    <3da>   DW_AT_decl_column : 32
    <3db>   DW_AT_type        : <0x9f>
    <3df>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><3e2>: Abbrev Number: 0
 <1><3e3>: Abbrev Number: 20 (DW_TAG_subprogram)
    <3e4>   DW_AT_external    : 1
    <3e4>   DW_AT_name        : (indirect string, offset: 0xa1889): MX_FREERTOS_Init
    <3e8>   DW_AT_decl_file   : 1
    <3e9>   DW_AT_decl_line   : 80
    <3ea>   DW_AT_decl_column : 6
    <3eb>   DW_AT_prototyped  : 1
    <3eb>   DW_AT_low_pc      : 0x8000584
    <3ef>   DW_AT_high_pc     : 0x40
    <3f3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3f5>   DW_AT_GNU_all_tail_call_sites: 1
 <1><3f5>: Abbrev Number: 0
  Compilation Unit @ offset 0x3f6:
   Length:        0x4ce (32-bit)
   Version:       4
   Abbrev Offset: 0x122
   Pointer Size:  4
 <0><401>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <402>   DW_AT_producer    : (indirect string, offset: 0xc2e7a): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <406>   DW_AT_language    : 12	(ANSI C99)
    <407>   DW_AT_name        : (indirect string, offset: 0xc95be): ../Core/Src/gpio.c
    <40b>   DW_AT_comp_dir    : (indirect string, offset: 0x4b90c): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/Assign2_Ref_Implementation_FreeRTOS/Debug
    <40f>   DW_AT_ranges      : 0x20
    <413>   DW_AT_low_pc      : 0x0
    <417>   DW_AT_stmt_list   : 0x9ed
    <41b>   DW_AT_GNU_macros  : 0x1f970
 <1><41f>: Abbrev Number: 2 (DW_TAG_base_type)
    <420>   DW_AT_byte_size   : 1
    <421>   DW_AT_encoding    : 6	(signed char)
    <422>   DW_AT_name        : (indirect string, offset: 0x6518e): signed char
 <1><426>: Abbrev Number: 2 (DW_TAG_base_type)
    <427>   DW_AT_byte_size   : 1
    <428>   DW_AT_encoding    : 8	(unsigned char)
    <429>   DW_AT_name        : (indirect string, offset: 0xc1b11): unsigned char
 <1><42d>: Abbrev Number: 2 (DW_TAG_base_type)
    <42e>   DW_AT_byte_size   : 2
    <42f>   DW_AT_encoding    : 5	(signed)
    <430>   DW_AT_name        : (indirect string, offset: 0x95619): short int
 <1><434>: Abbrev Number: 3 (DW_TAG_typedef)
    <435>   DW_AT_name        : (indirect string, offset: 0xc96f3): __uint16_t
    <439>   DW_AT_decl_file   : 2
    <43a>   DW_AT_decl_line   : 57
    <43b>   DW_AT_decl_column : 25
    <43c>   DW_AT_type        : <0x440>
 <1><440>: Abbrev Number: 2 (DW_TAG_base_type)
    <441>   DW_AT_byte_size   : 2
    <442>   DW_AT_encoding    : 7	(unsigned)
    <443>   DW_AT_name        : (indirect string, offset: 0xc031f): short unsigned int
 <1><447>: Abbrev Number: 2 (DW_TAG_base_type)
    <448>   DW_AT_byte_size   : 4
    <449>   DW_AT_encoding    : 5	(signed)
    <44a>   DW_AT_name        : (indirect string, offset: 0x11460): long int
 <1><44e>: Abbrev Number: 3 (DW_TAG_typedef)
    <44f>   DW_AT_name        : (indirect string, offset: 0x80696): __uint32_t
    <453>   DW_AT_decl_file   : 2
    <454>   DW_AT_decl_line   : 79
    <455>   DW_AT_decl_column : 25
    <456>   DW_AT_type        : <0x45a>
 <1><45a>: Abbrev Number: 2 (DW_TAG_base_type)
    <45b>   DW_AT_byte_size   : 4
    <45c>   DW_AT_encoding    : 7	(unsigned)
    <45d>   DW_AT_name        : (indirect string, offset: 0x4ce83): long unsigned int
 <1><461>: Abbrev Number: 2 (DW_TAG_base_type)
    <462>   DW_AT_byte_size   : 8
    <463>   DW_AT_encoding    : 5	(signed)
    <464>   DW_AT_name        : (indirect string, offset: 0x5bfce): long long int
 <1><468>: Abbrev Number: 2 (DW_TAG_base_type)
    <469>   DW_AT_byte_size   : 8
    <46a>   DW_AT_encoding    : 7	(unsigned)
    <46b>   DW_AT_name        : (indirect string, offset: 0x29bc5): long long unsigned int
 <1><46f>: Abbrev Number: 4 (DW_TAG_base_type)
    <470>   DW_AT_byte_size   : 4
    <471>   DW_AT_encoding    : 5	(signed)
    <472>   DW_AT_name        : int
 <1><476>: Abbrev Number: 2 (DW_TAG_base_type)
    <477>   DW_AT_byte_size   : 4
    <478>   DW_AT_encoding    : 7	(unsigned)
    <479>   DW_AT_name        : (indirect string, offset: 0x10a36): unsigned int
 <1><47d>: Abbrev Number: 3 (DW_TAG_typedef)
    <47e>   DW_AT_name        : (indirect string, offset: 0x92731): uint16_t
    <482>   DW_AT_decl_file   : 3
    <483>   DW_AT_decl_line   : 36
    <484>   DW_AT_decl_column : 20
    <485>   DW_AT_type        : <0x434>
 <1><489>: Abbrev Number: 3 (DW_TAG_typedef)
    <48a>   DW_AT_name        : (indirect string, offset: 0x91d12): uint32_t
    <48e>   DW_AT_decl_file   : 3
    <48f>   DW_AT_decl_line   : 48
    <490>   DW_AT_decl_column : 20
    <491>   DW_AT_type        : <0x44e>
 <1><495>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <496>   DW_AT_type        : <0x489>
 <1><49a>: Abbrev Number: 6 (DW_TAG_structure_type)
    <49b>   DW_AT_byte_size   : 44
    <49c>   DW_AT_decl_file   : 4
    <49d>   DW_AT_decl_line   : 451
    <49f>   DW_AT_decl_column : 9
    <4a0>   DW_AT_sibling     : <0x531>
 <2><4a4>: Abbrev Number: 7 (DW_TAG_member)
    <4a5>   DW_AT_name        : (indirect string, offset: 0xc954a): MODER
    <4a9>   DW_AT_decl_file   : 4
    <4aa>   DW_AT_decl_line   : 453
    <4ac>   DW_AT_decl_column : 17
    <4ad>   DW_AT_type        : <0x495>
    <4b1>   DW_AT_data_member_location: 0
 <2><4b2>: Abbrev Number: 7 (DW_TAG_member)
    <4b3>   DW_AT_name        : (indirect string, offset: 0xc96b8): OTYPER
    <4b7>   DW_AT_decl_file   : 4
    <4b8>   DW_AT_decl_line   : 454
    <4ba>   DW_AT_decl_column : 17
    <4bb>   DW_AT_type        : <0x495>
    <4bf>   DW_AT_data_member_location: 4
 <2><4c0>: Abbrev Number: 7 (DW_TAG_member)
    <4c1>   DW_AT_name        : (indirect string, offset: 0xc9703): OSPEEDR
    <4c5>   DW_AT_decl_file   : 4
    <4c6>   DW_AT_decl_line   : 455
    <4c8>   DW_AT_decl_column : 17
    <4c9>   DW_AT_type        : <0x495>
    <4cd>   DW_AT_data_member_location: 8
 <2><4ce>: Abbrev Number: 7 (DW_TAG_member)
    <4cf>   DW_AT_name        : (indirect string, offset: 0xc9697): PUPDR
    <4d3>   DW_AT_decl_file   : 4
    <4d4>   DW_AT_decl_line   : 456
    <4d6>   DW_AT_decl_column : 17
    <4d7>   DW_AT_type        : <0x495>
    <4db>   DW_AT_data_member_location: 12
 <2><4dc>: Abbrev Number: 8 (DW_TAG_member)
    <4dd>   DW_AT_name        : IDR
    <4e1>   DW_AT_decl_file   : 4
    <4e2>   DW_AT_decl_line   : 457
    <4e4>   DW_AT_decl_column : 17
    <4e5>   DW_AT_type        : <0x495>
    <4e9>   DW_AT_data_member_location: 16
 <2><4ea>: Abbrev Number: 8 (DW_TAG_member)
    <4eb>   DW_AT_name        : ODR
    <4ef>   DW_AT_decl_file   : 4
    <4f0>   DW_AT_decl_line   : 458
    <4f2>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x495>
    <4f7>   DW_AT_data_member_location: 20
 <2><4f8>: Abbrev Number: 7 (DW_TAG_member)
    <4f9>   DW_AT_name        : (indirect string, offset: 0xc95f4): BSRR
    <4fd>   DW_AT_decl_file   : 4
    <4fe>   DW_AT_decl_line   : 459
    <500>   DW_AT_decl_column : 17
    <501>   DW_AT_type        : <0x495>
    <505>   DW_AT_data_member_location: 24
 <2><506>: Abbrev Number: 7 (DW_TAG_member)
    <507>   DW_AT_name        : (indirect string, offset: 0xc96fe): LCKR
    <50b>   DW_AT_decl_file   : 4
    <50c>   DW_AT_decl_line   : 460
    <50e>   DW_AT_decl_column : 17
    <50f>   DW_AT_type        : <0x495>
    <513>   DW_AT_data_member_location: 28
 <2><514>: Abbrev Number: 8 (DW_TAG_member)
    <515>   DW_AT_name        : AFR
    <519>   DW_AT_decl_file   : 4
    <51a>   DW_AT_decl_line   : 461
    <51c>   DW_AT_decl_column : 17
    <51d>   DW_AT_type        : <0x541>
    <521>   DW_AT_data_member_location: 32
 <2><522>: Abbrev Number: 8 (DW_TAG_member)
    <523>   DW_AT_name        : BRR
    <527>   DW_AT_decl_file   : 4
    <528>   DW_AT_decl_line   : 462
    <52a>   DW_AT_decl_column : 17
    <52b>   DW_AT_type        : <0x495>
    <52f>   DW_AT_data_member_location: 40
 <2><530>: Abbrev Number: 0
 <1><531>: Abbrev Number: 9 (DW_TAG_array_type)
    <532>   DW_AT_type        : <0x495>
    <536>   DW_AT_sibling     : <0x541>
 <2><53a>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <53b>   DW_AT_type        : <0x476>
    <53f>   DW_AT_upper_bound : 1
 <2><540>: Abbrev Number: 0
 <1><541>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <542>   DW_AT_type        : <0x531>
 <1><546>: Abbrev Number: 11 (DW_TAG_typedef)
    <547>   DW_AT_name        : (indirect string, offset: 0xc975d): GPIO_TypeDef
    <54b>   DW_AT_decl_file   : 4
    <54c>   DW_AT_decl_line   : 464
    <54e>   DW_AT_decl_column : 3
    <54f>   DW_AT_type        : <0x49a>
 <1><553>: Abbrev Number: 6 (DW_TAG_structure_type)
    <554>   DW_AT_byte_size   : 156
    <555>   DW_AT_decl_file   : 4
    <556>   DW_AT_decl_line   : 590
    <558>   DW_AT_decl_column : 9
    <559>   DW_AT_sibling     : <0x77f>
 <2><55d>: Abbrev Number: 8 (DW_TAG_member)
    <55e>   DW_AT_name        : CR
    <561>   DW_AT_decl_file   : 4
    <562>   DW_AT_decl_line   : 592
    <564>   DW_AT_decl_column : 17
    <565>   DW_AT_type        : <0x495>
    <569>   DW_AT_data_member_location: 0
 <2><56a>: Abbrev Number: 7 (DW_TAG_member)
    <56b>   DW_AT_name        : (indirect string, offset: 0xc96aa): ICSCR
    <56f>   DW_AT_decl_file   : 4
    <570>   DW_AT_decl_line   : 593
    <572>   DW_AT_decl_column : 17
    <573>   DW_AT_type        : <0x495>
    <577>   DW_AT_data_member_location: 4
 <2><578>: Abbrev Number: 7 (DW_TAG_member)
    <579>   DW_AT_name        : (indirect string, offset: 0xc9619): CFGR
    <57d>   DW_AT_decl_file   : 4
    <57e>   DW_AT_decl_line   : 594
    <580>   DW_AT_decl_column : 17
    <581>   DW_AT_type        : <0x495>
    <585>   DW_AT_data_member_location: 8
 <2><586>: Abbrev Number: 7 (DW_TAG_member)
    <587>   DW_AT_name        : (indirect string, offset: 0xc96b0): PLLCFGR
    <58b>   DW_AT_decl_file   : 4
    <58c>   DW_AT_decl_line   : 595
    <58e>   DW_AT_decl_column : 17
    <58f>   DW_AT_type        : <0x495>
    <593>   DW_AT_data_member_location: 12
 <2><594>: Abbrev Number: 7 (DW_TAG_member)
    <595>   DW_AT_name        : (indirect string, offset: 0xc9612): PLLSAI1CFGR
    <599>   DW_AT_decl_file   : 4
    <59a>   DW_AT_decl_line   : 596
    <59c>   DW_AT_decl_column : 17
    <59d>   DW_AT_type        : <0x495>
    <5a1>   DW_AT_data_member_location: 16
 <2><5a2>: Abbrev Number: 7 (DW_TAG_member)
    <5a3>   DW_AT_name        : (indirect string, offset: 0x79793): RESERVED
    <5a7>   DW_AT_decl_file   : 4
    <5a8>   DW_AT_decl_line   : 597
    <5aa>   DW_AT_decl_column : 17
    <5ab>   DW_AT_type        : <0x489>
    <5af>   DW_AT_data_member_location: 20
 <2><5b0>: Abbrev Number: 7 (DW_TAG_member)
    <5b1>   DW_AT_name        : (indirect string, offset: 0xc955c): CIER
    <5b5>   DW_AT_decl_file   : 4
    <5b6>   DW_AT_decl_line   : 598
    <5b8>   DW_AT_decl_column : 17
    <5b9>   DW_AT_type        : <0x495>
    <5bd>   DW_AT_data_member_location: 24
 <2><5be>: Abbrev Number: 7 (DW_TAG_member)
    <5bf>   DW_AT_name        : (indirect string, offset: 0xc9561): CIFR
    <5c3>   DW_AT_decl_file   : 4
    <5c4>   DW_AT_decl_line   : 599
    <5c6>   DW_AT_decl_column : 17
    <5c7>   DW_AT_type        : <0x495>
    <5cb>   DW_AT_data_member_location: 28
 <2><5cc>: Abbrev Number: 7 (DW_TAG_member)
    <5cd>   DW_AT_name        : (indirect string, offset: 0xc9557): CICR
    <5d1>   DW_AT_decl_file   : 4
    <5d2>   DW_AT_decl_line   : 600
    <5d4>   DW_AT_decl_column : 17
    <5d5>   DW_AT_type        : <0x495>
    <5d9>   DW_AT_data_member_location: 32
 <2><5da>: Abbrev Number: 7 (DW_TAG_member)
    <5db>   DW_AT_name        : (indirect string, offset: 0xc9721): RESERVED0
    <5df>   DW_AT_decl_file   : 4
    <5e0>   DW_AT_decl_line   : 601
    <5e2>   DW_AT_decl_column : 17
    <5e3>   DW_AT_type        : <0x489>
    <5e7>   DW_AT_data_member_location: 36
 <2><5e8>: Abbrev Number: 7 (DW_TAG_member)
    <5e9>   DW_AT_name        : (indirect string, offset: 0xc96d0): AHB1RSTR
    <5ed>   DW_AT_decl_file   : 4
    <5ee>   DW_AT_decl_line   : 602
    <5f0>   DW_AT_decl_column : 17
    <5f1>   DW_AT_type        : <0x495>
    <5f5>   DW_AT_data_member_location: 40
 <2><5f6>: Abbrev Number: 7 (DW_TAG_member)
    <5f7>   DW_AT_name        : (indirect string, offset: 0xc95b5): AHB2RSTR
    <5fb>   DW_AT_decl_file   : 4
    <5fc>   DW_AT_decl_line   : 603
    <5fe>   DW_AT_decl_column : 17
    <5ff>   DW_AT_type        : <0x495>
    <603>   DW_AT_data_member_location: 44
 <2><604>: Abbrev Number: 7 (DW_TAG_member)
    <605>   DW_AT_name        : (indirect string, offset: 0xc9631): AHB3RSTR
    <609>   DW_AT_decl_file   : 4
    <60a>   DW_AT_decl_line   : 604
    <60c>   DW_AT_decl_column : 17
    <60d>   DW_AT_type        : <0x495>
    <611>   DW_AT_data_member_location: 48
 <2><612>: Abbrev Number: 7 (DW_TAG_member)
    <613>   DW_AT_name        : (indirect string, offset: 0xc972b): RESERVED1
    <617>   DW_AT_decl_file   : 4
    <618>   DW_AT_decl_line   : 605
    <61a>   DW_AT_decl_column : 17
    <61b>   DW_AT_type        : <0x489>
    <61f>   DW_AT_data_member_location: 52
 <2><620>: Abbrev Number: 7 (DW_TAG_member)
    <621>   DW_AT_name        : (indirect string, offset: 0xc95d1): APB1RSTR1
    <625>   DW_AT_decl_file   : 4
    <626>   DW_AT_decl_line   : 606
    <628>   DW_AT_decl_column : 17
    <629>   DW_AT_type        : <0x495>
    <62d>   DW_AT_data_member_location: 56
 <2><62e>: Abbrev Number: 7 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0xc95db): APB1RSTR2
    <633>   DW_AT_decl_file   : 4
    <634>   DW_AT_decl_line   : 607
    <636>   DW_AT_decl_column : 17
    <637>   DW_AT_type        : <0x495>
    <63b>   DW_AT_data_member_location: 60
 <2><63c>: Abbrev Number: 7 (DW_TAG_member)
    <63d>   DW_AT_name        : (indirect string, offset: 0xc9628): APB2RSTR
    <641>   DW_AT_decl_file   : 4
    <642>   DW_AT_decl_line   : 608
    <644>   DW_AT_decl_column : 17
    <645>   DW_AT_type        : <0x495>
    <649>   DW_AT_data_member_location: 64
 <2><64a>: Abbrev Number: 7 (DW_TAG_member)
    <64b>   DW_AT_name        : (indirect string, offset: 0xc9735): RESERVED2
    <64f>   DW_AT_decl_file   : 4
    <650>   DW_AT_decl_line   : 609
    <652>   DW_AT_decl_column : 17
    <653>   DW_AT_type        : <0x489>
    <657>   DW_AT_data_member_location: 68
 <2><658>: Abbrev Number: 7 (DW_TAG_member)
    <659>   DW_AT_name        : (indirect string, offset: 0xc958e): AHB1ENR
    <65d>   DW_AT_decl_file   : 4
    <65e>   DW_AT_decl_line   : 610
    <660>   DW_AT_decl_column : 17
    <661>   DW_AT_type        : <0x495>
    <665>   DW_AT_data_member_location: 72
 <2><666>: Abbrev Number: 7 (DW_TAG_member)
    <667>   DW_AT_name        : (indirect string, offset: 0xc95fe): AHB2ENR
    <66b>   DW_AT_decl_file   : 4
    <66c>   DW_AT_decl_line   : 611
    <66e>   DW_AT_decl_column : 17
    <66f>   DW_AT_type        : <0x495>
    <673>   DW_AT_data_member_location: 76
 <2><674>: Abbrev Number: 7 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0xc963a): AHB3ENR
    <679>   DW_AT_decl_file   : 4
    <67a>   DW_AT_decl_line   : 612
    <67c>   DW_AT_decl_column : 17
    <67d>   DW_AT_type        : <0x495>
    <681>   DW_AT_data_member_location: 80
 <2><682>: Abbrev Number: 7 (DW_TAG_member)
    <683>   DW_AT_name        : (indirect string, offset: 0xc973f): RESERVED3
    <687>   DW_AT_decl_file   : 4
    <688>   DW_AT_decl_line   : 613
    <68a>   DW_AT_decl_column : 17
    <68b>   DW_AT_type        : <0x489>
    <68f>   DW_AT_data_member_location: 84
 <2><690>: Abbrev Number: 7 (DW_TAG_member)
    <691>   DW_AT_name        : (indirect string, offset: 0xc9566): APB1ENR1
    <695>   DW_AT_decl_file   : 4
    <696>   DW_AT_decl_line   : 614
    <698>   DW_AT_decl_column : 17
    <699>   DW_AT_type        : <0x495>
    <69d>   DW_AT_data_member_location: 88
 <2><69e>: Abbrev Number: 7 (DW_TAG_member)
    <69f>   DW_AT_name        : (indirect string, offset: 0xc956f): APB1ENR2
    <6a3>   DW_AT_decl_file   : 4
    <6a4>   DW_AT_decl_line   : 615
    <6a6>   DW_AT_decl_column : 17
    <6a7>   DW_AT_type        : <0x495>
    <6ab>   DW_AT_data_member_location: 92
 <2><6ac>: Abbrev Number: 7 (DW_TAG_member)
    <6ad>   DW_AT_name        : (indirect string, offset: 0xc9662): APB2ENR
    <6b1>   DW_AT_decl_file   : 4
    <6b2>   DW_AT_decl_line   : 616
    <6b4>   DW_AT_decl_column : 17
    <6b5>   DW_AT_type        : <0x495>
    <6b9>   DW_AT_data_member_location: 96
 <2><6ba>: Abbrev Number: 7 (DW_TAG_member)
    <6bb>   DW_AT_name        : (indirect string, offset: 0xc9675): RESERVED4
    <6bf>   DW_AT_decl_file   : 4
    <6c0>   DW_AT_decl_line   : 617
    <6c2>   DW_AT_decl_column : 17
    <6c3>   DW_AT_type        : <0x489>
    <6c7>   DW_AT_data_member_location: 100
 <2><6c8>: Abbrev Number: 7 (DW_TAG_member)
    <6c9>   DW_AT_name        : (indirect string, offset: 0xc964c): AHB1SMENR
    <6cd>   DW_AT_decl_file   : 4
    <6ce>   DW_AT_decl_line   : 618
    <6d0>   DW_AT_decl_column : 17
    <6d1>   DW_AT_type        : <0x495>
    <6d5>   DW_AT_data_member_location: 104
 <2><6d6>: Abbrev Number: 7 (DW_TAG_member)
    <6d7>   DW_AT_name        : (indirect string, offset: 0xc970b): AHB2SMENR
    <6db>   DW_AT_decl_file   : 4
    <6dc>   DW_AT_decl_line   : 619
    <6de>   DW_AT_decl_column : 17
    <6df>   DW_AT_type        : <0x495>
    <6e3>   DW_AT_data_member_location: 108
 <2><6e4>: Abbrev Number: 7 (DW_TAG_member)
    <6e5>   DW_AT_name        : (indirect string, offset: 0xc961e): AHB3SMENR
    <6e9>   DW_AT_decl_file   : 4
    <6ea>   DW_AT_decl_line   : 620
    <6ec>   DW_AT_decl_column : 17
    <6ed>   DW_AT_type        : <0x495>
    <6f1>   DW_AT_data_member_location: 112
 <2><6f2>: Abbrev Number: 7 (DW_TAG_member)
    <6f3>   DW_AT_name        : (indirect string, offset: 0xc9749): RESERVED5
    <6f7>   DW_AT_decl_file   : 4
    <6f8>   DW_AT_decl_line   : 621
    <6fa>   DW_AT_decl_column : 17
    <6fb>   DW_AT_type        : <0x489>
    <6ff>   DW_AT_data_member_location: 116
 <2><700>: Abbrev Number: 7 (DW_TAG_member)
    <701>   DW_AT_name        : (indirect string, offset: 0xc9578): APB1SMENR1
    <705>   DW_AT_decl_file   : 4
    <706>   DW_AT_decl_line   : 622
    <708>   DW_AT_decl_column : 17
    <709>   DW_AT_type        : <0x495>
    <70d>   DW_AT_data_member_location: 120
 <2><70e>: Abbrev Number: 7 (DW_TAG_member)
    <70f>   DW_AT_name        : (indirect string, offset: 0xc9583): APB1SMENR2
    <713>   DW_AT_decl_file   : 4
    <714>   DW_AT_decl_line   : 623
    <716>   DW_AT_decl_column : 17
    <717>   DW_AT_type        : <0x495>
    <71b>   DW_AT_data_member_location: 124
 <2><71c>: Abbrev Number: 7 (DW_TAG_member)
    <71d>   DW_AT_name        : (indirect string, offset: 0xc96e9): APB2SMENR
    <721>   DW_AT_decl_file   : 4
    <722>   DW_AT_decl_line   : 624
    <724>   DW_AT_decl_column : 17
    <725>   DW_AT_type        : <0x495>
    <729>   DW_AT_data_member_location: 128
 <2><72a>: Abbrev Number: 7 (DW_TAG_member)
    <72b>   DW_AT_name        : (indirect string, offset: 0xc967f): RESERVED6
    <72f>   DW_AT_decl_file   : 4
    <730>   DW_AT_decl_line   : 625
    <732>   DW_AT_decl_column : 17
    <733>   DW_AT_type        : <0x489>
    <737>   DW_AT_data_member_location: 132
 <2><738>: Abbrev Number: 7 (DW_TAG_member)
    <739>   DW_AT_name        : (indirect string, offset: 0xc960c): CCIPR
    <73d>   DW_AT_decl_file   : 4
    <73e>   DW_AT_decl_line   : 626
    <740>   DW_AT_decl_column : 17
    <741>   DW_AT_type        : <0x495>
    <745>   DW_AT_data_member_location: 136
 <2><746>: Abbrev Number: 7 (DW_TAG_member)
    <747>   DW_AT_name        : (indirect string, offset: 0xc9753): RESERVED7
    <74b>   DW_AT_decl_file   : 4
    <74c>   DW_AT_decl_line   : 627
    <74e>   DW_AT_decl_column : 17
    <74f>   DW_AT_type        : <0x489>
    <753>   DW_AT_data_member_location: 140
 <2><754>: Abbrev Number: 7 (DW_TAG_member)
    <755>   DW_AT_name        : (indirect string, offset: 0xc95f9): BDCR
    <759>   DW_AT_decl_file   : 4
    <75a>   DW_AT_decl_line   : 628
    <75c>   DW_AT_decl_column : 17
    <75d>   DW_AT_type        : <0x495>
    <761>   DW_AT_data_member_location: 144
 <2><762>: Abbrev Number: 8 (DW_TAG_member)
    <763>   DW_AT_name        : CSR
    <767>   DW_AT_decl_file   : 4
    <768>   DW_AT_decl_line   : 629
    <76a>   DW_AT_decl_column : 17
    <76b>   DW_AT_type        : <0x495>
    <76f>   DW_AT_data_member_location: 148
 <2><770>: Abbrev Number: 7 (DW_TAG_member)
    <771>   DW_AT_name        : (indirect string, offset: 0xc9606): CRRCR
    <775>   DW_AT_decl_file   : 4
    <776>   DW_AT_decl_line   : 630
    <778>   DW_AT_decl_column : 17
    <779>   DW_AT_type        : <0x495>
    <77d>   DW_AT_data_member_location: 152
 <2><77e>: Abbrev Number: 0
 <1><77f>: Abbrev Number: 11 (DW_TAG_typedef)
    <780>   DW_AT_name        : (indirect string, offset: 0xc9656): RCC_TypeDef
    <784>   DW_AT_decl_file   : 4
    <785>   DW_AT_decl_line   : 631
    <787>   DW_AT_decl_column : 3
    <788>   DW_AT_type        : <0x553>
 <1><78c>: Abbrev Number: 2 (DW_TAG_base_type)
    <78d>   DW_AT_byte_size   : 8
    <78e>   DW_AT_encoding    : 4	(float)
    <78f>   DW_AT_name        : (indirect string, offset: 0x12bbb): long double
 <1><793>: Abbrev Number: 12 (DW_TAG_structure_type)
    <794>   DW_AT_byte_size   : 20
    <795>   DW_AT_decl_file   : 5
    <796>   DW_AT_decl_line   : 46
    <797>   DW_AT_decl_column : 9
    <798>   DW_AT_sibling     : <0x7de>
 <2><79c>: Abbrev Number: 13 (DW_TAG_member)
    <79d>   DW_AT_name        : Pin
    <7a1>   DW_AT_decl_file   : 5
    <7a2>   DW_AT_decl_line   : 48
    <7a3>   DW_AT_decl_column : 12
    <7a4>   DW_AT_type        : <0x489>
    <7a8>   DW_AT_data_member_location: 0
 <2><7a9>: Abbrev Number: 14 (DW_TAG_member)
    <7aa>   DW_AT_name        : (indirect string, offset: 0xd0707): Mode
    <7ae>   DW_AT_decl_file   : 5
    <7af>   DW_AT_decl_line   : 51
    <7b0>   DW_AT_decl_column : 12
    <7b1>   DW_AT_type        : <0x489>
    <7b5>   DW_AT_data_member_location: 4
 <2><7b6>: Abbrev Number: 14 (DW_TAG_member)
    <7b7>   DW_AT_name        : (indirect string, offset: 0xc966a): Pull
    <7bb>   DW_AT_decl_file   : 5
    <7bc>   DW_AT_decl_line   : 54
    <7bd>   DW_AT_decl_column : 12
    <7be>   DW_AT_type        : <0x489>
    <7c2>   DW_AT_data_member_location: 8
 <2><7c3>: Abbrev Number: 14 (DW_TAG_member)
    <7c4>   DW_AT_name        : (indirect string, offset: 0xc966f): Speed
    <7c8>   DW_AT_decl_file   : 5
    <7c9>   DW_AT_decl_line   : 57
    <7ca>   DW_AT_decl_column : 12
    <7cb>   DW_AT_type        : <0x489>
    <7cf>   DW_AT_data_member_location: 12
 <2><7d0>: Abbrev Number: 14 (DW_TAG_member)
    <7d1>   DW_AT_name        : (indirect string, offset: 0xc9642): Alternate
    <7d5>   DW_AT_decl_file   : 5
    <7d6>   DW_AT_decl_line   : 60
    <7d7>   DW_AT_decl_column : 12
    <7d8>   DW_AT_type        : <0x489>
    <7dc>   DW_AT_data_member_location: 16
 <2><7dd>: Abbrev Number: 0
 <1><7de>: Abbrev Number: 3 (DW_TAG_typedef)
    <7df>   DW_AT_name        : (indirect string, offset: 0xc96bf): GPIO_InitTypeDef
    <7e3>   DW_AT_decl_file   : 5
    <7e4>   DW_AT_decl_line   : 62
    <7e5>   DW_AT_decl_column : 3
    <7e6>   DW_AT_type        : <0x793>
 <1><7ea>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <7eb>   DW_AT_encoding    : 7	(unsigned)
    <7ec>   DW_AT_byte_size   : 1
    <7ed>   DW_AT_type        : <0x426>
    <7f1>   DW_AT_decl_file   : 5
    <7f2>   DW_AT_decl_line   : 68
    <7f3>   DW_AT_decl_column : 1
    <7f4>   DW_AT_sibling     : <0x805>
 <2><7f8>: Abbrev Number: 16 (DW_TAG_enumerator)
    <7f9>   DW_AT_name        : (indirect string, offset: 0xc95e5): GPIO_PIN_RESET
    <7fd>   DW_AT_const_value : 0
 <2><7fe>: Abbrev Number: 16 (DW_TAG_enumerator)
    <7ff>   DW_AT_name        : (indirect string, offset: 0xc9596): GPIO_PIN_SET
    <803>   DW_AT_const_value : 1
 <2><804>: Abbrev Number: 0
 <1><805>: Abbrev Number: 3 (DW_TAG_typedef)
    <806>   DW_AT_name        : (indirect string, offset: 0xc976a): GPIO_PinState
    <80a>   DW_AT_decl_file   : 5
    <80b>   DW_AT_decl_line   : 71
    <80c>   DW_AT_decl_column : 3
    <80d>   DW_AT_type        : <0x7ea>
 <1><811>: Abbrev Number: 17 (DW_TAG_subprogram)
    <812>   DW_AT_external    : 1
    <812>   DW_AT_name        : (indirect string, offset: 0xc9689): HAL_GPIO_Init
    <816>   DW_AT_decl_file   : 5
    <817>   DW_AT_decl_line   : 283
    <819>   DW_AT_decl_column : 19
    <81a>   DW_AT_prototyped  : 1
    <81a>   DW_AT_declaration : 1
    <81a>   DW_AT_sibling     : <0x829>
 <2><81e>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <81f>   DW_AT_type        : <0x829>
 <2><823>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <824>   DW_AT_type        : <0x82f>
 <2><828>: Abbrev Number: 0
 <1><829>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <82a>   DW_AT_byte_size   : 4
    <82b>   DW_AT_type        : <0x546>
 <1><82f>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <830>   DW_AT_byte_size   : 4
    <831>   DW_AT_type        : <0x7de>
 <1><835>: Abbrev Number: 17 (DW_TAG_subprogram)
    <836>   DW_AT_external    : 1
    <836>   DW_AT_name        : (indirect string, offset: 0xc95a3): HAL_GPIO_WritePin
    <83a>   DW_AT_decl_file   : 5
    <83b>   DW_AT_decl_line   : 296
    <83d>   DW_AT_decl_column : 19
    <83e>   DW_AT_prototyped  : 1
    <83e>   DW_AT_declaration : 1
    <83e>   DW_AT_sibling     : <0x852>
 <2><842>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <843>   DW_AT_type        : <0x829>
 <2><847>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <848>   DW_AT_type        : <0x47d>
 <2><84c>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <84d>   DW_AT_type        : <0x805>
 <2><851>: Abbrev Number: 0
 <1><852>: Abbrev Number: 20 (DW_TAG_subprogram)
    <853>   DW_AT_external    : 1
    <853>   DW_AT_name        : (indirect string, offset: 0xc969d): MX_GPIO_Init
    <857>   DW_AT_decl_file   : 1
    <858>   DW_AT_decl_line   : 42
    <859>   DW_AT_decl_column : 6
    <85a>   DW_AT_prototyped  : 1
    <85a>   DW_AT_low_pc      : 0x80005c4
    <85e>   DW_AT_high_pc     : 0x94
    <862>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <864>   DW_AT_GNU_all_tail_call_sites: 1
 <2><864>: Abbrev Number: 21 (DW_TAG_variable)
    <865>   DW_AT_name        : (indirect string, offset: 0xc96d9): GPIO_InitStruct
    <869>   DW_AT_decl_file   : 1
    <86a>   DW_AT_decl_line   : 45
    <86b>   DW_AT_decl_column : 20
    <86c>   DW_AT_type        : <0x7de>
    <870>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><873>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <874>   DW_AT_low_pc      : 0x80005da
    <878>   DW_AT_high_pc     : 0x18
    <87c>   DW_AT_sibling     : <0x890>
 <3><880>: Abbrev Number: 21 (DW_TAG_variable)
    <881>   DW_AT_name        : (indirect string, offset: 0xc9550): tmpreg
    <885>   DW_AT_decl_file   : 1
    <886>   DW_AT_decl_line   : 48
    <887>   DW_AT_decl_column : 3
    <888>   DW_AT_type        : <0x495>
    <88c>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><88f>: Abbrev Number: 0
 <2><890>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <891>   DW_AT_low_pc      : 0x80005f2
    <895>   DW_AT_high_pc     : 0x18
    <899>   DW_AT_sibling     : <0x8ad>
 <3><89d>: Abbrev Number: 21 (DW_TAG_variable)
    <89e>   DW_AT_name        : (indirect string, offset: 0xc9550): tmpreg
    <8a2>   DW_AT_decl_file   : 1
    <8a3>   DW_AT_decl_line   : 49
    <8a4>   DW_AT_decl_column : 3
    <8a5>   DW_AT_type        : <0x495>
    <8a9>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><8ac>: Abbrev Number: 0
 <2><8ad>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <8ae>   DW_AT_low_pc      : 0x800060a
    <8b2>   DW_AT_high_pc     : 0x18
 <3><8b6>: Abbrev Number: 21 (DW_TAG_variable)
    <8b7>   DW_AT_name        : (indirect string, offset: 0xc9550): tmpreg
    <8bb>   DW_AT_decl_file   : 1
    <8bc>   DW_AT_decl_line   : 50
    <8bd>   DW_AT_decl_column : 3
    <8be>   DW_AT_type        : <0x495>
    <8c2>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><8c5>: Abbrev Number: 0
 <2><8c6>: Abbrev Number: 0
 <1><8c7>: Abbrev Number: 0
  Compilation Unit @ offset 0x8c8:
   Length:        0x9ba (32-bit)
   Version:       4
   Abbrev Offset: 0x268
   Pointer Size:  4
 <0><8d3>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <8d4>   DW_AT_producer    : (indirect string, offset: 0xc2e7a): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <8d8>   DW_AT_language    : 12	(ANSI C99)
    <8d9>   DW_AT_name        : (indirect string, offset: 0xc9d9a): ../Core/Src/main.c
    <8dd>   DW_AT_comp_dir    : (indirect string, offset: 0x4b90c): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/Assign2_Ref_Implementation_FreeRTOS/Debug
    <8e1>   DW_AT_ranges      : 0x30
    <8e5>   DW_AT_low_pc      : 0x0
    <8e9>   DW_AT_stmt_list   : 0x1121
    <8ed>   DW_AT_GNU_macros  : 0x1fb62
 <1><8f1>: Abbrev Number: 2 (DW_TAG_base_type)
    <8f2>   DW_AT_byte_size   : 1
    <8f3>   DW_AT_encoding    : 6	(signed char)
    <8f4>   DW_AT_name        : (indirect string, offset: 0x6518e): signed char
 <1><8f8>: Abbrev Number: 2 (DW_TAG_base_type)
    <8f9>   DW_AT_byte_size   : 1
    <8fa>   DW_AT_encoding    : 8	(unsigned char)
    <8fb>   DW_AT_name        : (indirect string, offset: 0xc1b11): unsigned char
 <1><8ff>: Abbrev Number: 2 (DW_TAG_base_type)
    <900>   DW_AT_byte_size   : 2
    <901>   DW_AT_encoding    : 5	(signed)
    <902>   DW_AT_name        : (indirect string, offset: 0x95619): short int
 <1><906>: Abbrev Number: 2 (DW_TAG_base_type)
    <907>   DW_AT_byte_size   : 2
    <908>   DW_AT_encoding    : 7	(unsigned)
    <909>   DW_AT_name        : (indirect string, offset: 0xc031f): short unsigned int
 <1><90d>: Abbrev Number: 2 (DW_TAG_base_type)
    <90e>   DW_AT_byte_size   : 4
    <90f>   DW_AT_encoding    : 5	(signed)
    <910>   DW_AT_name        : (indirect string, offset: 0x11460): long int
 <1><914>: Abbrev Number: 3 (DW_TAG_typedef)
    <915>   DW_AT_name        : (indirect string, offset: 0x80696): __uint32_t
    <919>   DW_AT_decl_file   : 3
    <91a>   DW_AT_decl_line   : 79
    <91b>   DW_AT_decl_column : 25
    <91c>   DW_AT_type        : <0x920>
 <1><920>: Abbrev Number: 2 (DW_TAG_base_type)
    <921>   DW_AT_byte_size   : 4
    <922>   DW_AT_encoding    : 7	(unsigned)
    <923>   DW_AT_name        : (indirect string, offset: 0x4ce83): long unsigned int
 <1><927>: Abbrev Number: 2 (DW_TAG_base_type)
    <928>   DW_AT_byte_size   : 8
    <929>   DW_AT_encoding    : 5	(signed)
    <92a>   DW_AT_name        : (indirect string, offset: 0x5bfce): long long int
 <1><92e>: Abbrev Number: 2 (DW_TAG_base_type)
    <92f>   DW_AT_byte_size   : 8
    <930>   DW_AT_encoding    : 7	(unsigned)
    <931>   DW_AT_name        : (indirect string, offset: 0x29bc5): long long unsigned int
 <1><935>: Abbrev Number: 4 (DW_TAG_base_type)
    <936>   DW_AT_byte_size   : 4
    <937>   DW_AT_encoding    : 5	(signed)
    <938>   DW_AT_name        : int
 <1><93c>: Abbrev Number: 2 (DW_TAG_base_type)
    <93d>   DW_AT_byte_size   : 4
    <93e>   DW_AT_encoding    : 7	(unsigned)
    <93f>   DW_AT_name        : (indirect string, offset: 0x10a36): unsigned int
 <1><943>: Abbrev Number: 3 (DW_TAG_typedef)
    <944>   DW_AT_name        : (indirect string, offset: 0x91d12): uint32_t
    <948>   DW_AT_decl_file   : 4
    <949>   DW_AT_decl_line   : 48
    <94a>   DW_AT_decl_column : 20
    <94b>   DW_AT_type        : <0x914>
 <1><94f>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <950>   DW_AT_type        : <0x943>
 <1><954>: Abbrev Number: 6 (DW_TAG_structure_type)
    <955>   DW_AT_byte_size   : 16
    <956>   DW_AT_decl_file   : 5
    <957>   DW_AT_decl_line   : 360
    <959>   DW_AT_decl_column : 9
    <95a>   DW_AT_sibling     : <0x997>
 <2><95e>: Abbrev Number: 7 (DW_TAG_member)
    <95f>   DW_AT_name        : CCR
    <963>   DW_AT_decl_file   : 5
    <964>   DW_AT_decl_line   : 362
    <966>   DW_AT_decl_column : 17
    <967>   DW_AT_type        : <0x94f>
    <96b>   DW_AT_data_member_location: 0
 <2><96c>: Abbrev Number: 8 (DW_TAG_member)
    <96d>   DW_AT_name        : (indirect string, offset: 0xc9bc9): CNDTR
    <971>   DW_AT_decl_file   : 5
    <972>   DW_AT_decl_line   : 363
    <974>   DW_AT_decl_column : 17
    <975>   DW_AT_type        : <0x94f>
    <979>   DW_AT_data_member_location: 4
 <2><97a>: Abbrev Number: 8 (DW_TAG_member)
    <97b>   DW_AT_name        : (indirect string, offset: 0xc9e14): CPAR
    <97f>   DW_AT_decl_file   : 5
    <980>   DW_AT_decl_line   : 364
    <982>   DW_AT_decl_column : 17
    <983>   DW_AT_type        : <0x94f>
    <987>   DW_AT_data_member_location: 8
 <2><988>: Abbrev Number: 8 (DW_TAG_member)
    <989>   DW_AT_name        : (indirect string, offset: 0xc9a71): CMAR
    <98d>   DW_AT_decl_file   : 5
    <98e>   DW_AT_decl_line   : 365
    <990>   DW_AT_decl_column : 17
    <991>   DW_AT_type        : <0x94f>
    <995>   DW_AT_data_member_location: 12
 <2><996>: Abbrev Number: 0
 <1><997>: Abbrev Number: 9 (DW_TAG_typedef)
    <998>   DW_AT_name        : (indirect string, offset: 0xc9ded): DMA_Channel_TypeDef
    <99c>   DW_AT_decl_file   : 5
    <99d>   DW_AT_decl_line   : 366
    <99f>   DW_AT_decl_column : 3
    <9a0>   DW_AT_type        : <0x954>
 <1><9a4>: Abbrev Number: 6 (DW_TAG_structure_type)
    <9a5>   DW_AT_byte_size   : 8
    <9a6>   DW_AT_decl_file   : 5
    <9a7>   DW_AT_decl_line   : 368
    <9a9>   DW_AT_decl_column : 9
    <9aa>   DW_AT_sibling     : <0x9cb>
 <2><9ae>: Abbrev Number: 7 (DW_TAG_member)
    <9af>   DW_AT_name        : ISR
    <9b3>   DW_AT_decl_file   : 5
    <9b4>   DW_AT_decl_line   : 370
    <9b6>   DW_AT_decl_column : 17
    <9b7>   DW_AT_type        : <0x94f>
    <9bb>   DW_AT_data_member_location: 0
 <2><9bc>: Abbrev Number: 8 (DW_TAG_member)
    <9bd>   DW_AT_name        : (indirect string, offset: 0xc9c4d): IFCR
    <9c1>   DW_AT_decl_file   : 5
    <9c2>   DW_AT_decl_line   : 371
    <9c4>   DW_AT_decl_column : 17
    <9c5>   DW_AT_type        : <0x94f>
    <9c9>   DW_AT_data_member_location: 4
 <2><9ca>: Abbrev Number: 0
 <1><9cb>: Abbrev Number: 9 (DW_TAG_typedef)
    <9cc>   DW_AT_name        : (indirect string, offset: 0xc9940): DMA_TypeDef
    <9d0>   DW_AT_decl_file   : 5
    <9d1>   DW_AT_decl_line   : 372
    <9d3>   DW_AT_decl_column : 3
    <9d4>   DW_AT_type        : <0x9a4>
 <1><9d8>: Abbrev Number: 6 (DW_TAG_structure_type)
    <9d9>   DW_AT_byte_size   : 104
    <9da>   DW_AT_decl_file   : 5
    <9db>   DW_AT_decl_line   : 770
    <9dd>   DW_AT_decl_column : 9
    <9de>   DW_AT_sibling     : <0xb4e>
 <2><9e2>: Abbrev Number: 7 (DW_TAG_member)
    <9e3>   DW_AT_name        : CR1
    <9e7>   DW_AT_decl_file   : 5
    <9e8>   DW_AT_decl_line   : 772
    <9ea>   DW_AT_decl_column : 17
    <9eb>   DW_AT_type        : <0x94f>
    <9ef>   DW_AT_data_member_location: 0
 <2><9f0>: Abbrev Number: 7 (DW_TAG_member)
    <9f1>   DW_AT_name        : CR2
    <9f5>   DW_AT_decl_file   : 5
    <9f6>   DW_AT_decl_line   : 773
    <9f8>   DW_AT_decl_column : 17
    <9f9>   DW_AT_type        : <0x94f>
    <9fd>   DW_AT_data_member_location: 4
 <2><9fe>: Abbrev Number: 8 (DW_TAG_member)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x5375): SMCR
    <a03>   DW_AT_decl_file   : 5
    <a04>   DW_AT_decl_line   : 774
    <a06>   DW_AT_decl_column : 17
    <a07>   DW_AT_type        : <0x94f>
    <a0b>   DW_AT_data_member_location: 8
 <2><a0c>: Abbrev Number: 8 (DW_TAG_member)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x40587): DIER
    <a11>   DW_AT_decl_file   : 5
    <a12>   DW_AT_decl_line   : 775
    <a14>   DW_AT_decl_column : 17
    <a15>   DW_AT_type        : <0x94f>
    <a19>   DW_AT_data_member_location: 12
 <2><a1a>: Abbrev Number: 7 (DW_TAG_member)
    <a1b>   DW_AT_name        : SR
    <a1e>   DW_AT_decl_file   : 5
    <a1f>   DW_AT_decl_line   : 776
    <a21>   DW_AT_decl_column : 17
    <a22>   DW_AT_type        : <0x94f>
    <a26>   DW_AT_data_member_location: 16
 <2><a27>: Abbrev Number: 7 (DW_TAG_member)
    <a28>   DW_AT_name        : EGR
    <a2c>   DW_AT_decl_file   : 5
    <a2d>   DW_AT_decl_line   : 777
    <a2f>   DW_AT_decl_column : 17
    <a30>   DW_AT_type        : <0x94f>
    <a34>   DW_AT_data_member_location: 20
 <2><a35>: Abbrev Number: 8 (DW_TAG_member)
    <a36>   DW_AT_name        : (indirect string, offset: 0x26cc7): CCMR1
    <a3a>   DW_AT_decl_file   : 5
    <a3b>   DW_AT_decl_line   : 778
    <a3d>   DW_AT_decl_column : 17
    <a3e>   DW_AT_type        : <0x94f>
    <a42>   DW_AT_data_member_location: 24
 <2><a43>: Abbrev Number: 8 (DW_TAG_member)
    <a44>   DW_AT_name        : (indirect string, offset: 0x50546): CCMR2
    <a48>   DW_AT_decl_file   : 5
    <a49>   DW_AT_decl_line   : 779
    <a4b>   DW_AT_decl_column : 17
    <a4c>   DW_AT_type        : <0x94f>
    <a50>   DW_AT_data_member_location: 28
 <2><a51>: Abbrev Number: 8 (DW_TAG_member)
    <a52>   DW_AT_name        : (indirect string, offset: 0x3063a): CCER
    <a56>   DW_AT_decl_file   : 5
    <a57>   DW_AT_decl_line   : 780
    <a59>   DW_AT_decl_column : 17
    <a5a>   DW_AT_type        : <0x94f>
    <a5e>   DW_AT_data_member_location: 32
 <2><a5f>: Abbrev Number: 7 (DW_TAG_member)
    <a60>   DW_AT_name        : CNT
    <a64>   DW_AT_decl_file   : 5
    <a65>   DW_AT_decl_line   : 781
    <a67>   DW_AT_decl_column : 17
    <a68>   DW_AT_type        : <0x94f>
    <a6c>   DW_AT_data_member_location: 36
 <2><a6d>: Abbrev Number: 7 (DW_TAG_member)
    <a6e>   DW_AT_name        : PSC
    <a72>   DW_AT_decl_file   : 5
    <a73>   DW_AT_decl_line   : 782
    <a75>   DW_AT_decl_column : 17
    <a76>   DW_AT_type        : <0x94f>
    <a7a>   DW_AT_data_member_location: 40
 <2><a7b>: Abbrev Number: 7 (DW_TAG_member)
    <a7c>   DW_AT_name        : ARR
    <a80>   DW_AT_decl_file   : 5
    <a81>   DW_AT_decl_line   : 783
    <a83>   DW_AT_decl_column : 17
    <a84>   DW_AT_type        : <0x94f>
    <a88>   DW_AT_data_member_location: 44
 <2><a89>: Abbrev Number: 7 (DW_TAG_member)
    <a8a>   DW_AT_name        : RCR
    <a8e>   DW_AT_decl_file   : 5
    <a8f>   DW_AT_decl_line   : 784
    <a91>   DW_AT_decl_column : 17
    <a92>   DW_AT_type        : <0x94f>
    <a96>   DW_AT_data_member_location: 48
 <2><a97>: Abbrev Number: 8 (DW_TAG_member)
    <a98>   DW_AT_name        : (indirect string, offset: 0x18211): CCR1
    <a9c>   DW_AT_decl_file   : 5
    <a9d>   DW_AT_decl_line   : 785
    <a9f>   DW_AT_decl_column : 17
    <aa0>   DW_AT_type        : <0x94f>
    <aa4>   DW_AT_data_member_location: 52
 <2><aa5>: Abbrev Number: 8 (DW_TAG_member)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x543c5): CCR2
    <aaa>   DW_AT_decl_file   : 5
    <aab>   DW_AT_decl_line   : 786
    <aad>   DW_AT_decl_column : 17
    <aae>   DW_AT_type        : <0x94f>
    <ab2>   DW_AT_data_member_location: 56
 <2><ab3>: Abbrev Number: 8 (DW_TAG_member)
    <ab4>   DW_AT_name        : (indirect string, offset: 0x38e4e): CCR3
    <ab8>   DW_AT_decl_file   : 5
    <ab9>   DW_AT_decl_line   : 787
    <abb>   DW_AT_decl_column : 17
    <abc>   DW_AT_type        : <0x94f>
    <ac0>   DW_AT_data_member_location: 60
 <2><ac1>: Abbrev Number: 8 (DW_TAG_member)
    <ac2>   DW_AT_name        : (indirect string, offset: 0xcd6c): CCR4
    <ac6>   DW_AT_decl_file   : 5
    <ac7>   DW_AT_decl_line   : 788
    <ac9>   DW_AT_decl_column : 17
    <aca>   DW_AT_type        : <0x94f>
    <ace>   DW_AT_data_member_location: 64
 <2><acf>: Abbrev Number: 8 (DW_TAG_member)
    <ad0>   DW_AT_name        : (indirect string, offset: 0x5ccc2): BDTR
    <ad4>   DW_AT_decl_file   : 5
    <ad5>   DW_AT_decl_line   : 789
    <ad7>   DW_AT_decl_column : 17
    <ad8>   DW_AT_type        : <0x94f>
    <adc>   DW_AT_data_member_location: 68
 <2><add>: Abbrev Number: 7 (DW_TAG_member)
    <ade>   DW_AT_name        : DCR
    <ae2>   DW_AT_decl_file   : 5
    <ae3>   DW_AT_decl_line   : 790
    <ae5>   DW_AT_decl_column : 17
    <ae6>   DW_AT_type        : <0x94f>
    <aea>   DW_AT_data_member_location: 72
 <2><aeb>: Abbrev Number: 8 (DW_TAG_member)
    <aec>   DW_AT_name        : (indirect string, offset: 0x94eec): DMAR
    <af0>   DW_AT_decl_file   : 5
    <af1>   DW_AT_decl_line   : 791
    <af3>   DW_AT_decl_column : 17
    <af4>   DW_AT_type        : <0x94f>
    <af8>   DW_AT_data_member_location: 76
 <2><af9>: Abbrev Number: 7 (DW_TAG_member)
    <afa>   DW_AT_name        : OR1
    <afe>   DW_AT_decl_file   : 5
    <aff>   DW_AT_decl_line   : 792
    <b01>   DW_AT_decl_column : 17
    <b02>   DW_AT_type        : <0x94f>
    <b06>   DW_AT_data_member_location: 80
 <2><b07>: Abbrev Number: 8 (DW_TAG_member)
    <b08>   DW_AT_name        : (indirect string, offset: 0xb2ab3): CCMR3
    <b0c>   DW_AT_decl_file   : 5
    <b0d>   DW_AT_decl_line   : 793
    <b0f>   DW_AT_decl_column : 17
    <b10>   DW_AT_type        : <0x94f>
    <b14>   DW_AT_data_member_location: 84
 <2><b15>: Abbrev Number: 8 (DW_TAG_member)
    <b16>   DW_AT_name        : (indirect string, offset: 0x23ac3): CCR5
    <b1a>   DW_AT_decl_file   : 5
    <b1b>   DW_AT_decl_line   : 794
    <b1d>   DW_AT_decl_column : 17
    <b1e>   DW_AT_type        : <0x94f>
    <b22>   DW_AT_data_member_location: 88
 <2><b23>: Abbrev Number: 8 (DW_TAG_member)
    <b24>   DW_AT_name        : (indirect string, offset: 0x8e11f): CCR6
    <b28>   DW_AT_decl_file   : 5
    <b29>   DW_AT_decl_line   : 795
    <b2b>   DW_AT_decl_column : 17
    <b2c>   DW_AT_type        : <0x94f>
    <b30>   DW_AT_data_member_location: 92
 <2><b31>: Abbrev Number: 7 (DW_TAG_member)
    <b32>   DW_AT_name        : OR2
    <b36>   DW_AT_decl_file   : 5
    <b37>   DW_AT_decl_line   : 796
    <b39>   DW_AT_decl_column : 17
    <b3a>   DW_AT_type        : <0x94f>
    <b3e>   DW_AT_data_member_location: 96
 <2><b3f>: Abbrev Number: 7 (DW_TAG_member)
    <b40>   DW_AT_name        : OR3
    <b44>   DW_AT_decl_file   : 5
    <b45>   DW_AT_decl_line   : 797
    <b47>   DW_AT_decl_column : 17
    <b48>   DW_AT_type        : <0x94f>
    <b4c>   DW_AT_data_member_location: 100
 <2><b4d>: Abbrev Number: 0
 <1><b4e>: Abbrev Number: 9 (DW_TAG_typedef)
    <b4f>   DW_AT_name        : (indirect string, offset: 0xc9e01): TIM_TypeDef
    <b53>   DW_AT_decl_file   : 5
    <b54>   DW_AT_decl_line   : 798
    <b56>   DW_AT_decl_column : 3
    <b57>   DW_AT_type        : <0x9d8>
 <1><b5b>: Abbrev Number: 2 (DW_TAG_base_type)
    <b5c>   DW_AT_byte_size   : 8
    <b5d>   DW_AT_encoding    : 4	(float)
    <b5e>   DW_AT_name        : (indirect string, offset: 0x12bbb): long double
 <1><b62>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <b63>   DW_AT_encoding    : 7	(unsigned)
    <b64>   DW_AT_byte_size   : 1
    <b65>   DW_AT_type        : <0x8f8>
    <b69>   DW_AT_decl_file   : 6
    <b6a>   DW_AT_decl_line   : 39
    <b6b>   DW_AT_decl_column : 1
    <b6c>   DW_AT_sibling     : <0xb89>
 <2><b70>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b71>   DW_AT_name        : (indirect string, offset: 0xc991b): HAL_OK
    <b75>   DW_AT_const_value : 0
 <2><b76>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b77>   DW_AT_name        : (indirect string, offset: 0xc9b76): HAL_ERROR
    <b7b>   DW_AT_const_value : 1
 <2><b7c>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b7d>   DW_AT_name        : (indirect string, offset: 0xc9850): HAL_BUSY
    <b81>   DW_AT_const_value : 2
 <2><b82>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b83>   DW_AT_name        : (indirect string, offset: 0xc98de): HAL_TIMEOUT
    <b87>   DW_AT_const_value : 3
 <2><b88>: Abbrev Number: 0
 <1><b89>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8a>   DW_AT_name        : (indirect string, offset: 0xc9778): HAL_StatusTypeDef
    <b8e>   DW_AT_decl_file   : 6
    <b8f>   DW_AT_decl_line   : 44
    <b90>   DW_AT_decl_column : 3
    <b91>   DW_AT_type        : <0xb62>
 <1><b95>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <b96>   DW_AT_encoding    : 7	(unsigned)
    <b97>   DW_AT_byte_size   : 1
    <b98>   DW_AT_type        : <0x8f8>
    <b9c>   DW_AT_decl_file   : 6
    <b9d>   DW_AT_decl_line   : 50
    <b9e>   DW_AT_decl_column : 1
    <b9f>   DW_AT_sibling     : <0xbb0>
 <2><ba3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ba4>   DW_AT_name        : (indirect string, offset: 0xc9c6f): HAL_UNLOCKED
    <ba8>   DW_AT_const_value : 0
 <2><ba9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <baa>   DW_AT_name        : (indirect string, offset: 0xc9e4a): HAL_LOCKED
    <bae>   DW_AT_const_value : 1
 <2><baf>: Abbrev Number: 0
 <1><bb0>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb1>   DW_AT_name        : (indirect string, offset: 0xc9b2d): HAL_LockTypeDef
    <bb5>   DW_AT_decl_file   : 6
    <bb6>   DW_AT_decl_line   : 53
    <bb7>   DW_AT_decl_column : 3
    <bb8>   DW_AT_type        : <0xb95>
 <1><bbc>: Abbrev Number: 12 (DW_TAG_structure_type)
    <bbd>   DW_AT_byte_size   : 28
    <bbe>   DW_AT_decl_file   : 7
    <bbf>   DW_AT_decl_line   : 45
    <bc0>   DW_AT_decl_column : 9
    <bc1>   DW_AT_sibling     : <0xc21>
 <2><bc5>: Abbrev Number: 13 (DW_TAG_member)
    <bc6>   DW_AT_name        : (indirect string, offset: 0xc9bf9): PLLState
    <bca>   DW_AT_decl_file   : 7
    <bcb>   DW_AT_decl_line   : 47
    <bcc>   DW_AT_decl_column : 12
    <bcd>   DW_AT_type        : <0x943>
    <bd1>   DW_AT_data_member_location: 0
 <2><bd2>: Abbrev Number: 13 (DW_TAG_member)
    <bd3>   DW_AT_name        : (indirect string, offset: 0xc9c43): PLLSource
    <bd7>   DW_AT_decl_file   : 7
    <bd8>   DW_AT_decl_line   : 50
    <bd9>   DW_AT_decl_column : 12
    <bda>   DW_AT_type        : <0x943>
    <bde>   DW_AT_data_member_location: 4
 <2><bdf>: Abbrev Number: 13 (DW_TAG_member)
    <be0>   DW_AT_name        : (indirect string, offset: 0xc9bc4): PLLM
    <be4>   DW_AT_decl_file   : 7
    <be5>   DW_AT_decl_line   : 53
    <be6>   DW_AT_decl_column : 12
    <be7>   DW_AT_type        : <0x943>
    <beb>   DW_AT_data_member_location: 8
 <2><bec>: Abbrev Number: 13 (DW_TAG_member)
    <bed>   DW_AT_name        : (indirect string, offset: 0xc9d20): PLLN
    <bf1>   DW_AT_decl_file   : 7
    <bf2>   DW_AT_decl_line   : 57
    <bf3>   DW_AT_decl_column : 12
    <bf4>   DW_AT_type        : <0x943>
    <bf8>   DW_AT_data_member_location: 12
 <2><bf9>: Abbrev Number: 13 (DW_TAG_member)
    <bfa>   DW_AT_name        : (indirect string, offset: 0xc9832): PLLP
    <bfe>   DW_AT_decl_file   : 7
    <bff>   DW_AT_decl_line   : 61
    <c00>   DW_AT_decl_column : 12
    <c01>   DW_AT_type        : <0x943>
    <c05>   DW_AT_data_member_location: 16
 <2><c06>: Abbrev Number: 13 (DW_TAG_member)
    <c07>   DW_AT_name        : (indirect string, offset: 0x4a98b): PLLQ
    <c0b>   DW_AT_decl_file   : 7
    <c0c>   DW_AT_decl_line   : 65
    <c0d>   DW_AT_decl_column : 12
    <c0e>   DW_AT_type        : <0x943>
    <c12>   DW_AT_data_member_location: 20
 <2><c13>: Abbrev Number: 13 (DW_TAG_member)
    <c14>   DW_AT_name        : (indirect string, offset: 0xc9d25): PLLR
    <c18>   DW_AT_decl_file   : 7
    <c19>   DW_AT_decl_line   : 68
    <c1a>   DW_AT_decl_column : 12
    <c1b>   DW_AT_type        : <0x943>
    <c1f>   DW_AT_data_member_location: 24
 <2><c20>: Abbrev Number: 0
 <1><c21>: Abbrev Number: 3 (DW_TAG_typedef)
    <c22>   DW_AT_name        : (indirect string, offset: 0xc9b4f): RCC_PLLInitTypeDef
    <c26>   DW_AT_decl_file   : 7
    <c27>   DW_AT_decl_line   : 73
    <c28>   DW_AT_decl_column : 2
    <c29>   DW_AT_type        : <0xbbc>
 <1><c2d>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c2e>   DW_AT_byte_size   : 68
    <c2f>   DW_AT_decl_file   : 7
    <c30>   DW_AT_decl_line   : 78
    <c31>   DW_AT_decl_column : 9
    <c32>   DW_AT_sibling     : <0xcc6>
 <2><c36>: Abbrev Number: 13 (DW_TAG_member)
    <c37>   DW_AT_name        : (indirect string, offset: 0xc9ce6): OscillatorType
    <c3b>   DW_AT_decl_file   : 7
    <c3c>   DW_AT_decl_line   : 80
    <c3d>   DW_AT_decl_column : 12
    <c3e>   DW_AT_type        : <0x943>
    <c42>   DW_AT_data_member_location: 0
 <2><c43>: Abbrev Number: 13 (DW_TAG_member)
    <c44>   DW_AT_name        : (indirect string, offset: 0xc9c02): HSEState
    <c48>   DW_AT_decl_file   : 7
    <c49>   DW_AT_decl_line   : 83
    <c4a>   DW_AT_decl_column : 12
    <c4b>   DW_AT_type        : <0x943>
    <c4f>   DW_AT_data_member_location: 4
 <2><c50>: Abbrev Number: 13 (DW_TAG_member)
    <c51>   DW_AT_name        : (indirect string, offset: 0xc9b80): LSEState
    <c55>   DW_AT_decl_file   : 7
    <c56>   DW_AT_decl_line   : 86
    <c57>   DW_AT_decl_column : 12
    <c58>   DW_AT_type        : <0x943>
    <c5c>   DW_AT_data_member_location: 8
 <2><c5d>: Abbrev Number: 13 (DW_TAG_member)
    <c5e>   DW_AT_name        : (indirect string, offset: 0xc99d2): HSIState
    <c62>   DW_AT_decl_file   : 7
    <c63>   DW_AT_decl_line   : 89
    <c64>   DW_AT_decl_column : 12
    <c65>   DW_AT_type        : <0x943>
    <c69>   DW_AT_data_member_location: 12
 <2><c6a>: Abbrev Number: 13 (DW_TAG_member)
    <c6b>   DW_AT_name        : (indirect string, offset: 0xc9d86): HSICalibrationValue
    <c6f>   DW_AT_decl_file   : 7
    <c70>   DW_AT_decl_line   : 92
    <c71>   DW_AT_decl_column : 12
    <c72>   DW_AT_type        : <0x943>
    <c76>   DW_AT_data_member_location: 16
 <2><c77>: Abbrev Number: 13 (DW_TAG_member)
    <c78>   DW_AT_name        : (indirect string, offset: 0xc9937): LSIState
    <c7c>   DW_AT_decl_file   : 7
    <c7d>   DW_AT_decl_line   : 98
    <c7e>   DW_AT_decl_column : 12
    <c7f>   DW_AT_type        : <0x943>
    <c83>   DW_AT_data_member_location: 20
 <2><c84>: Abbrev Number: 13 (DW_TAG_member)
    <c85>   DW_AT_name        : (indirect string, offset: 0xc9922): MSIState
    <c89>   DW_AT_decl_file   : 7
    <c8a>   DW_AT_decl_line   : 106
    <c8b>   DW_AT_decl_column : 12
    <c8c>   DW_AT_type        : <0x943>
    <c90>   DW_AT_data_member_location: 24
 <2><c91>: Abbrev Number: 13 (DW_TAG_member)
    <c92>   DW_AT_name        : (indirect string, offset: 0xc98ea): MSICalibrationValue
    <c96>   DW_AT_decl_file   : 7
    <c97>   DW_AT_decl_line   : 109
    <c98>   DW_AT_decl_column : 12
    <c99>   DW_AT_type        : <0x943>
    <c9d>   DW_AT_data_member_location: 28
 <2><c9e>: Abbrev Number: 13 (DW_TAG_member)
    <c9f>   DW_AT_name        : (indirect string, offset: 0xc9a12): MSIClockRange
    <ca3>   DW_AT_decl_file   : 7
    <ca4>   DW_AT_decl_line   : 112
    <ca5>   DW_AT_decl_column : 12
    <ca6>   DW_AT_type        : <0x943>
    <caa>   DW_AT_data_member_location: 32
 <2><cab>: Abbrev Number: 13 (DW_TAG_member)
    <cac>   DW_AT_name        : (indirect string, offset: 0xc9c64): HSI48State
    <cb0>   DW_AT_decl_file   : 7
    <cb1>   DW_AT_decl_line   : 115
    <cb2>   DW_AT_decl_column : 12
    <cb3>   DW_AT_type        : <0x943>
    <cb7>   DW_AT_data_member_location: 36
 <2><cb8>: Abbrev Number: 14 (DW_TAG_member)
    <cb9>   DW_AT_name        : PLL
    <cbd>   DW_AT_decl_file   : 7
    <cbe>   DW_AT_decl_line   : 118
    <cbf>   DW_AT_decl_column : 22
    <cc0>   DW_AT_type        : <0xc21>
    <cc4>   DW_AT_data_member_location: 40
 <2><cc5>: Abbrev Number: 0
 <1><cc6>: Abbrev Number: 3 (DW_TAG_typedef)
    <cc7>   DW_AT_name        : (indirect string, offset: 0xc9a36): RCC_OscInitTypeDef
    <ccb>   DW_AT_decl_file   : 7
    <ccc>   DW_AT_decl_line   : 120
    <ccd>   DW_AT_decl_column : 2
    <cce>   DW_AT_type        : <0xc2d>
 <1><cd2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cd3>   DW_AT_byte_size   : 20
    <cd4>   DW_AT_decl_file   : 7
    <cd5>   DW_AT_decl_line   : 125
    <cd6>   DW_AT_decl_column : 9
    <cd7>   DW_AT_sibling     : <0xd1d>
 <2><cdb>: Abbrev Number: 13 (DW_TAG_member)
    <cdc>   DW_AT_name        : (indirect string, offset: 0xc98fe): ClockType
    <ce0>   DW_AT_decl_file   : 7
    <ce1>   DW_AT_decl_line   : 127
    <ce2>   DW_AT_decl_column : 12
    <ce3>   DW_AT_type        : <0x943>
    <ce7>   DW_AT_data_member_location: 0
 <2><ce8>: Abbrev Number: 13 (DW_TAG_member)
    <ce9>   DW_AT_name        : (indirect string, offset: 0xc9b42): SYSCLKSource
    <ced>   DW_AT_decl_file   : 7
    <cee>   DW_AT_decl_line   : 130
    <cef>   DW_AT_decl_column : 12
    <cf0>   DW_AT_type        : <0x943>
    <cf4>   DW_AT_data_member_location: 4
 <2><cf5>: Abbrev Number: 13 (DW_TAG_member)
    <cf6>   DW_AT_name        : (indirect string, offset: 0xc9d12): AHBCLKDivider
    <cfa>   DW_AT_decl_file   : 7
    <cfb>   DW_AT_decl_line   : 133
    <cfc>   DW_AT_decl_column : 12
    <cfd>   DW_AT_type        : <0x943>
    <d01>   DW_AT_data_member_location: 8
 <2><d02>: Abbrev Number: 13 (DW_TAG_member)
    <d03>   DW_AT_name        : (indirect string, offset: 0xc97b8): APB1CLKDivider
    <d07>   DW_AT_decl_file   : 7
    <d08>   DW_AT_decl_line   : 136
    <d09>   DW_AT_decl_column : 12
    <d0a>   DW_AT_type        : <0x943>
    <d0e>   DW_AT_data_member_location: 12
 <2><d0f>: Abbrev Number: 13 (DW_TAG_member)
    <d10>   DW_AT_name        : (indirect string, offset: 0xc99db): APB2CLKDivider
    <d14>   DW_AT_decl_file   : 7
    <d15>   DW_AT_decl_line   : 139
    <d16>   DW_AT_decl_column : 12
    <d17>   DW_AT_type        : <0x943>
    <d1b>   DW_AT_data_member_location: 16
 <2><d1c>: Abbrev Number: 0
 <1><d1d>: Abbrev Number: 3 (DW_TAG_typedef)
    <d1e>   DW_AT_name        : (indirect string, offset: 0xc9908): RCC_ClkInitTypeDef
    <d22>   DW_AT_decl_file   : 7
    <d23>   DW_AT_decl_line   : 142
    <d24>   DW_AT_decl_column : 2
    <d25>   DW_AT_type        : <0xcd2>
 <1><d29>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d2a>   DW_AT_byte_size   : 32
    <d2b>   DW_AT_decl_file   : 8
    <d2c>   DW_AT_decl_line   : 46
    <d2d>   DW_AT_decl_column : 9
    <d2e>   DW_AT_sibling     : <0xd9b>
 <2><d32>: Abbrev Number: 13 (DW_TAG_member)
    <d33>   DW_AT_name        : (indirect string, offset: 0xc9dad): Request
    <d37>   DW_AT_decl_file   : 8
    <d38>   DW_AT_decl_line   : 48
    <d39>   DW_AT_decl_column : 12
    <d3a>   DW_AT_type        : <0x943>
    <d3e>   DW_AT_data_member_location: 0
 <2><d3f>: Abbrev Number: 13 (DW_TAG_member)
    <d40>   DW_AT_name        : (indirect string, offset: 0xd1003): Direction
    <d44>   DW_AT_decl_file   : 8
    <d45>   DW_AT_decl_line   : 51
    <d46>   DW_AT_decl_column : 12
    <d47>   DW_AT_type        : <0x943>
    <d4b>   DW_AT_data_member_location: 4
 <2><d4c>: Abbrev Number: 13 (DW_TAG_member)
    <d4d>   DW_AT_name        : (indirect string, offset: 0xc9811): PeriphInc
    <d51>   DW_AT_decl_file   : 8
    <d52>   DW_AT_decl_line   : 55
    <d53>   DW_AT_decl_column : 12
    <d54>   DW_AT_type        : <0x943>
    <d58>   DW_AT_data_member_location: 8
 <2><d59>: Abbrev Number: 13 (DW_TAG_member)
    <d5a>   DW_AT_name        : (indirect string, offset: 0xc9849): MemInc
    <d5e>   DW_AT_decl_file   : 8
    <d5f>   DW_AT_decl_line   : 58
    <d60>   DW_AT_decl_column : 12
    <d61>   DW_AT_type        : <0x943>
    <d65>   DW_AT_data_member_location: 12
 <2><d66>: Abbrev Number: 13 (DW_TAG_member)
    <d67>   DW_AT_name        : (indirect string, offset: 0xc99ea): PeriphDataAlignment
    <d6b>   DW_AT_decl_file   : 8
    <d6c>   DW_AT_decl_line   : 61
    <d6d>   DW_AT_decl_column : 12
    <d6e>   DW_AT_type        : <0x943>
    <d72>   DW_AT_data_member_location: 16
 <2><d73>: Abbrev Number: 13 (DW_TAG_member)
    <d74>   DW_AT_name        : (indirect string, offset: 0xc9db5): MemDataAlignment
    <d78>   DW_AT_decl_file   : 8
    <d79>   DW_AT_decl_line   : 64
    <d7a>   DW_AT_decl_column : 12
    <d7b>   DW_AT_type        : <0x943>
    <d7f>   DW_AT_data_member_location: 20
 <2><d80>: Abbrev Number: 13 (DW_TAG_member)
    <d81>   DW_AT_name        : (indirect string, offset: 0xd0707): Mode
    <d85>   DW_AT_decl_file   : 8
    <d86>   DW_AT_decl_line   : 67
    <d87>   DW_AT_decl_column : 12
    <d88>   DW_AT_type        : <0x943>
    <d8c>   DW_AT_data_member_location: 24
 <2><d8d>: Abbrev Number: 13 (DW_TAG_member)
    <d8e>   DW_AT_name        : (indirect string, offset: 0xcfded): Priority
    <d92>   DW_AT_decl_file   : 8
    <d93>   DW_AT_decl_line   : 72
    <d94>   DW_AT_decl_column : 12
    <d95>   DW_AT_type        : <0x943>
    <d99>   DW_AT_data_member_location: 28
 <2><d9a>: Abbrev Number: 0
 <1><d9b>: Abbrev Number: 3 (DW_TAG_typedef)
    <d9c>   DW_AT_name        : (indirect string, offset: 0xc98ba): DMA_InitTypeDef
    <da0>   DW_AT_decl_file   : 8
    <da1>   DW_AT_decl_line   : 74
    <da2>   DW_AT_decl_column : 3
    <da3>   DW_AT_type        : <0xd29>
 <1><da7>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <da8>   DW_AT_encoding    : 7	(unsigned)
    <da9>   DW_AT_byte_size   : 1
    <daa>   DW_AT_type        : <0x8f8>
    <dae>   DW_AT_decl_file   : 8
    <daf>   DW_AT_decl_line   : 80
    <db0>   DW_AT_decl_column : 1
    <db1>   DW_AT_sibling     : <0xdce>
 <2><db5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0xc9c7c): HAL_DMA_STATE_RESET
    <dba>   DW_AT_const_value : 0
 <2><dbb>: Abbrev Number: 11 (DW_TAG_enumerator)
    <dbc>   DW_AT_name        : (indirect string, offset: 0xc98ca): HAL_DMA_STATE_READY
    <dc0>   DW_AT_const_value : 1
 <2><dc1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <dc2>   DW_AT_name        : (indirect string, offset: 0xc9c30): HAL_DMA_STATE_BUSY
    <dc6>   DW_AT_const_value : 2
 <2><dc7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <dc8>   DW_AT_name        : (indirect string, offset: 0xc9e23): HAL_DMA_STATE_TIMEOUT
    <dcc>   DW_AT_const_value : 3
 <2><dcd>: Abbrev Number: 0
 <1><dce>: Abbrev Number: 3 (DW_TAG_typedef)
    <dcf>   DW_AT_name        : (indirect string, offset: 0xc9be4): HAL_DMA_StateTypeDef
    <dd3>   DW_AT_decl_file   : 8
    <dd4>   DW_AT_decl_line   : 85
    <dd5>   DW_AT_decl_column : 2
    <dd6>   DW_AT_type        : <0xda7>
 <1><dda>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <ddb>   DW_AT_type        : <0xdce>
 <1><ddf>: Abbrev Number: 15 (DW_TAG_structure_type)
    <de0>   DW_AT_name        : (indirect string, offset: 0xc9d5e): __DMA_HandleTypeDef
    <de4>   DW_AT_byte_size   : 72
    <de5>   DW_AT_decl_file   : 8
    <de6>   DW_AT_decl_line   : 112
    <de7>   DW_AT_decl_column : 16
    <de8>   DW_AT_sibling     : <0xe89>
 <2><dec>: Abbrev Number: 13 (DW_TAG_member)
    <ded>   DW_AT_name        : (indirect string, offset: 0xc9cf5): Instance
    <df1>   DW_AT_decl_file   : 8
    <df2>   DW_AT_decl_line   : 114
    <df3>   DW_AT_decl_column : 27
    <df4>   DW_AT_type        : <0xe89>
    <df8>   DW_AT_data_member_location: 0
 <2><df9>: Abbrev Number: 13 (DW_TAG_member)
    <dfa>   DW_AT_name        : (indirect string, offset: 0xd0ff5): Init
    <dfe>   DW_AT_decl_file   : 8
    <dff>   DW_AT_decl_line   : 116
    <e00>   DW_AT_decl_column : 25
    <e01>   DW_AT_type        : <0xd9b>
    <e05>   DW_AT_data_member_location: 4
 <2><e06>: Abbrev Number: 13 (DW_TAG_member)
    <e07>   DW_AT_name        : (indirect string, offset: 0x8f254): Lock
    <e0b>   DW_AT_decl_file   : 8
    <e0c>   DW_AT_decl_line   : 118
    <e0d>   DW_AT_decl_column : 25
    <e0e>   DW_AT_type        : <0xbb0>
    <e12>   DW_AT_data_member_location: 36
 <2><e13>: Abbrev Number: 13 (DW_TAG_member)
    <e14>   DW_AT_name        : (indirect string, offset: 0xd204b): State
    <e18>   DW_AT_decl_file   : 8
    <e19>   DW_AT_decl_line   : 120
    <e1a>   DW_AT_decl_column : 30
    <e1b>   DW_AT_type        : <0xdda>
    <e1f>   DW_AT_data_member_location: 37
 <2><e20>: Abbrev Number: 13 (DW_TAG_member)
    <e21>   DW_AT_name        : (indirect string, offset: 0xc9e0d): Parent
    <e25>   DW_AT_decl_file   : 8
    <e26>   DW_AT_decl_line   : 122
    <e27>   DW_AT_decl_column : 26
    <e28>   DW_AT_type        : <0xe8f>
    <e2c>   DW_AT_data_member_location: 40
 <2><e2d>: Abbrev Number: 13 (DW_TAG_member)
    <e2e>   DW_AT_name        : (indirect string, offset: 0xc9e39): XferCpltCallback
    <e32>   DW_AT_decl_file   : 8
    <e33>   DW_AT_decl_line   : 124
    <e34>   DW_AT_decl_column : 28
    <e35>   DW_AT_type        : <0xea2>
    <e39>   DW_AT_data_member_location: 44
 <2><e3a>: Abbrev Number: 13 (DW_TAG_member)
    <e3b>   DW_AT_name        : (indirect string, offset: 0xc9ca9): XferHalfCpltCallback
    <e3f>   DW_AT_decl_file   : 8
    <e40>   DW_AT_decl_line   : 126
    <e41>   DW_AT_decl_column : 28
    <e42>   DW_AT_type        : <0xea2>
    <e46>   DW_AT_data_member_location: 48
 <2><e47>: Abbrev Number: 13 (DW_TAG_member)
    <e48>   DW_AT_name        : (indirect string, offset: 0xc9837): XferErrorCallback
    <e4c>   DW_AT_decl_file   : 8
    <e4d>   DW_AT_decl_line   : 128
    <e4e>   DW_AT_decl_column : 28
    <e4f>   DW_AT_type        : <0xea2>
    <e53>   DW_AT_data_member_location: 52
 <2><e54>: Abbrev Number: 13 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0xc9dd2): XferAbortCallback
    <e59>   DW_AT_decl_file   : 8
    <e5a>   DW_AT_decl_line   : 130
    <e5b>   DW_AT_decl_column : 28
    <e5c>   DW_AT_type        : <0xea2>
    <e60>   DW_AT_data_member_location: 56
 <2><e61>: Abbrev Number: 13 (DW_TAG_member)
    <e62>   DW_AT_name        : (indirect string, offset: 0xc9e19): ErrorCode
    <e66>   DW_AT_decl_file   : 8
    <e67>   DW_AT_decl_line   : 132
    <e68>   DW_AT_decl_column : 25
    <e69>   DW_AT_type        : <0x94f>
    <e6d>   DW_AT_data_member_location: 60
 <2><e6e>: Abbrev Number: 13 (DW_TAG_member)
    <e6f>   DW_AT_name        : (indirect string, offset: 0xc9988): DmaBaseAddress
    <e73>   DW_AT_decl_file   : 8
    <e74>   DW_AT_decl_line   : 134
    <e75>   DW_AT_decl_column : 26
    <e76>   DW_AT_type        : <0xea8>
    <e7a>   DW_AT_data_member_location: 64
 <2><e7b>: Abbrev Number: 13 (DW_TAG_member)
    <e7c>   DW_AT_name        : (indirect string, offset: 0xc9804): ChannelIndex
    <e80>   DW_AT_decl_file   : 8
    <e81>   DW_AT_decl_line   : 136
    <e82>   DW_AT_decl_column : 25
    <e83>   DW_AT_type        : <0x943>
    <e87>   DW_AT_data_member_location: 68
 <2><e88>: Abbrev Number: 0
 <1><e89>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <e8a>   DW_AT_byte_size   : 4
    <e8b>   DW_AT_type        : <0x997>
 <1><e8f>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <e90>   DW_AT_byte_size   : 4
 <1><e91>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <e92>   DW_AT_prototyped  : 1
    <e92>   DW_AT_sibling     : <0xe9c>
 <2><e96>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <e97>   DW_AT_type        : <0xe9c>
 <2><e9b>: Abbrev Number: 0
 <1><e9c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <e9d>   DW_AT_byte_size   : 4
    <e9e>   DW_AT_type        : <0xddf>
 <1><ea2>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <ea3>   DW_AT_byte_size   : 4
    <ea4>   DW_AT_type        : <0xe91>
 <1><ea8>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <ea9>   DW_AT_byte_size   : 4
    <eaa>   DW_AT_type        : <0x9cb>
 <1><eae>: Abbrev Number: 3 (DW_TAG_typedef)
    <eaf>   DW_AT_name        : (indirect string, offset: 0xc9d60): DMA_HandleTypeDef
    <eb3>   DW_AT_decl_file   : 8
    <eb4>   DW_AT_decl_line   : 153
    <eb5>   DW_AT_decl_column : 2
    <eb6>   DW_AT_type        : <0xddf>
 <1><eba>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <ebb>   DW_AT_byte_size   : 4
    <ebc>   DW_AT_type        : <0xeae>
 <1><ec0>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ec1>   DW_AT_byte_size   : 24
    <ec2>   DW_AT_decl_file   : 9
    <ec3>   DW_AT_decl_line   : 46
    <ec4>   DW_AT_decl_column : 9
    <ec5>   DW_AT_sibling     : <0xf18>
 <2><ec9>: Abbrev Number: 13 (DW_TAG_member)
    <eca>   DW_AT_name        : (indirect string, offset: 0xcdd9f): Prescaler
    <ece>   DW_AT_decl_file   : 9
    <ecf>   DW_AT_decl_line   : 48
    <ed0>   DW_AT_decl_column : 12
    <ed1>   DW_AT_type        : <0x943>
    <ed5>   DW_AT_data_member_location: 0
 <2><ed6>: Abbrev Number: 13 (DW_TAG_member)
    <ed7>   DW_AT_name        : (indirect string, offset: 0xc9dc6): CounterMode
    <edb>   DW_AT_decl_file   : 9
    <edc>   DW_AT_decl_line   : 51
    <edd>   DW_AT_decl_column : 12
    <ede>   DW_AT_type        : <0x943>
    <ee2>   DW_AT_data_member_location: 4
 <2><ee3>: Abbrev Number: 13 (DW_TAG_member)
    <ee4>   DW_AT_name        : (indirect string, offset: 0xd6c65): Period
    <ee8>   DW_AT_decl_file   : 9
    <ee9>   DW_AT_decl_line   : 54
    <eea>   DW_AT_decl_column : 12
    <eeb>   DW_AT_type        : <0x943>
    <eef>   DW_AT_data_member_location: 8
 <2><ef0>: Abbrev Number: 13 (DW_TAG_member)
    <ef1>   DW_AT_name        : (indirect string, offset: 0xc9997): ClockDivision
    <ef5>   DW_AT_decl_file   : 9
    <ef6>   DW_AT_decl_line   : 58
    <ef7>   DW_AT_decl_column : 12
    <ef8>   DW_AT_type        : <0x943>
    <efc>   DW_AT_data_member_location: 12
 <2><efd>: Abbrev Number: 13 (DW_TAG_member)
    <efe>   DW_AT_name        : (indirect string, offset: 0xc9c52): RepetitionCounter
    <f02>   DW_AT_decl_file   : 9
    <f03>   DW_AT_decl_line   : 61
    <f04>   DW_AT_decl_column : 12
    <f05>   DW_AT_type        : <0x943>
    <f09>   DW_AT_data_member_location: 16
 <2><f0a>: Abbrev Number: 13 (DW_TAG_member)
    <f0b>   DW_AT_name        : (indirect string, offset: 0xc9820): AutoReloadPreload
    <f0f>   DW_AT_decl_file   : 9
    <f10>   DW_AT_decl_line   : 72
    <f11>   DW_AT_decl_column : 12
    <f12>   DW_AT_type        : <0x943>
    <f16>   DW_AT_data_member_location: 20
 <2><f17>: Abbrev Number: 0
 <1><f18>: Abbrev Number: 3 (DW_TAG_typedef)
    <f19>   DW_AT_name        : (indirect string, offset: 0xc9cd1): TIM_Base_InitTypeDef
    <f1d>   DW_AT_decl_file   : 9
    <f1e>   DW_AT_decl_line   : 74
    <f1f>   DW_AT_decl_column : 3
    <f20>   DW_AT_type        : <0xec0>
 <1><f24>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <f25>   DW_AT_encoding    : 7	(unsigned)
    <f26>   DW_AT_byte_size   : 1
    <f27>   DW_AT_type        : <0x8f8>
    <f2b>   DW_AT_decl_file   : 9
    <f2c>   DW_AT_decl_line   : 301
    <f2e>   DW_AT_decl_column : 1
    <f2f>   DW_AT_sibling     : <0xf52>
 <2><f33>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f34>   DW_AT_name        : (indirect string, offset: 0xc99fe): HAL_TIM_STATE_RESET
    <f38>   DW_AT_const_value : 0
 <2><f39>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f3a>   DW_AT_name        : (indirect string, offset: 0xc97a4): HAL_TIM_STATE_READY
    <f3e>   DW_AT_const_value : 1
 <2><f3f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f40>   DW_AT_name        : (indirect string, offset: 0xc98a7): HAL_TIM_STATE_BUSY
    <f44>   DW_AT_const_value : 2
 <2><f45>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f46>   DW_AT_name        : (indirect string, offset: 0xc9d2a): HAL_TIM_STATE_TIMEOUT
    <f4a>   DW_AT_const_value : 3
 <2><f4b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f4c>   DW_AT_name        : (indirect string, offset: 0xc9b62): HAL_TIM_STATE_ERROR
    <f50>   DW_AT_const_value : 4
 <2><f51>: Abbrev Number: 0
 <1><f52>: Abbrev Number: 9 (DW_TAG_typedef)
    <f53>   DW_AT_name        : (indirect string, offset: 0xc9bcf): HAL_TIM_StateTypeDef
    <f57>   DW_AT_decl_file   : 9
    <f58>   DW_AT_decl_line   : 307
    <f5a>   DW_AT_decl_column : 3
    <f5b>   DW_AT_type        : <0xf24>
 <1><f5f>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <f60>   DW_AT_type        : <0xf52>
 <1><f64>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <f65>   DW_AT_encoding    : 7	(unsigned)
    <f66>   DW_AT_byte_size   : 1
    <f67>   DW_AT_type        : <0x8f8>
    <f6b>   DW_AT_decl_file   : 9
    <f6c>   DW_AT_decl_line   : 313
    <f6e>   DW_AT_decl_column : 1
    <f6f>   DW_AT_sibling     : <0xf86>
 <2><f73>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f74>   DW_AT_name        : (indirect string, offset: 0xc97e8): HAL_TIM_CHANNEL_STATE_RESET
    <f78>   DW_AT_const_value : 0
 <2><f79>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f7a>   DW_AT_name        : (indirect string, offset: 0xc9b11): HAL_TIM_CHANNEL_STATE_READY
    <f7e>   DW_AT_const_value : 1
 <2><f7f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f80>   DW_AT_name        : (indirect string, offset: 0xc9b89): HAL_TIM_CHANNEL_STATE_BUSY
    <f84>   DW_AT_const_value : 2
 <2><f85>: Abbrev Number: 0
 <1><f86>: Abbrev Number: 9 (DW_TAG_typedef)
    <f87>   DW_AT_name        : (indirect string, offset: 0xc9859): HAL_TIM_ChannelStateTypeDef
    <f8b>   DW_AT_decl_file   : 9
    <f8c>   DW_AT_decl_line   : 317
    <f8e>   DW_AT_decl_column : 3
    <f8f>   DW_AT_type        : <0xf64>
 <1><f93>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <f94>   DW_AT_type        : <0xf86>
 <1><f98>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <f99>   DW_AT_encoding    : 7	(unsigned)
    <f9a>   DW_AT_byte_size   : 1
    <f9b>   DW_AT_type        : <0x8f8>
    <f9f>   DW_AT_decl_file   : 9
    <fa0>   DW_AT_decl_line   : 323
    <fa2>   DW_AT_decl_column : 1
    <fa3>   DW_AT_sibling     : <0xfba>
 <2><fa7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fa8>   DW_AT_name        : (indirect string, offset: 0xc978a): HAL_DMA_BURST_STATE_RESET
    <fac>   DW_AT_const_value : 0
 <2><fad>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fae>   DW_AT_name        : (indirect string, offset: 0xc9a49): HAL_DMA_BURST_STATE_READY
    <fb2>   DW_AT_const_value : 1
 <2><fb3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xc9c90): HAL_DMA_BURST_STATE_BUSY
    <fb8>   DW_AT_const_value : 2
 <2><fb9>: Abbrev Number: 0
 <1><fba>: Abbrev Number: 9 (DW_TAG_typedef)
    <fbb>   DW_AT_name        : (indirect string, offset: 0xc996b): HAL_TIM_DMABurstStateTypeDef
    <fbf>   DW_AT_decl_file   : 9
    <fc0>   DW_AT_decl_line   : 327
    <fc2>   DW_AT_decl_column : 3
    <fc3>   DW_AT_type        : <0xf98>
 <1><fc7>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <fc8>   DW_AT_type        : <0xfba>
 <1><fcc>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <fcd>   DW_AT_encoding    : 7	(unsigned)
    <fce>   DW_AT_byte_size   : 1
    <fcf>   DW_AT_type        : <0x8f8>
    <fd3>   DW_AT_decl_file   : 9
    <fd4>   DW_AT_decl_line   : 333
    <fd6>   DW_AT_decl_column : 1
    <fd7>   DW_AT_sibling     : <0x1006>
 <2><fdb>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fdc>   DW_AT_name        : (indirect string, offset: 0xc9a76): HAL_TIM_ACTIVE_CHANNEL_1
    <fe0>   DW_AT_const_value : 1
 <2><fe1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fe2>   DW_AT_name        : (indirect string, offset: 0xc9a8f): HAL_TIM_ACTIVE_CHANNEL_2
    <fe6>   DW_AT_const_value : 2
 <2><fe7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fe8>   DW_AT_name        : (indirect string, offset: 0xc9aa8): HAL_TIM_ACTIVE_CHANNEL_3
    <fec>   DW_AT_const_value : 4
 <2><fed>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fee>   DW_AT_name        : (indirect string, offset: 0xc9ac1): HAL_TIM_ACTIVE_CHANNEL_4
    <ff2>   DW_AT_const_value : 8
 <2><ff3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ff4>   DW_AT_name        : (indirect string, offset: 0xc9ada): HAL_TIM_ACTIVE_CHANNEL_5
    <ff8>   DW_AT_const_value : 16
 <2><ff9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ffa>   DW_AT_name        : (indirect string, offset: 0xc9af3): HAL_TIM_ACTIVE_CHANNEL_6
    <ffe>   DW_AT_const_value : 32
 <2><fff>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1000>   DW_AT_name        : (indirect string, offset: 0xc99a5): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <1004>   DW_AT_const_value : 0
 <2><1005>: Abbrev Number: 0
 <1><1006>: Abbrev Number: 9 (DW_TAG_typedef)
    <1007>   DW_AT_name        : (indirect string, offset: 0xc9a20): HAL_TIM_ActiveChannel
    <100b>   DW_AT_decl_file   : 9
    <100c>   DW_AT_decl_line   : 341
    <100e>   DW_AT_decl_column : 3
    <100f>   DW_AT_type        : <0xfcc>
 <1><1013>: Abbrev Number: 6 (DW_TAG_structure_type)
    <1014>   DW_AT_byte_size   : 76
    <1015>   DW_AT_decl_file   : 9
    <1016>   DW_AT_decl_line   : 349
    <1018>   DW_AT_decl_column : 9
    <1019>   DW_AT_sibling     : <0x109c>
 <2><101d>: Abbrev Number: 8 (DW_TAG_member)
    <101e>   DW_AT_name        : (indirect string, offset: 0xc9cf5): Instance
    <1022>   DW_AT_decl_file   : 9
    <1023>   DW_AT_decl_line   : 352
    <1025>   DW_AT_decl_column : 39
    <1026>   DW_AT_type        : <0x109c>
    <102a>   DW_AT_data_member_location: 0
 <2><102b>: Abbrev Number: 8 (DW_TAG_member)
    <102c>   DW_AT_name        : (indirect string, offset: 0xd0ff5): Init
    <1030>   DW_AT_decl_file   : 9
    <1031>   DW_AT_decl_line   : 353
    <1033>   DW_AT_decl_column : 38
    <1034>   DW_AT_type        : <0xf18>
    <1038>   DW_AT_data_member_location: 4
 <2><1039>: Abbrev Number: 8 (DW_TAG_member)
    <103a>   DW_AT_name        : (indirect string, offset: 0xc9a2e): Channel
    <103e>   DW_AT_decl_file   : 9
    <103f>   DW_AT_decl_line   : 354
    <1041>   DW_AT_decl_column : 38
    <1042>   DW_AT_type        : <0x1006>
    <1046>   DW_AT_data_member_location: 28
 <2><1047>: Abbrev Number: 8 (DW_TAG_member)
    <1048>   DW_AT_name        : (indirect string, offset: 0xc9b3d): hdma
    <104c>   DW_AT_decl_file   : 9
    <104d>   DW_AT_decl_line   : 355
    <104f>   DW_AT_decl_column : 39
    <1050>   DW_AT_type        : <0x10a2>
    <1054>   DW_AT_data_member_location: 32
 <2><1055>: Abbrev Number: 8 (DW_TAG_member)
    <1056>   DW_AT_name        : (indirect string, offset: 0x8f254): Lock
    <105a>   DW_AT_decl_file   : 9
    <105b>   DW_AT_decl_line   : 357
    <105d>   DW_AT_decl_column : 38
    <105e>   DW_AT_type        : <0xbb0>
    <1062>   DW_AT_data_member_location: 60
 <2><1063>: Abbrev Number: 8 (DW_TAG_member)
    <1064>   DW_AT_name        : (indirect string, offset: 0xd204b): State
    <1068>   DW_AT_decl_file   : 9
    <1069>   DW_AT_decl_line   : 358
    <106b>   DW_AT_decl_column : 38
    <106c>   DW_AT_type        : <0xf5f>
    <1070>   DW_AT_data_member_location: 61
 <2><1071>: Abbrev Number: 8 (DW_TAG_member)
    <1072>   DW_AT_name        : (indirect string, offset: 0xd1cd3): ChannelState
    <1076>   DW_AT_decl_file   : 9
    <1077>   DW_AT_decl_line   : 359
    <1079>   DW_AT_decl_column : 38
    <107a>   DW_AT_type        : <0x10c2>
    <107e>   DW_AT_data_member_location: 62
 <2><107f>: Abbrev Number: 8 (DW_TAG_member)
    <1080>   DW_AT_name        : (indirect string, offset: 0xd23ef): ChannelNState
    <1084>   DW_AT_decl_file   : 9
    <1085>   DW_AT_decl_line   : 360
    <1087>   DW_AT_decl_column : 38
    <1088>   DW_AT_type        : <0x10d7>
    <108c>   DW_AT_data_member_location: 68
 <2><108d>: Abbrev Number: 8 (DW_TAG_member)
    <108e>   DW_AT_name        : (indirect string, offset: 0xd1894): DMABurstState
    <1092>   DW_AT_decl_file   : 9
    <1093>   DW_AT_decl_line   : 361
    <1095>   DW_AT_decl_column : 38
    <1096>   DW_AT_type        : <0xfc7>
    <109a>   DW_AT_data_member_location: 72
 <2><109b>: Abbrev Number: 0
 <1><109c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <109d>   DW_AT_byte_size   : 4
    <109e>   DW_AT_type        : <0xb4e>
 <1><10a2>: Abbrev Number: 21 (DW_TAG_array_type)
    <10a3>   DW_AT_type        : <0xeba>
    <10a7>   DW_AT_sibling     : <0x10b2>
 <2><10ab>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <10ac>   DW_AT_type        : <0x93c>
    <10b0>   DW_AT_upper_bound : 6
 <2><10b1>: Abbrev Number: 0
 <1><10b2>: Abbrev Number: 21 (DW_TAG_array_type)
    <10b3>   DW_AT_type        : <0xf93>
    <10b7>   DW_AT_sibling     : <0x10c2>
 <2><10bb>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <10bc>   DW_AT_type        : <0x93c>
    <10c0>   DW_AT_upper_bound : 5
 <2><10c1>: Abbrev Number: 0
 <1><10c2>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <10c3>   DW_AT_type        : <0x10b2>
 <1><10c7>: Abbrev Number: 21 (DW_TAG_array_type)
    <10c8>   DW_AT_type        : <0xf93>
    <10cc>   DW_AT_sibling     : <0x10d7>
 <2><10d0>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <10d1>   DW_AT_type        : <0x93c>
    <10d5>   DW_AT_upper_bound : 3
 <2><10d6>: Abbrev Number: 0
 <1><10d7>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <10d8>   DW_AT_type        : <0x10c7>
 <1><10dc>: Abbrev Number: 9 (DW_TAG_typedef)
    <10dd>   DW_AT_name        : (indirect string, offset: 0xc9875): TIM_HandleTypeDef
    <10e1>   DW_AT_decl_file   : 9
    <10e2>   DW_AT_decl_line   : 393
    <10e4>   DW_AT_decl_column : 3
    <10e5>   DW_AT_type        : <0x1013>
 <1><10e9>: Abbrev Number: 2 (DW_TAG_base_type)
    <10ea>   DW_AT_byte_size   : 1
    <10eb>   DW_AT_encoding    : 8	(unsigned char)
    <10ec>   DW_AT_name        : (indirect string, offset: 0x40729): char
 <1><10f0>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <10f1>   DW_AT_encoding    : 5	(signed)
    <10f2>   DW_AT_byte_size   : 4
    <10f3>   DW_AT_type        : <0x935>
    <10f7>   DW_AT_decl_file   : 10
    <10f8>   DW_AT_decl_line   : 176
    <10f9>   DW_AT_decl_column : 14
    <10fa>   DW_AT_sibling     : <0x1132>
 <2><10fe>: Abbrev Number: 11 (DW_TAG_enumerator)
    <10ff>   DW_AT_name        : (indirect string, offset: 0x9a9c0): osOK
    <1103>   DW_AT_const_value : 0
 <2><1104>: Abbrev Number: 23 (DW_TAG_enumerator)
    <1105>   DW_AT_name        : (indirect string, offset: 0x5d2a3): osError
    <1109>   DW_AT_const_value : -1
 <2><110a>: Abbrev Number: 23 (DW_TAG_enumerator)
    <110b>   DW_AT_name        : (indirect string, offset: 0x2279b): osErrorTimeout
    <110f>   DW_AT_const_value : -2
 <2><1110>: Abbrev Number: 23 (DW_TAG_enumerator)
    <1111>   DW_AT_name        : (indirect string, offset: 0x83dad): osErrorResource
    <1115>   DW_AT_const_value : -3
 <2><1116>: Abbrev Number: 23 (DW_TAG_enumerator)
    <1117>   DW_AT_name        : (indirect string, offset: 0x340d3): osErrorParameter
    <111b>   DW_AT_const_value : -4
 <2><111c>: Abbrev Number: 23 (DW_TAG_enumerator)
    <111d>   DW_AT_name        : (indirect string, offset: 0x22e69): osErrorNoMemory
    <1121>   DW_AT_const_value : -5
 <2><1122>: Abbrev Number: 23 (DW_TAG_enumerator)
    <1123>   DW_AT_name        : (indirect string, offset: 0x361e9): osErrorISR
    <1127>   DW_AT_const_value : -6
 <2><1128>: Abbrev Number: 24 (DW_TAG_enumerator)
    <1129>   DW_AT_name        : (indirect string, offset: 0x65d14): osStatusReserved
    <112d>   DW_AT_const_value : 0x7fffffff
 <2><1131>: Abbrev Number: 0
 <1><1132>: Abbrev Number: 3 (DW_TAG_typedef)
    <1133>   DW_AT_name        : (indirect string, offset: 0x441a6): osStatus_t
    <1137>   DW_AT_decl_file   : 10
    <1138>   DW_AT_decl_line   : 185
    <1139>   DW_AT_decl_column : 3
    <113a>   DW_AT_type        : <0x10f0>
 <1><113e>: Abbrev Number: 25 (DW_TAG_subprogram)
    <113f>   DW_AT_external    : 1
    <113f>   DW_AT_name        : (indirect string, offset: 0xc992b): HAL_IncTick
    <1143>   DW_AT_decl_file   : 12
    <1144>   DW_AT_decl_line   : 651
    <1146>   DW_AT_decl_column : 20
    <1147>   DW_AT_prototyped  : 1
    <1147>   DW_AT_declaration : 1
 <1><1147>: Abbrev Number: 26 (DW_TAG_subprogram)
    <1148>   DW_AT_external    : 1
    <1148>   DW_AT_name        : (indirect string, offset: 0xc9d72): HAL_RCC_ClockConfig
    <114c>   DW_AT_decl_file   : 7
    <114d>   DW_AT_decl_line   : 4837
    <114f>   DW_AT_decl_column : 19
    <1150>   DW_AT_prototyped  : 1
    <1150>   DW_AT_type        : <0xb89>
    <1154>   DW_AT_declaration : 1
    <1154>   DW_AT_sibling     : <0x1163>
 <2><1158>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <1159>   DW_AT_type        : <0x1163>
 <2><115d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <115e>   DW_AT_type        : <0x943>
 <2><1162>: Abbrev Number: 0
 <1><1163>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1164>   DW_AT_byte_size   : 4
    <1165>   DW_AT_type        : <0xd1d>
 <1><1169>: Abbrev Number: 26 (DW_TAG_subprogram)
    <116a>   DW_AT_external    : 1
    <116a>   DW_AT_name        : (indirect string, offset: 0xc9c0b): HAL_RCC_OscConfig
    <116e>   DW_AT_decl_file   : 7
    <116f>   DW_AT_decl_line   : 4836
    <1171>   DW_AT_decl_column : 19
    <1172>   DW_AT_prototyped  : 1
    <1172>   DW_AT_type        : <0xb89>
    <1176>   DW_AT_declaration : 1
    <1176>   DW_AT_sibling     : <0x1180>
 <2><117a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <117b>   DW_AT_type        : <0x1180>
 <2><117f>: Abbrev Number: 0
 <1><1180>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1181>   DW_AT_byte_size   : 4
    <1182>   DW_AT_type        : <0xcc6>
 <1><1186>: Abbrev Number: 26 (DW_TAG_subprogram)
    <1187>   DW_AT_external    : 1
    <1187>   DW_AT_name        : (indirect string, offset: 0xc9ba4): HAL_PWREx_ControlVoltageScaling
    <118b>   DW_AT_decl_file   : 11
    <118c>   DW_AT_decl_line   : 837
    <118e>   DW_AT_decl_column : 19
    <118f>   DW_AT_prototyped  : 1
    <118f>   DW_AT_type        : <0xb89>
    <1193>   DW_AT_declaration : 1
    <1193>   DW_AT_sibling     : <0x119d>
 <2><1197>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <1198>   DW_AT_type        : <0x943>
 <2><119c>: Abbrev Number: 0
 <1><119d>: Abbrev Number: 27 (DW_TAG_subprogram)
    <119e>   DW_AT_external    : 1
    <119e>   DW_AT_name        : (indirect string, offset: 0xc9899): osKernelStart
    <11a2>   DW_AT_decl_file   : 10
    <11a3>   DW_AT_decl_line   : 302
    <11a5>   DW_AT_decl_column : 12
    <11a6>   DW_AT_prototyped  : 1
    <11a6>   DW_AT_type        : <0x1132>
    <11aa>   DW_AT_declaration : 1
 <1><11aa>: Abbrev Number: 28 (DW_TAG_subprogram)
    <11ab>   DW_AT_external    : 1
    <11ab>   DW_AT_name        : (indirect string, offset: 0xa1889): MX_FREERTOS_Init
    <11af>   DW_AT_decl_file   : 1
    <11b0>   DW_AT_decl_line   : 52
    <11b1>   DW_AT_decl_column : 6
    <11b2>   DW_AT_prototyped  : 1
    <11b2>   DW_AT_declaration : 1
 <1><11b2>: Abbrev Number: 27 (DW_TAG_subprogram)
    <11b3>   DW_AT_external    : 1
    <11b3>   DW_AT_name        : (indirect string, offset: 0xc9cbe): osKernelInitialize
    <11b7>   DW_AT_decl_file   : 10
    <11b8>   DW_AT_decl_line   : 287
    <11ba>   DW_AT_decl_column : 12
    <11bb>   DW_AT_prototyped  : 1
    <11bb>   DW_AT_type        : <0x1132>
    <11bf>   DW_AT_declaration : 1
 <1><11bf>: Abbrev Number: 28 (DW_TAG_subprogram)
    <11c0>   DW_AT_external    : 1
    <11c0>   DW_AT_name        : (indirect string, offset: 0xc9cfe): MX_USART2_UART_Init
    <11c4>   DW_AT_decl_file   : 13
    <11c5>   DW_AT_decl_line   : 41
    <11c6>   DW_AT_decl_column : 6
    <11c7>   DW_AT_prototyped  : 1
    <11c7>   DW_AT_declaration : 1
 <1><11c7>: Abbrev Number: 28 (DW_TAG_subprogram)
    <11c8>   DW_AT_external    : 1
    <11c8>   DW_AT_name        : (indirect string, offset: 0xc969d): MX_GPIO_Init
    <11cc>   DW_AT_decl_file   : 14
    <11cd>   DW_AT_decl_line   : 39
    <11ce>   DW_AT_decl_column : 6
    <11cf>   DW_AT_prototyped  : 1
    <11cf>   DW_AT_declaration : 1
 <1><11cf>: Abbrev Number: 27 (DW_TAG_subprogram)
    <11d0>   DW_AT_external    : 1
