Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x458 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xc532f): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x8a7b1): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xca836): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/Assign2_Rieder_Nikolaus/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x10c21): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5cfba): long long int

 <2><1cf>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x872de): osPriorityHigh7
    <1d4>   DW_AT_const_value : 47
 <2><1d5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1d6>   DW_AT_name        : (indirect string, offset: 0xb7c97): osPriorityRealtime
    <1da>   DW_AT_const_value : 48
 <2><1db>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x7ffcd): osPriorityRealtime1
    <1e0>   DW_AT_const_value : 49
 <2><1e1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x7ffe1): osPriorityRealtime2
    <1e6>   DW_AT_const_value : 50
 <2><1e7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x7fff5): osPriorityRealtime3
    <1ec>   DW_AT_const_value : 51
 <2><1ed>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1ee>   DW_AT_name        : (indirect string, offset: 0x80009): osPriorityRealtime4
    <1f2>   DW_AT_const_value : 52
 <2><1f3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x8001d): osPriorityRealtime5
    <1f8>   DW_AT_const_value : 53
 <2><1f9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1fa>   DW_AT_name        : (indirect string, offset: 0x80031): osPriorityRealtime6
    <1fe>   DW_AT_const_value : 54
 <2><1ff>: Abbrev Number: 11 (DW_TAG_enumerator)
    <200>   DW_AT_name        : (indirect string, offset: 0x80045): osPriorityRealtime7
    <204>   DW_AT_const_value : 55
 <2><205>: Abbrev Number: 11 (DW_TAG_enumerator)
    <206>   DW_AT_name        : (indirect string, offset: 0xd08): osPriorityISR
    <20a>   DW_AT_const_value : 56
 <2><20b>: Abbrev Number: 12 (DW_TAG_enumerator)
    <20c>   DW_AT_name        : (indirect string, offset: 0xb3223): osPriorityError
    <210>   DW_AT_const_value : -1
 <2><211>: Abbrev Number: 13 (DW_TAG_enumerator)
    <212>   DW_AT_name        : (indirect string, offset: 0xc0f30): osPriorityReserved
    <216>   DW_AT_const_value : 0x7fffffff
 <2><21a>: Abbrev Number: 0
 <1><21b>: Abbrev Number: 4 (DW_TAG_typedef)
    <21c>   DW_AT_name        : (indirect string, offset: 0x95afe): osPriority_t
    <220>   DW_AT_decl_file   : 4
    <221>   DW_AT_decl_line   : 136
    <222>   DW_AT_decl_column : 3
    <223>   DW_AT_type        : <0xcb>
 <1><227>: Abbrev Number: 4 (DW_TAG_typedef)
    <228>   DW_AT_name        : (indirect string, offset: 0x6e81a): osThreadFunc_t
    <22c>   DW_AT_decl_file   : 4
    <22d>   DW_AT_decl_line   : 139
    <22e>   DW_AT_decl_column : 16
    <22f>   DW_AT_type        : <0xa6>
 <1><233>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <234>   DW_AT_encoding    : 5	(signed)
    <235>   DW_AT_byte_size   : 4
    <236>   DW_AT_type        : <0x29>
    <23a>   DW_AT_decl_file   : 4
    <23b>   DW_AT_decl_line   : 176
    <23c>   DW_AT_decl_column : 14
    <23d>   DW_AT_sibling     : <0x275>
 <2><241>: Abbrev Number: 11 (DW_TAG_enumerator)
    <242>   DW_AT_name        : (indirect string, offset: 0x9c5cc): osOK
    <246>   DW_AT_const_value : 0
 <2><247>: Abbrev Number: 12 (DW_TAG_enumerator)
    <248>   DW_AT_name        : (indirect string, offset: 0x5e316): osError
    <24c>   DW_AT_const_value : -1
 <2><24d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <24e>   DW_AT_name        : (indirect string, offset: 0x22c3b): osErrorTimeout
    <252>   DW_AT_const_value : -2
 <2><253>: Abbrev Number: 12 (DW_TAG_enumerator)
    <254>   DW_AT_name        : (indirect string, offset: 0x856ab): osErrorResource
    <258>   DW_AT_const_value : -3
 <2><259>: Abbrev Number: 12 (DW_TAG_enumerator)
    <25a>   DW_AT_name        : (indirect string, offset: 0x34ad4): osErrorParameter
    <25e>   DW_AT_const_value : -4
 <2><25f>: Abbrev Number: 12 (DW_TAG_enumerator)
    <260>   DW_AT_name        : (indirect string, offset: 0x23309): osErrorNoMemory
    <264>   DW_AT_const_value : -5
 <2><265>: Abbrev Number: 12 (DW_TAG_enumerator)
    <266>   DW_AT_name        : (indirect string, offset: 0x36c13): osErrorISR
    <26a>   DW_AT_const_value : -6
 <2><26b>: Abbrev Number: 13 (DW_TAG_enumerator)
    <26c>   DW_AT_name        : (indirect string, offset: 0x66f74): osStatusReserved
    <270>   DW_AT_const_value : 0x7fffffff
 <2><274>: Abbrev Number: 0
 <1><275>: Abbrev Number: 4 (DW_TAG_typedef)
    <276>   DW_AT_name        : (indirect string, offset: 0x44eb4): osStatus_t
    <27a>   DW_AT_decl_file   : 4
    <27b>   DW_AT_decl_line   : 185
    <27c>   DW_AT_decl_column : 3
    <27d>   DW_AT_type        : <0x233>
 <1><281>: Abbrev Number: 4 (DW_TAG_typedef)
    <282>   DW_AT_name        : (indirect string, offset: 0x250d0): osThreadId_t
    <286>   DW_AT_decl_file   : 4
    <287>   DW_AT_decl_line   : 189
    <288>   DW_AT_decl_column : 15
    <289>   DW_AT_type        : <0xb7>
 <1><28d>: Abbrev Number: 4 (DW_TAG_typedef)
    <28e>   DW_AT_name        : (indirect string, offset: 0xb570): osMemoryPoolId_t
    <292>   DW_AT_decl_file   : 4
    <293>   DW_AT_decl_line   : 204
    <294>   DW_AT_decl_column : 15
    <295>   DW_AT_type        : <0xb7>
 <1><299>: Abbrev Number: 4 (DW_TAG_typedef)
    <29a>   DW_AT_name        : (indirect string, offset: 0x88e66): TZ_ModuleId_t
    <29e>   DW_AT_decl_file   : 4
    <29f>   DW_AT_decl_line   : 213
    <2a0>   DW_AT_decl_column : 18
    <2a1>   DW_AT_type        : <0x9a>
 <1><2a5>: Abbrev Number: 14 (DW_TAG_structure_type)
    <2a6>   DW_AT_byte_size   : 36
    <2a7>   DW_AT_decl_file   : 4
    <2a8>   DW_AT_decl_line   : 218
    <2a9>   DW_AT_decl_column : 9
    <2aa>   DW_AT_sibling     : <0x324>
 <2><2ae>: Abbrev Number: 15 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0xb5ac5): name
    <2b3>   DW_AT_decl_file   : 4
    <2b4>   DW_AT_decl_line   : 219
    <2b5>   DW_AT_decl_column : 33
    <2b6>   DW_AT_type        : <0xc5>
    <2ba>   DW_AT_data_member_location: 0
 <2><2bb>: Abbrev Number: 15 (DW_TAG_member)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x853ef): attr_bits
    <2c0>   DW_AT_decl_file   : 4
    <2c1>   DW_AT_decl_line   : 220
    <2c2>   DW_AT_decl_column : 28
    <2c3>   DW_AT_type        : <0x9a>
    <2c7>   DW_AT_data_member_location: 4
 <2><2c8>: Abbrev Number: 15 (DW_TAG_member)
    <2c9>   DW_AT_name        : (indirect string, offset: 0x27970): cb_mem
    <2cd>   DW_AT_decl_file   : 4
    <2ce>   DW_AT_decl_line   : 221
    <2cf>   DW_AT_decl_column : 30
    <2d0>   DW_AT_type        : <0xb7>
    <2d4>   DW_AT_data_member_location: 8
 <2><2d5>: Abbrev Number: 15 (DW_TAG_member)
    <2d6>   DW_AT_name        : (indirect string, offset: 0xc0166): cb_size
    <2da>   DW_AT_decl_file   : 4
    <2db>   DW_AT_decl_line   : 222
    <2dc>   DW_AT_decl_column : 30
    <2dd>   DW_AT_type        : <0x9a>
    <2e1>   DW_AT_data_member_location: 12
 <2><2e2>: Abbrev Number: 15 (DW_TAG_member)
    <2e3>   DW_AT_name        : (indirect string, offset: 0xb85a7): stack_mem
    <2e7>   DW_AT_decl_file   : 4
    <2e8>   DW_AT_decl_line   : 223
    <2e9>   DW_AT_decl_column : 27
    <2ea>   DW_AT_type        : <0xb7>
    <2ee>   DW_AT_data_member_location: 16
 <2><2ef>: Abbrev Number: 15 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x800aa): stack_size
    <2f4>   DW_AT_decl_file   : 4
    <2f5>   DW_AT_decl_line   : 224
    <2f6>   DW_AT_decl_column : 27
    <2f7>   DW_AT_type        : <0x9a>
    <2fb>   DW_AT_data_member_location: 20
 <2><2fc>: Abbrev Number: 15 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0x50a3c): priority
    <301>   DW_AT_decl_file   : 4
    <302>   DW_AT_decl_line   : 225
    <303>   DW_AT_decl_column : 29
    <304>   DW_AT_type        : <0x21b>
    <308>   DW_AT_data_member_location: 24
 <2><309>: Abbrev Number: 15 (DW_TAG_member)
    <30a>   DW_AT_name        : (indirect string, offset: 0x56be6): tz_module
    <30e>   DW_AT_decl_file   : 4
    <30f>   DW_AT_decl_line   : 226
    <310>   DW_AT_decl_column : 28
    <311>   DW_AT_type        : <0x299>
    <315>   DW_AT_data_member_location: 28
 <2><316>: Abbrev Number: 15 (DW_TAG_member)
    <317>   DW_AT_name        : (indirect string, offset: 0xb634f): reserved
    <31b>   DW_AT_decl_file   : 4
    <31c>   DW_AT_decl_line   : 227
    <31d>   DW_AT_decl_column : 29
    <31e>   DW_AT_type        : <0x9a>
    <322>   DW_AT_data_member_location: 32
 <2><323>: Abbrev Number: 0
 <1><324>: Abbrev Number: 4 (DW_TAG_typedef)
    <325>   DW_AT_name        : (indirect string, offset: 0x20168): osThreadAttr_t
    <329>   DW_AT_decl_file   : 4
    <32a>   DW_AT_decl_line   : 228
    <32b>   DW_AT_decl_column : 3
    <32c>   DW_AT_type        : <0x2a5>
 <1><330>: Abbrev Number: 9 (DW_TAG_const_type)
    <331>   DW_AT_type        : <0x324>
 <1><335>: Abbrev Number: 16 (DW_TAG_variable)
    <336>   DW_AT_name        : (indirect string, offset: 0x283ee): taskPoolHandle
    <33a>   DW_AT_decl_file   : 5
    <33b>   DW_AT_decl_line   : 20
    <33c>   DW_AT_decl_column : 25
    <33d>   DW_AT_type        : <0x28d>
    <341>   DW_AT_external    : 1
    <341>   DW_AT_declaration : 1
 <1><341>: Abbrev Number: 17 (DW_TAG_variable)
    <342>   DW_AT_specification: <0x335>
    <346>   DW_AT_decl_file   : 1
    <347>   DW_AT_decl_line   : 57
    <348>   DW_AT_decl_column : 18
    <349>   DW_AT_location    : 5 byte block: 3 bc 0 0 20 	(DW_OP_addr: 200000bc)
 <1><34f>: Abbrev Number: 18 (DW_TAG_variable)
    <350>   DW_AT_name        : (indirect string, offset: 0x67ca4): producerCount
    <354>   DW_AT_decl_file   : 1
    <355>   DW_AT_decl_line   : 58
    <356>   DW_AT_decl_column : 9
    <357>   DW_AT_type        : <0x8e>
    <35b>   DW_AT_external    : 1
    <35b>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><361>: Abbrev Number: 18 (DW_TAG_variable)
    <362>   DW_AT_name        : (indirect string, offset: 0x15a9): consumerTaskHandle
    <366>   DW_AT_decl_file   : 1
    <367>   DW_AT_decl_line   : 61
    <368>   DW_AT_decl_column : 14
    <369>   DW_AT_type        : <0x281>
    <36d>   DW_AT_external    : 1
    <36d>   DW_AT_location    : 5 byte block: 3 c0 0 0 20 	(DW_OP_addr: 200000c0)
 <1><373>: Abbrev Number: 18 (DW_TAG_variable)
    <374>   DW_AT_name        : (indirect string, offset: 0x6a126): consumerTask_attributes
    <378>   DW_AT_decl_file   : 1
    <379>   DW_AT_decl_line   : 62
    <37a>   DW_AT_decl_column : 22
    <37b>   DW_AT_type        : <0x330>
    <37f>   DW_AT_external    : 1
    <37f>   DW_AT_location    : 5 byte block: 3 94 8f 0 8 	(DW_OP_addr: 8008f94)
 <1><385>: Abbrev Number: 18 (DW_TAG_variable)
    <386>   DW_AT_name        : (indirect string, offset: 0xa3e38): InitTaskHandle
    <38a>   DW_AT_decl_file   : 1
    <38b>   DW_AT_decl_line   : 68
    <38c>   DW_AT_decl_column : 14
    <38d>   DW_AT_type        : <0x281>
    <391>   DW_AT_external    : 1
    <391>   DW_AT_location    : 5 byte block: 3 c4 0 0 20 	(DW_OP_addr: 200000c4)
 <1><397>: Abbrev Number: 18 (DW_TAG_variable)
    <398>   DW_AT_name        : (indirect string, offset: 0x99989): InitTask_attributes
    <39c>   DW_AT_decl_file   : 1
    <39d>   DW_AT_decl_line   : 69
    <39e>   DW_AT_decl_column : 22
    <39f>   DW_AT_type        : <0x330>
    <3a3>   DW_AT_external    : 1
    <3a3>   DW_AT_location    : 5 byte block: 3 b8 8f 0 8 	(DW_OP_addr: 8008fb8)
 <1><3a9>: Abbrev Number: 19 (DW_TAG_subprogram)
    <3aa>   DW_AT_external    : 1
    <3aa>   DW_AT_name        : (indirect string, offset: 0xc8ed8): osDelay
    <3ae>   DW_AT_decl_file   : 4
    <3af>   DW_AT_decl_line   : 459
    <3b1>   DW_AT_decl_column : 12
    <3b2>   DW_AT_prototyped  : 1
    <3b2>   DW_AT_type        : <0x275>
    <3b6>   DW_AT_declaration : 1
    <3b6>   DW_AT_sibling     : <0x3c0>
 <2><3ba>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <3bb>   DW_AT_type        : <0x9a>
 <2><3bf>: Abbrev Number: 0
 <1><3c0>: Abbrev Number: 19 (DW_TAG_subprogram)
    <3c1>   DW_AT_external    : 1
    <3c1>   DW_AT_name        : (indirect string, offset: 0x71621): osThreadNew
    <3c5>   DW_AT_decl_file   : 4
    <3c6>   DW_AT_decl_line   : 349
    <3c8>   DW_AT_decl_column : 14
    <3c9>   DW_AT_prototyped  : 1
    <3c9>   DW_AT_type        : <0x281>
    <3cd>   DW_AT_declaration : 1
    <3cd>   DW_AT_sibling     : <0x3e1>
 <2><3d1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <3d2>   DW_AT_type        : <0x227>
 <2><3d6>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <3d7>   DW_AT_type        : <0xb7>
 <2><3db>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <3dc>   DW_AT_type        : <0x3e1>
 <2><3e0>: Abbrev Number: 0
 <1><3e1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <3e2>   DW_AT_byte_size   : 4
    <3e3>   DW_AT_type        : <0x330>
 <1><3e7>: Abbrev Number: 20 (DW_TAG_subprogram)
    <3e8>   DW_AT_external    : 1
    <3e8>   DW_AT_name        : (indirect string, offset: 0xf85b): Ringbuffer_Init
    <3ec>   DW_AT_decl_file   : 6
    <3ed>   DW_AT_decl_line   : 61
    <3ee>   DW_AT_decl_column : 18
    <3ef>   DW_AT_prototyped  : 1
    <3ef>   DW_AT_type        : <0x28d>
    <3f3>   DW_AT_declaration : 1
    <3f3>   DW_AT_sibling     : <0x3fd>
 <2><3f7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <3f8>   DW_AT_type        : <0x8e>
 <2><3fc>: Abbrev Number: 0
 <1><3fd>: Abbrev Number: 21 (DW_TAG_subprogram)
    <3fe>   DW_AT_external    : 1
    <3fe>   DW_AT_name        : (indirect string, offset: 0x1656d): StartTasks
    <402>   DW_AT_decl_file   : 1
    <403>   DW_AT_decl_line   : 180
    <404>   DW_AT_decl_column : 13
    <405>   DW_AT_prototyped  : 1
    <405>   DW_AT_low_pc      : 0x0
    <409>   DW_AT_high_pc     : 0x10
    <40d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <40f>   DW_AT_GNU_all_tail_call_sites: 1
    <40f>   DW_AT_sibling     : <0x423>
 <2><413>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <414>   DW_AT_name        : (indirect string, offset: 0x2b594): argument
    <418>   DW_AT_decl_file   : 1
    <419>   DW_AT_decl_line   : 180
    <41a>   DW_AT_decl_column : 30
    <41b>   DW_AT_type        : <0xb7>
    <41f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><422>: Abbrev Number: 0
 <1><423>: Abbrev Number: 21 (DW_TAG_subprogram)
    <424>   DW_AT_external    : 1
    <424>   DW_AT_name        : (indirect string, offset: 0xa8e0): ConsumerTask
    <428>   DW_AT_decl_file   : 1
    <429>   DW_AT_decl_line   : 162
    <42a>   DW_AT_decl_column : 13
    <42b>   DW_AT_prototyped  : 1
    <42b>   DW_AT_low_pc      : 0x0
    <42f>   DW_AT_high_pc     : 0x10
    <433>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <435>   DW_AT_GNU_all_tail_call_sites: 1
    <435>   DW_AT_sibling     : <0x449>
 <2><439>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <43a>   DW_AT_name        : (indirect string, offset: 0x2b594): argument
    <43e>   DW_AT_decl_file   : 1
    <43f>   DW_AT_decl_line   : 162
    <440>   DW_AT_decl_column : 32
    <441>   DW_AT_type        : <0xb7>
    <445>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><448>: Abbrev Number: 0
 <1><449>: Abbrev Number: 23 (DW_TAG_subprogram)
    <44a>   DW_AT_external    : 1
    <44a>   DW_AT_name        : (indirect string, offset: 0xa34e9): MX_FREERTOS_Init
    <44e>   DW_AT_decl_file   : 1
    <44f>   DW_AT_decl_line   : 90
    <450>   DW_AT_decl_column : 6
    <451>   DW_AT_prototyped  : 1
    <451>   DW_AT_low_pc      : 0x8000574
    <455>   DW_AT_high_pc     : 0x54
    <459>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <45b>   DW_AT_GNU_all_tail_call_sites: 1
 <1><45b>: Abbrev Number: 0
  Compilation Unit @ offset 0x45c:
   Length:        0x4ce (32-bit)
   Version:       4
   Abbrev Offset: 0x15b
   Pointer Size:  4
 <0><467>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <468>   DW_AT_producer    : (indirect string, offset: 0xc532f): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <46c>   DW_AT_language    : 12	(ANSI C99)
    <46d>   DW_AT_name        : (indirect string, offset: 0xcbbb4): ../Core/Src/gpio.c
    <471>   DW_AT_comp_dir    : (indirect string, offset: 0xca836): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/Assign2_Rieder_Nikolaus/Debug
    <475>   DW_AT_ranges      : 0x20
    <479>   DW_AT_low_pc      : 0x0
    <47d>   DW_AT_stmt_list   : 0xb3f
    <481>   DW_AT_GNU_macros  : 0x20297
 <1><485>: Abbrev Number: 2 (DW_TAG_base_type)
    <486>   DW_AT_byte_size   : 1
    <487>   DW_AT_encoding    : 6	(signed char)
    <488>   DW_AT_name        : (indirect string, offset: 0x663d0): signed char
 <1><48c>: Abbrev Number: 2 (DW_TAG_base_type)
    <48d>   DW_AT_byte_size   : 1
    <48e>   DW_AT_encoding    : 8	(unsigned char)
    <48f>   DW_AT_name        : (indirect string, offset: 0xc3f44): unsigned char
 <1><493>: Abbrev Number: 2 (DW_TAG_base_type)
    <494>   DW_AT_byte_size   : 2
    <495>   DW_AT_encoding    : 5	(signed)
    <496>   DW_AT_name        : (indirect string, offset: 0x971b1): short int
 <1><49a>: Abbrev Number: 3 (DW_TAG_typedef)
    <49b>   DW_AT_name        : (indirect string, offset: 0xcbce9): __uint16_t
    <49f>   DW_AT_decl_file   : 2
    <4a0>   DW_AT_decl_line   : 57
    <4a1>   DW_AT_decl_column : 25
    <4a2>   DW_AT_type        : <0x4a6>
 <1><4a6>: Abbrev Number: 2 (DW_TAG_base_type)
    <4a7>   DW_AT_byte_size   : 2
    <4a8>   DW_AT_encoding    : 7	(unsigned)
    <4a9>   DW_AT_name        : (indirect string, offset: 0xc2689): short unsigned int
 <1><4ad>: Abbrev Number: 2 (DW_TAG_base_type)
    <4ae>   DW_AT_byte_size   : 4
    <4af>   DW_AT_encoding    : 5	(signed)
    <4b0>   DW_AT_name        : (indirect string, offset: 0x1165e): long int
 <1><4b4>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x81eea): __uint32_t
    <4b9>   DW_AT_decl_file   : 2
    <4ba>   DW_AT_decl_line   : 79
    <4bb>   DW_AT_decl_column : 25
    <4bc>   DW_AT_type        : <0x4c0>
 <1><4c0>: Abbrev Number: 2 (DW_TAG_base_type)
    <4c1>   DW_AT_byte_size   : 4
    <4c2>   DW_AT_encoding    : 7	(unsigned)
    <4c3>   DW_AT_name        : (indirect string, offset: 0x4dd76): long unsigned int
 <1><4c7>: Abbrev Number: 2 (DW_TAG_base_type)
    <4c8>   DW_AT_byte_size   : 8
    <4c9>   DW_AT_encoding    : 5	(signed)
    <4ca>   DW_AT_name        : (indirect string, offset: 0x5cfba): long long int
 <1><4ce>: Abbrev Number: 2 (DW_TAG_base_type)
    <4cf>   DW_AT_byte_size   : 8
    <4d0>   DW_AT_encoding    : 7	(unsigned)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x2a31b): long long unsigned int
 <1><4d5>: Abbrev Number: 4 (DW_TAG_base_type)
    <4d6>   DW_AT_byte_size   : 4
    <4d7>   DW_AT_encoding    : 5	(signed)
    <4d8>   DW_AT_name        : int
 <1><4dc>: Abbrev Number: 2 (DW_TAG_base_type)
    <4dd>   DW_AT_byte_size   : 4
    <4de>   DW_AT_encoding    : 7	(unsigned)
    <4df>   DW_AT_name        : (indirect string, offset: 0x10c21): unsigned int
 <1><4e3>: Abbrev Number: 3 (DW_TAG_typedef)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x942c9): uint16_t
    <4e8>   DW_AT_decl_file   : 3
    <4e9>   DW_AT_decl_line   : 36
    <4ea>   DW_AT_decl_column : 20
    <4eb>   DW_AT_type        : <0x49a>
 <1><4ef>: Abbrev Number: 3 (DW_TAG_typedef)
    <4f0>   DW_AT_name        : (indirect string, offset: 0x9386d): uint32_t
    <4f4>   DW_AT_decl_file   : 3
    <4f5>   DW_AT_decl_line   : 48
    <4f6>   DW_AT_decl_column : 20
    <4f7>   DW_AT_type        : <0x4b4>
 <1><4fb>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <4fc>   DW_AT_type        : <0x4ef>
 <1><500>: Abbrev Number: 6 (DW_TAG_structure_type)
    <501>   DW_AT_byte_size   : 44
    <502>   DW_AT_decl_file   : 4
    <503>   DW_AT_decl_line   : 451
    <505>   DW_AT_decl_column : 9
    <506>   DW_AT_sibling     : <0x597>
 <2><50a>: Abbrev Number: 7 (DW_TAG_member)
    <50b>   DW_AT_name        : (indirect string, offset: 0xcbb40): MODER
    <50f>   DW_AT_decl_file   : 4
    <510>   DW_AT_decl_line   : 453
    <512>   DW_AT_decl_column : 17
    <513>   DW_AT_type        : <0x4fb>
    <517>   DW_AT_data_member_location: 0
 <2><518>: Abbrev Number: 7 (DW_TAG_member)
    <519>   DW_AT_name        : (indirect string, offset: 0xcbcae): OTYPER
    <51d>   DW_AT_decl_file   : 4
    <51e>   DW_AT_decl_line   : 454
    <520>   DW_AT_decl_column : 17
    <521>   DW_AT_type        : <0x4fb>
    <525>   DW_AT_data_member_location: 4
 <2><526>: Abbrev Number: 7 (DW_TAG_member)
    <527>   DW_AT_name        : (indirect string, offset: 0xcbcf9): OSPEEDR
    <52b>   DW_AT_decl_file   : 4
    <52c>   DW_AT_decl_line   : 455
    <52e>   DW_AT_decl_column : 17
    <52f>   DW_AT_type        : <0x4fb>
    <533>   DW_AT_data_member_location: 8
 <2><534>: Abbrev Number: 7 (DW_TAG_member)
    <535>   DW_AT_name        : (indirect string, offset: 0xcbc8d): PUPDR
    <539>   DW_AT_decl_file   : 4
    <53a>   DW_AT_decl_line   : 456
    <53c>   DW_AT_decl_column : 17
    <53d>   DW_AT_type        : <0x4fb>
    <541>   DW_AT_data_member_location: 12
 <2><542>: Abbrev Number: 8 (DW_TAG_member)
    <543>   DW_AT_name        : IDR
    <547>   DW_AT_decl_file   : 4
    <548>   DW_AT_decl_line   : 457
    <54a>   DW_AT_decl_column : 17
    <54b>   DW_AT_type        : <0x4fb>
    <54f>   DW_AT_data_member_location: 16
 <2><550>: Abbrev Number: 8 (DW_TAG_member)
    <551>   DW_AT_name        : ODR
    <555>   DW_AT_decl_file   : 4
    <556>   DW_AT_decl_line   : 458
    <558>   DW_AT_decl_column : 17
    <559>   DW_AT_type        : <0x4fb>
    <55d>   DW_AT_data_member_location: 20
 <2><55e>: Abbrev Number: 7 (DW_TAG_member)
    <55f>   DW_AT_name        : (indirect string, offset: 0xcbbea): BSRR
    <563>   DW_AT_decl_file   : 4
    <564>   DW_AT_decl_line   : 459
    <566>   DW_AT_decl_column : 17
    <567>   DW_AT_type        : <0x4fb>
    <56b>   DW_AT_data_member_location: 24
 <2><56c>: Abbrev Number: 7 (DW_TAG_member)
    <56d>   DW_AT_name        : (indirect string, offset: 0xcbcf4): LCKR
    <571>   DW_AT_decl_file   : 4
    <572>   DW_AT_decl_line   : 460
    <574>   DW_AT_decl_column : 17
    <575>   DW_AT_type        : <0x4fb>
    <579>   DW_AT_data_member_location: 28
 <2><57a>: Abbrev Number: 8 (DW_TAG_member)
    <57b>   DW_AT_name        : AFR
    <57f>   DW_AT_decl_file   : 4
    <580>   DW_AT_decl_line   : 461
    <582>   DW_AT_decl_column : 17
    <583>   DW_AT_type        : <0x5a7>
    <587>   DW_AT_data_member_location: 32
 <2><588>: Abbrev Number: 8 (DW_TAG_member)
    <589>   DW_AT_name        : BRR
    <58d>   DW_AT_decl_file   : 4
    <58e>   DW_AT_decl_line   : 462
    <590>   DW_AT_decl_column : 17
    <591>   DW_AT_type        : <0x4fb>
    <595>   DW_AT_data_member_location: 40
 <2><596>: Abbrev Number: 0
 <1><597>: Abbrev Number: 9 (DW_TAG_array_type)
    <598>   DW_AT_type        : <0x4fb>
    <59c>   DW_AT_sibling     : <0x5a7>
 <2><5a0>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <5a1>   DW_AT_type        : <0x4dc>
    <5a5>   DW_AT_upper_bound : 1
 <2><5a6>: Abbrev Number: 0
 <1><5a7>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <5a8>   DW_AT_type        : <0x597>
 <1><5ac>: Abbrev Number: 11 (DW_TAG_typedef)
    <5ad>   DW_AT_name        : (indirect string, offset: 0xcbd53): GPIO_TypeDef
    <5b1>   DW_AT_decl_file   : 4
    <5b2>   DW_AT_decl_line   : 464
    <5b4>   DW_AT_decl_column : 3
    <5b5>   DW_AT_type        : <0x500>
 <1><5b9>: Abbrev Number: 6 (DW_TAG_structure_type)
    <5ba>   DW_AT_byte_size   : 156
    <5bb>   DW_AT_decl_file   : 4
    <5bc>   DW_AT_decl_line   : 590
    <5be>   DW_AT_decl_column : 9
    <5bf>   DW_AT_sibling     : <0x7e5>
 <2><5c3>: Abbrev Number: 8 (DW_TAG_member)
    <5c4>   DW_AT_name        : CR
    <5c7>   DW_AT_decl_file   : 4
    <5c8>   DW_AT_decl_line   : 592
    <5ca>   DW_AT_decl_column : 17
    <5cb>   DW_AT_type        : <0x4fb>
    <5cf>   DW_AT_data_member_location: 0
 <2><5d0>: Abbrev Number: 7 (DW_TAG_member)
    <5d1>   DW_AT_name        : (indirect string, offset: 0xcbca0): ICSCR
    <5d5>   DW_AT_decl_file   : 4
    <5d6>   DW_AT_decl_line   : 593
    <5d8>   DW_AT_decl_column : 17
    <5d9>   DW_AT_type        : <0x4fb>
    <5dd>   DW_AT_data_member_location: 4
 <2><5de>: Abbrev Number: 7 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0xcbc0f): CFGR
    <5e3>   DW_AT_decl_file   : 4
    <5e4>   DW_AT_decl_line   : 594
    <5e6>   DW_AT_decl_column : 17
    <5e7>   DW_AT_type        : <0x4fb>
    <5eb>   DW_AT_data_member_location: 8
 <2><5ec>: Abbrev Number: 7 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xcbca6): PLLCFGR
    <5f1>   DW_AT_decl_file   : 4
    <5f2>   DW_AT_decl_line   : 595
    <5f4>   DW_AT_decl_column : 17
    <5f5>   DW_AT_type        : <0x4fb>
    <5f9>   DW_AT_data_member_location: 12
 <2><5fa>: Abbrev Number: 7 (DW_TAG_member)
    <5fb>   DW_AT_name        : (indirect string, offset: 0xcbc08): PLLSAI1CFGR
    <5ff>   DW_AT_decl_file   : 4
    <600>   DW_AT_decl_line   : 596
    <602>   DW_AT_decl_column : 17
    <603>   DW_AT_type        : <0x4fb>
    <607>   DW_AT_data_member_location: 16
 <2><608>: Abbrev Number: 7 (DW_TAG_member)
    <609>   DW_AT_name        : (indirect string, offset: 0x7af7d): RESERVED
    <60d>   DW_AT_decl_file   : 4
    <60e>   DW_AT_decl_line   : 597
    <610>   DW_AT_decl_column : 17
    <611>   DW_AT_type        : <0x4ef>
    <615>   DW_AT_data_member_location: 20
 <2><616>: Abbrev Number: 7 (DW_TAG_member)
    <617>   DW_AT_name        : (indirect string, offset: 0xcbb52): CIER
    <61b>   DW_AT_decl_file   : 4
    <61c>   DW_AT_decl_line   : 598
    <61e>   DW_AT_decl_column : 17
    <61f>   DW_AT_type        : <0x4fb>
    <623>   DW_AT_data_member_location: 24
 <2><624>: Abbrev Number: 7 (DW_TAG_member)
    <625>   DW_AT_name        : (indirect string, offset: 0xcbb57): CIFR
    <629>   DW_AT_decl_file   : 4
    <62a>   DW_AT_decl_line   : 599
    <62c>   DW_AT_decl_column : 17
    <62d>   DW_AT_type        : <0x4fb>
    <631>   DW_AT_data_member_location: 28
 <2><632>: Abbrev Number: 7 (DW_TAG_member)
    <633>   DW_AT_name        : (indirect string, offset: 0xcbb4d): CICR
    <637>   DW_AT_decl_file   : 4
    <638>   DW_AT_decl_line   : 600
    <63a>   DW_AT_decl_column : 17
    <63b>   DW_AT_type        : <0x4fb>
    <63f>   DW_AT_data_member_location: 32
 <2><640>: Abbrev Number: 7 (DW_TAG_member)
    <641>   DW_AT_name        : (indirect string, offset: 0xcbd17): RESERVED0
    <645>   DW_AT_decl_file   : 4
    <646>   DW_AT_decl_line   : 601
    <648>   DW_AT_decl_column : 17
    <649>   DW_AT_type        : <0x4ef>
    <64d>   DW_AT_data_member_location: 36
 <2><64e>: Abbrev Number: 7 (DW_TAG_member)
    <64f>   DW_AT_name        : (indirect string, offset: 0xcbcc6): AHB1RSTR
    <653>   DW_AT_decl_file   : 4
    <654>   DW_AT_decl_line   : 602
    <656>   DW_AT_decl_column : 17
    <657>   DW_AT_type        : <0x4fb>
    <65b>   DW_AT_data_member_location: 40
 <2><65c>: Abbrev Number: 7 (DW_TAG_member)
    <65d>   DW_AT_name        : (indirect string, offset: 0xcbbab): AHB2RSTR
    <661>   DW_AT_decl_file   : 4
    <662>   DW_AT_decl_line   : 603
    <664>   DW_AT_decl_column : 17
    <665>   DW_AT_type        : <0x4fb>
    <669>   DW_AT_data_member_location: 44
 <2><66a>: Abbrev Number: 7 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0xcbc27): AHB3RSTR
    <66f>   DW_AT_decl_file   : 4
    <670>   DW_AT_decl_line   : 604
    <672>   DW_AT_decl_column : 17
    <673>   DW_AT_type        : <0x4fb>
    <677>   DW_AT_data_member_location: 48
 <2><678>: Abbrev Number: 7 (DW_TAG_member)
    <679>   DW_AT_name        : (indirect string, offset: 0xcbd21): RESERVED1
    <67d>   DW_AT_decl_file   : 4
    <67e>   DW_AT_decl_line   : 605
    <680>   DW_AT_decl_column : 17
    <681>   DW_AT_type        : <0x4ef>
    <685>   DW_AT_data_member_location: 52
 <2><686>: Abbrev Number: 7 (DW_TAG_member)
    <687>   DW_AT_name        : (indirect string, offset: 0xcbbc7): APB1RSTR1
    <68b>   DW_AT_decl_file   : 4
    <68c>   DW_AT_decl_line   : 606
    <68e>   DW_AT_decl_column : 17
    <68f>   DW_AT_type        : <0x4fb>
    <693>   DW_AT_data_member_location: 56
 <2><694>: Abbrev Number: 7 (DW_TAG_member)
    <695>   DW_AT_name        : (indirect string, offset: 0xcbbd1): APB1RSTR2
    <699>   DW_AT_decl_file   : 4
    <69a>   DW_AT_decl_line   : 607
    <69c>   DW_AT_decl_column : 17
    <69d>   DW_AT_type        : <0x4fb>
    <6a1>   DW_AT_data_member_location: 60
 <2><6a2>: Abbrev Number: 7 (DW_TAG_member)
    <6a3>   DW_AT_name        : (indirect string, offset: 0xcbc1e): APB2RSTR
    <6a7>   DW_AT_decl_file   : 4
    <6a8>   DW_AT_decl_line   : 608
    <6aa>   DW_AT_decl_column : 17
    <6ab>   DW_AT_type        : <0x4fb>
    <6af>   DW_AT_data_member_location: 64
 <2><6b0>: Abbrev Number: 7 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0xcbd2b): RESERVED2
    <6b5>   DW_AT_decl_file   : 4
    <6b6>   DW_AT_decl_line   : 609
    <6b8>   DW_AT_decl_column : 17
    <6b9>   DW_AT_type        : <0x4ef>
    <6bd>   DW_AT_data_member_location: 68
 <2><6be>: Abbrev Number: 7 (DW_TAG_member)
    <6bf>   DW_AT_name        : (indirect string, offset: 0xcbb84): AHB1ENR
    <6c3>   DW_AT_decl_file   : 4
    <6c4>   DW_AT_decl_line   : 610
    <6c6>   DW_AT_decl_column : 17
    <6c7>   DW_AT_type        : <0x4fb>
    <6cb>   DW_AT_data_member_location: 72
 <2><6cc>: Abbrev Number: 7 (DW_TAG_member)
    <6cd>   DW_AT_name        : (indirect string, offset: 0xcbbf4): AHB2ENR
    <6d1>   DW_AT_decl_file   : 4
    <6d2>   DW_AT_decl_line   : 611
    <6d4>   DW_AT_decl_column : 17
    <6d5>   DW_AT_type        : <0x4fb>
    <6d9>   DW_AT_data_member_location: 76
 <2><6da>: Abbrev Number: 7 (DW_TAG_member)
    <6db>   DW_AT_name        : (indirect string, offset: 0xcbc30): AHB3ENR
    <6df>   DW_AT_decl_file   : 4
    <6e0>   DW_AT_decl_line   : 612
    <6e2>   DW_AT_decl_column : 17
    <6e3>   DW_AT_type        : <0x4fb>
    <6e7>   DW_AT_data_member_location: 80
 <2><6e8>: Abbrev Number: 7 (DW_TAG_member)
    <6e9>   DW_AT_name        : (indirect string, offset: 0xcbd35): RESERVED3
    <6ed>   DW_AT_decl_file   : 4
    <6ee>   DW_AT_decl_line   : 613
    <6f0>   DW_AT_decl_column : 17
    <6f1>   DW_AT_type        : <0x4ef>
    <6f5>   DW_AT_data_member_location: 84
 <2><6f6>: Abbrev Number: 7 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0xcbb5c): APB1ENR1
    <6fb>   DW_AT_decl_file   : 4
    <6fc>   DW_AT_decl_line   : 614
    <6fe>   DW_AT_decl_column : 17
    <6ff>   DW_AT_type        : <0x4fb>
    <703>   DW_AT_data_member_location: 88
 <2><704>: Abbrev Number: 7 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0xcbb65): APB1ENR2
    <709>   DW_AT_decl_file   : 4
    <70a>   DW_AT_decl_line   : 615
    <70c>   DW_AT_decl_column : 17
    <70d>   DW_AT_type        : <0x4fb>
    <711>   DW_AT_data_member_location: 92
 <2><712>: Abbrev Number: 7 (DW_TAG_member)
    <713>   DW_AT_name        : (indirect string, offset: 0xcbc58): APB2ENR
    <717>   DW_AT_decl_file   : 4
    <718>   DW_AT_decl_line   : 616
    <71a>   DW_AT_decl_column : 17
    <71b>   DW_AT_type        : <0x4fb>
    <71f>   DW_AT_data_member_location: 96
 <2><720>: Abbrev Number: 7 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0xcbc6b): RESERVED4
    <725>   DW_AT_decl_file   : 4
    <726>   DW_AT_decl_line   : 617
    <728>   DW_AT_decl_column : 17
    <729>   DW_AT_type        : <0x4ef>
    <72d>   DW_AT_data_member_location: 100
 <2><72e>: Abbrev Number: 7 (DW_TAG_member)
    <72f>   DW_AT_name        : (indirect string, offset: 0xcbc42): AHB1SMENR
    <733>   DW_AT_decl_file   : 4
    <734>   DW_AT_decl_line   : 618
    <736>   DW_AT_decl_column : 17
    <737>   DW_AT_type        : <0x4fb>
    <73b>   DW_AT_data_member_location: 104
 <2><73c>: Abbrev Number: 7 (DW_TAG_member)
    <73d>   DW_AT_name        : (indirect string, offset: 0xcbd01): AHB2SMENR
    <741>   DW_AT_decl_file   : 4
    <742>   DW_AT_decl_line   : 619
    <744>   DW_AT_decl_column : 17
    <745>   DW_AT_type        : <0x4fb>
    <749>   DW_AT_data_member_location: 108
 <2><74a>: Abbrev Number: 7 (DW_TAG_member)
    <74b>   DW_AT_name        : (indirect string, offset: 0xcbc14): AHB3SMENR
    <74f>   DW_AT_decl_file   : 4
    <750>   DW_AT_decl_line   : 620
    <752>   DW_AT_decl_column : 17
    <753>   DW_AT_type        : <0x4fb>
    <757>   DW_AT_data_member_location: 112
 <2><758>: Abbrev Number: 7 (DW_TAG_member)
    <759>   DW_AT_name        : (indirect string, offset: 0xcbd3f): RESERVED5
    <75d>   DW_AT_decl_file   : 4
    <75e>   DW_AT_decl_line   : 621
    <760>   DW_AT_decl_column : 17
    <761>   DW_AT_type        : <0x4ef>
    <765>   DW_AT_data_member_location: 116
 <2><766>: Abbrev Number: 7 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0xcbb6e): APB1SMENR1
    <76b>   DW_AT_decl_file   : 4
    <76c>   DW_AT_decl_line   : 622
    <76e>   DW_AT_decl_column : 17
    <76f>   DW_AT_type        : <0x4fb>
    <773>   DW_AT_data_member_location: 120
 <2><774>: Abbrev Number: 7 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0xcbb79): APB1SMENR2
    <779>   DW_AT_decl_file   : 4
    <77a>   DW_AT_decl_line   : 623
    <77c>   DW_AT_decl_column : 17
    <77d>   DW_AT_type        : <0x4fb>
    <781>   DW_AT_data_member_location: 124
 <2><782>: Abbrev Number: 7 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0xcbcdf): APB2SMENR
    <787>   DW_AT_decl_file   : 4
    <788>   DW_AT_decl_line   : 624
    <78a>   DW_AT_decl_column : 17
    <78b>   DW_AT_type        : <0x4fb>
    <78f>   DW_AT_data_member_location: 128
 <2><790>: Abbrev Number: 7 (DW_TAG_member)
    <791>   DW_AT_name        : (indirect string, offset: 0xcbc75): RESERVED6
    <795>   DW_AT_decl_file   : 4
    <796>   DW_AT_decl_line   : 625
    <798>   DW_AT_decl_column : 17
    <799>   DW_AT_type        : <0x4ef>
    <79d>   DW_AT_data_member_location: 132
 <2><79e>: Abbrev Number: 7 (DW_TAG_member)
    <79f>   DW_AT_name        : (indirect string, offset: 0xcbc02): CCIPR
    <7a3>   DW_AT_decl_file   : 4
    <7a4>   DW_AT_decl_line   : 626
    <7a6>   DW_AT_decl_column : 17
    <7a7>   DW_AT_type        : <0x4fb>
    <7ab>   DW_AT_data_member_location: 136
 <2><7ac>: Abbrev Number: 7 (DW_TAG_member)
    <7ad>   DW_AT_name        : (indirect string, offset: 0xcbd49): RESERVED7
    <7b1>   DW_AT_decl_file   : 4
    <7b2>   DW_AT_decl_line   : 627
    <7b4>   DW_AT_decl_column : 17
    <7b5>   DW_AT_type        : <0x4ef>
    <7b9>   DW_AT_data_member_location: 140
 <2><7ba>: Abbrev Number: 7 (DW_TAG_member)
    <7bb>   DW_AT_name        : (indirect string, offset: 0xcbbef): BDCR
    <7bf>   DW_AT_decl_file   : 4
    <7c0>   DW_AT_decl_line   : 628
    <7c2>   DW_AT_decl_column : 17
    <7c3>   DW_AT_type        : <0x4fb>
    <7c7>   DW_AT_data_member_location: 144
 <2><7c8>: Abbrev Number: 8 (DW_TAG_member)
    <7c9>   DW_AT_name        : CSR
    <7cd>   DW_AT_decl_file   : 4
    <7ce>   DW_AT_decl_line   : 629
    <7d0>   DW_AT_decl_column : 17
    <7d1>   DW_AT_type        : <0x4fb>
    <7d5>   DW_AT_data_member_location: 148
 <2><7d6>: Abbrev Number: 7 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xcbbfc): CRRCR
    <7db>   DW_AT_decl_file   : 4
    <7dc>   DW_AT_decl_line   : 630
    <7de>   DW_AT_decl_column : 17
    <7df>   DW_AT_type        : <0x4fb>
    <7e3>   DW_AT_data_member_location: 152
 <2><7e4>: Abbrev Number: 0
 <1><7e5>: Abbrev Number: 11 (DW_TAG_typedef)
    <7e6>   DW_AT_name        : (indirect string, offset: 0xcbc4c): RCC_TypeDef
    <7ea>   DW_AT_decl_file   : 4
    <7eb>   DW_AT_decl_line   : 631
    <7ed>   DW_AT_decl_column : 3
    <7ee>   DW_AT_type        : <0x5b9>
 <1><7f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f3>   DW_AT_byte_size   : 8
    <7f4>   DW_AT_encoding    : 4	(float)
    <7f5>   DW_AT_name        : (indirect string, offset: 0x12e03): long double
 <1><7f9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <7fa>   DW_AT_byte_size   : 20
    <7fb>   DW_AT_decl_file   : 5
    <7fc>   DW_AT_decl_line   : 46
    <7fd>   DW_AT_decl_column : 9
    <7fe>   DW_AT_sibling     : <0x844>
 <2><802>: Abbrev Number: 13 (DW_TAG_member)
    <803>   DW_AT_name        : Pin
    <807>   DW_AT_decl_file   : 5
    <808>   DW_AT_decl_line   : 48
    <809>   DW_AT_decl_column : 12
    <80a>   DW_AT_type        : <0x4ef>
    <80e>   DW_AT_data_member_location: 0
 <2><80f>: Abbrev Number: 14 (DW_TAG_member)
    <810>   DW_AT_name        : (indirect string, offset: 0xcf6ad): Mode
    <814>   DW_AT_decl_file   : 5
    <815>   DW_AT_decl_line   : 51
    <816>   DW_AT_decl_column : 12
    <817>   DW_AT_type        : <0x4ef>
    <81b>   DW_AT_data_member_location: 4
 <2><81c>: Abbrev Number: 14 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0xcbc60): Pull
    <821>   DW_AT_decl_file   : 5
    <822>   DW_AT_decl_line   : 54
    <823>   DW_AT_decl_column : 12
    <824>   DW_AT_type        : <0x4ef>
    <828>   DW_AT_data_member_location: 8
 <2><829>: Abbrev Number: 14 (DW_TAG_member)
    <82a>   DW_AT_name        : (indirect string, offset: 0xcbc65): Speed
    <82e>   DW_AT_decl_file   : 5
    <82f>   DW_AT_decl_line   : 57
    <830>   DW_AT_decl_column : 12
    <831>   DW_AT_type        : <0x4ef>
    <835>   DW_AT_data_member_location: 12
 <2><836>: Abbrev Number: 14 (DW_TAG_member)
    <837>   DW_AT_name        : (indirect string, offset: 0xcbc38): Alternate
    <83b>   DW_AT_decl_file   : 5
    <83c>   DW_AT_decl_line   : 60
    <83d>   DW_AT_decl_column : 12
    <83e>   DW_AT_type        : <0x4ef>
    <842>   DW_AT_data_member_location: 16
 <2><843>: Abbrev Number: 0
 <1><844>: Abbrev Number: 3 (DW_TAG_typedef)
    <845>   DW_AT_name        : (indirect string, offset: 0xcbcb5): GPIO_InitTypeDef
    <849>   DW_AT_decl_file   : 5
    <84a>   DW_AT_decl_line   : 62
    <84b>   DW_AT_decl_column : 3
    <84c>   DW_AT_type        : <0x7f9>
 <1><850>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <851>   DW_AT_encoding    : 7	(unsigned)
    <852>   DW_AT_byte_size   : 1
    <853>   DW_AT_type        : <0x48c>
    <857>   DW_AT_decl_file   : 5
    <858>   DW_AT_decl_line   : 68
    <859>   DW_AT_decl_column : 1
    <85a>   DW_AT_sibling     : <0x86b>
 <2><85e>: Abbrev Number: 16 (DW_TAG_enumerator)
    <85f>   DW_AT_name        : (indirect string, offset: 0xcbbdb): GPIO_PIN_RESET
    <863>   DW_AT_const_value : 0
 <2><864>: Abbrev Number: 16 (DW_TAG_enumerator)
    <865>   DW_AT_name        : (indirect string, offset: 0xcbb8c): GPIO_PIN_SET
    <869>   DW_AT_const_value : 1
 <2><86a>: Abbrev Number: 0
 <1><86b>: Abbrev Number: 3 (DW_TAG_typedef)
    <86c>   DW_AT_name        : (indirect string, offset: 0xcbd60): GPIO_PinState
    <870>   DW_AT_decl_file   : 5
    <871>   DW_AT_decl_line   : 71
    <872>   DW_AT_decl_column : 3
    <873>   DW_AT_type        : <0x850>
 <1><877>: Abbrev Number: 17 (DW_TAG_subprogram)
    <878>   DW_AT_external    : 1
    <878>   DW_AT_name        : (indirect string, offset: 0xcbc7f): HAL_GPIO_Init
    <87c>   DW_AT_decl_file   : 5
    <87d>   DW_AT_decl_line   : 283
    <87f>   DW_AT_decl_column : 19
    <880>   DW_AT_prototyped  : 1
    <880>   DW_AT_declaration : 1
    <880>   DW_AT_sibling     : <0x88f>
 <2><884>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <885>   DW_AT_type        : <0x88f>
 <2><889>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <88a>   DW_AT_type        : <0x895>
 <2><88e>: Abbrev Number: 0
 <1><88f>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <890>   DW_AT_byte_size   : 4
    <891>   DW_AT_type        : <0x5ac>
 <1><895>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <896>   DW_AT_byte_size   : 4
    <897>   DW_AT_type        : <0x844>
 <1><89b>: Abbrev Number: 17 (DW_TAG_subprogram)
    <89c>   DW_AT_external    : 1
    <89c>   DW_AT_name        : (indirect string, offset: 0xcbb99): HAL_GPIO_WritePin
    <8a0>   DW_AT_decl_file   : 5
    <8a1>   DW_AT_decl_line   : 296
    <8a3>   DW_AT_decl_column : 19
    <8a4>   DW_AT_prototyped  : 1
    <8a4>   DW_AT_declaration : 1
    <8a4>   DW_AT_sibling     : <0x8b8>
 <2><8a8>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <8a9>   DW_AT_type        : <0x88f>
 <2><8ad>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <8ae>   DW_AT_type        : <0x4e3>
 <2><8b2>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <8b3>   DW_AT_type        : <0x86b>
 <2><8b7>: Abbrev Number: 0
 <1><8b8>: Abbrev Number: 20 (DW_TAG_subprogram)
    <8b9>   DW_AT_external    : 1
    <8b9>   DW_AT_name        : (indirect string, offset: 0xcbc93): MX_GPIO_Init
    <8bd>   DW_AT_decl_file   : 1
    <8be>   DW_AT_decl_line   : 42
    <8bf>   DW_AT_decl_column : 6
    <8c0>   DW_AT_prototyped  : 1
    <8c0>   DW_AT_low_pc      : 0x80005c8
    <8c4>   DW_AT_high_pc     : 0x94
    <8c8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8ca>   DW_AT_GNU_all_tail_call_sites: 1
 <2><8ca>: Abbrev Number: 21 (DW_TAG_variable)
    <8cb>   DW_AT_name        : (indirect string, offset: 0xcbccf): GPIO_InitStruct
    <8cf>   DW_AT_decl_file   : 1
    <8d0>   DW_AT_decl_line   : 45
    <8d1>   DW_AT_decl_column : 20
    <8d2>   DW_AT_type        : <0x844>
    <8d6>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><8d9>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <8da>   DW_AT_low_pc      : 0x80005de
    <8de>   DW_AT_high_pc     : 0x18
    <8e2>   DW_AT_sibling     : <0x8f6>
 <3><8e6>: Abbrev Number: 21 (DW_TAG_variable)
    <8e7>   DW_AT_name        : (indirect string, offset: 0xcbb46): tmpreg
    <8eb>   DW_AT_decl_file   : 1
    <8ec>   DW_AT_decl_line   : 48
    <8ed>   DW_AT_decl_column : 3
    <8ee>   DW_AT_type        : <0x4fb>
    <8f2>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><8f5>: Abbrev Number: 0
 <2><8f6>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <8f7>   DW_AT_low_pc      : 0x80005f6
    <8fb>   DW_AT_high_pc     : 0x18
    <8ff>   DW_AT_sibling     : <0x913>
 <3><903>: Abbrev Number: 21 (DW_TAG_variable)
    <904>   DW_AT_name        : (indirect string, offset: 0xcbb46): tmpreg
    <908>   DW_AT_decl_file   : 1
    <909>   DW_AT_decl_line   : 49
    <90a>   DW_AT_decl_column : 3
    <90b>   DW_AT_type        : <0x4fb>
    <90f>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><912>: Abbrev Number: 0
 <2><913>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <914>   DW_AT_low_pc      : 0x800060e
    <918>   DW_AT_high_pc     : 0x18
 <3><91c>: Abbrev Number: 21 (DW_TAG_variable)
    <91d>   DW_AT_name        : (indirect string, offset: 0xcbb46): tmpreg
    <921>   DW_AT_decl_file   : 1
    <922>   DW_AT_decl_line   : 50
    <923>   DW_AT_decl_column : 3
    <924>   DW_AT_type        : <0x4fb>
    <928>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><92b>: Abbrev Number: 0
 <2><92c>: Abbrev Number: 0
 <1><92d>: Abbrev Number: 0
  Compilation Unit @ offset 0x92e:
   Length:        0x9ba (32-bit)
   Version:       4
   Abbrev Offset: 0x2a1
   Pointer Size:  4
 <0><939>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <93a>   DW_AT_producer    : (indirect string, offset: 0xc532f): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <93e>   DW_AT_language    : 12	(ANSI C99)
    <93f>   DW_AT_name        : (indirect string, offset: 0xcc390): ../Core/Src/main.c
    <943>   DW_AT_comp_dir    : (indirect string, offset: 0xca836): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/Assign2_Rieder_Nikolaus/Debug
    <947>   DW_AT_ranges      : 0x30
    <94b>   DW_AT_low_pc      : 0x0
    <94f>   DW_AT_stmt_list   : 0x1273
    <953>   DW_AT_GNU_macros  : 0x20489
 <1><957>: Abbrev Number: 2 (DW_TAG_base_type)
    <958>   DW_AT_byte_size   : 1
    <959>   DW_AT_encoding    : 6	(signed char)
    <95a>   DW_AT_name        : (indirect string, offset: 0x663d0): signed char
 <1><95e>: Abbrev Number: 2 (DW_TAG_base_type)
    <95f>   DW_AT_byte_size   : 1
    <960>   DW_AT_encoding    : 8	(unsigned char)
    <961>   DW_AT_name        : (indirect string, offset: 0xc3f44): unsigned char
 <1><965>: Abbrev Number: 2 (DW_TAG_base_type)
    <966>   DW_AT_byte_size   : 2
    <967>   DW_AT_encoding    : 5	(signed)
    <968>   DW_AT_name        : (indirect string, offset: 0x971b1): short int
 <1><96c>: Abbrev Number: 2 (DW_TAG_base_type)
    <96d>   DW_AT_byte_size   : 2
    <96e>   DW_AT_encoding    : 7	(unsigned)
    <96f>   DW_AT_name        : (indirect string, offset: 0xc2689): short unsigned int
 <1><973>: Abbrev Number: 2 (DW_TAG_base_type)
    <974>   DW_AT_byte_size   : 4
    <975>   DW_AT_encoding    : 5	(signed)
    <976>   DW_AT_name        : (indirect string, offset: 0x1165e): long int
 <1><97a>: Abbrev Number: 3 (DW_TAG_typedef)
    <97b>   DW_AT_name        : (indirect string, offset: 0x81eea): __uint32_t
    <97f>   DW_AT_decl_file   : 3
    <980>   DW_AT_decl_line   : 79
    <981>   DW_AT_decl_column : 25
    <982>   DW_AT_type        : <0x986>
 <1><986>: Abbrev Number: 2 (DW_TAG_base_type)
    <987>   DW_AT_byte_size   : 4
    <988>   DW_AT_encoding    : 7	(unsigned)
    <989>   DW_AT_name        : (indirect string, offset: 0x4dd76): long unsigned int
 <1><98d>: Abbrev Number: 2 (DW_TAG_base_type)
    <98e>   DW_AT_byte_size   : 8
    <98f>   DW_AT_encoding    : 5	(signed)
    <990>   DW_AT_name        : (indirect string, offset: 0x5cfba): long long int
 <1><994>: Abbrev Number: 2 (DW_TAG_base_type)
    <995>   DW_AT_byte_size   : 8
    <996>   DW_AT_encoding    : 7	(unsigned)
    <997>   DW_AT_name        : (indirect string, offset: 0x2a31b): long long unsigned int
 <1><99b>: Abbrev Number: 4 (DW_TAG_base_type)
    <99c>   DW_AT_byte_size   : 4
    <99d>   DW_AT_encoding    : 5	(signed)
    <99e>   DW_AT_name        : int
 <1><9a2>: Abbrev Number: 2 (DW_TAG_base_type)
    <9a3>   DW_AT_byte_size   : 4
    <9a4>   DW_AT_encoding    : 7	(unsigned)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x10c21): unsigned int
 <1><9a9>: Abbrev Number: 3 (DW_TAG_typedef)
    <9aa>   DW_AT_name        : (indirect string, offset: 0x9386d): uint32_t
    <9ae>   DW_AT_decl_file   : 4
    <9af>   DW_AT_decl_line   : 48
    <9b0>   DW_AT_decl_column : 20
    <9b1>   DW_AT_type        : <0x97a>
 <1><9b5>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <9b6>   DW_AT_type        : <0x9a9>
 <1><9ba>: Abbrev Number: 6 (DW_TAG_structure_type)
    <9bb>   DW_AT_byte_size   : 16
    <9bc>   DW_AT_decl_file   : 5
    <9bd>   DW_AT_decl_line   : 360
    <9bf>   DW_AT_decl_column : 9
    <9c0>   DW_AT_sibling     : <0x9fd>
 <2><9c4>: Abbrev Number: 7 (DW_TAG_member)
    <9c5>   DW_AT_name        : CCR
    <9c9>   DW_AT_decl_file   : 5
    <9ca>   DW_AT_decl_line   : 362
    <9cc>   DW_AT_decl_column : 17
    <9cd>   DW_AT_type        : <0x9b5>
    <9d1>   DW_AT_data_member_location: 0
 <2><9d2>: Abbrev Number: 8 (DW_TAG_member)
    <9d3>   DW_AT_name        : (indirect string, offset: 0xcc1bf): CNDTR
    <9d7>   DW_AT_decl_file   : 5
    <9d8>   DW_AT_decl_line   : 363
    <9da>   DW_AT_decl_column : 17
    <9db>   DW_AT_type        : <0x9b5>
    <9df>   DW_AT_data_member_location: 4
 <2><9e0>: Abbrev Number: 8 (DW_TAG_member)
    <9e1>   DW_AT_name        : (indirect string, offset: 0xcc40a): CPAR
    <9e5>   DW_AT_decl_file   : 5
    <9e6>   DW_AT_decl_line   : 364
    <9e8>   DW_AT_decl_column : 17
    <9e9>   DW_AT_type        : <0x9b5>
    <9ed>   DW_AT_data_member_location: 8
 <2><9ee>: Abbrev Number: 8 (DW_TAG_member)
    <9ef>   DW_AT_name        : (indirect string, offset: 0xcc067): CMAR
    <9f3>   DW_AT_decl_file   : 5
    <9f4>   DW_AT_decl_line   : 365
    <9f6>   DW_AT_decl_column : 17
    <9f7>   DW_AT_type        : <0x9b5>
    <9fb>   DW_AT_data_member_location: 12
 <2><9fc>: Abbrev Number: 0
 <1><9fd>: Abbrev Number: 9 (DW_TAG_typedef)
    <9fe>   DW_AT_name        : (indirect string, offset: 0xcc3e3): DMA_Channel_TypeDef
    <a02>   DW_AT_decl_file   : 5
    <a03>   DW_AT_decl_line   : 366
    <a05>   DW_AT_decl_column : 3
    <a06>   DW_AT_type        : <0x9ba>
 <1><a0a>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a0b>   DW_AT_byte_size   : 8
    <a0c>   DW_AT_decl_file   : 5
    <a0d>   DW_AT_decl_line   : 368
    <a0f>   DW_AT_decl_column : 9
    <a10>   DW_AT_sibling     : <0xa31>
 <2><a14>: Abbrev Number: 7 (DW_TAG_member)
    <a15>   DW_AT_name        : ISR
    <a19>   DW_AT_decl_file   : 5
    <a1a>   DW_AT_decl_line   : 370
    <a1c>   DW_AT_decl_column : 17
    <a1d>   DW_AT_type        : <0x9b5>
    <a21>   DW_AT_data_member_location: 0
 <2><a22>: Abbrev Number: 8 (DW_TAG_member)
    <a23>   DW_AT_name        : (indirect string, offset: 0xcc243): IFCR
    <a27>   DW_AT_decl_file   : 5
    <a28>   DW_AT_decl_line   : 371
    <a2a>   DW_AT_decl_column : 17
    <a2b>   DW_AT_type        : <0x9b5>
    <a2f>   DW_AT_data_member_location: 4
 <2><a30>: Abbrev Number: 0
 <1><a31>: Abbrev Number: 9 (DW_TAG_typedef)
    <a32>   DW_AT_name        : (indirect string, offset: 0xcbf36): DMA_TypeDef
    <a36>   DW_AT_decl_file   : 5
    <a37>   DW_AT_decl_line   : 372
    <a39>   DW_AT_decl_column : 3
    <a3a>   DW_AT_type        : <0xa0a>
 <1><a3e>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a3f>   DW_AT_byte_size   : 104
    <a40>   DW_AT_decl_file   : 5
    <a41>   DW_AT_decl_line   : 770
    <a43>   DW_AT_decl_column : 9
    <a44>   DW_AT_sibling     : <0xbb4>
 <2><a48>: Abbrev Number: 7 (DW_TAG_member)
    <a49>   DW_AT_name        : CR1
    <a4d>   DW_AT_decl_file   : 5
    <a4e>   DW_AT_decl_line   : 772
    <a50>   DW_AT_decl_column : 17
    <a51>   DW_AT_type        : <0x9b5>
    <a55>   DW_AT_data_member_location: 0
 <2><a56>: Abbrev Number: 7 (DW_TAG_member)
    <a57>   DW_AT_name        : CR2
    <a5b>   DW_AT_decl_file   : 5
    <a5c>   DW_AT_decl_line   : 773
    <a5e>   DW_AT_decl_column : 17
    <a5f>   DW_AT_type        : <0x9b5>
    <a63>   DW_AT_data_member_location: 4
 <2><a64>: Abbrev Number: 8 (DW_TAG_member)
    <a65>   DW_AT_name        : (indirect string, offset: 0x5422): SMCR
    <a69>   DW_AT_decl_file   : 5
    <a6a>   DW_AT_decl_line   : 774
    <a6c>   DW_AT_decl_column : 17
    <a6d>   DW_AT_type        : <0x9b5>
    <a71>   DW_AT_data_member_location: 8
 <2><a72>: Abbrev Number: 8 (DW_TAG_member)
    <a73>   DW_AT_name        : (indirect string, offset: 0x411fd): DIER
    <a77>   DW_AT_decl_file   : 5
    <a78>   DW_AT_decl_line   : 775
    <a7a>   DW_AT_decl_column : 17
    <a7b>   DW_AT_type        : <0x9b5>
    <a7f>   DW_AT_data_member_location: 12
 <2><a80>: Abbrev Number: 7 (DW_TAG_member)
    <a81>   DW_AT_name        : SR
    <a84>   DW_AT_decl_file   : 5
    <a85>   DW_AT_decl_line   : 776
    <a87>   DW_AT_decl_column : 17
    <a88>   DW_AT_type        : <0x9b5>
    <a8c>   DW_AT_data_member_location: 16
 <2><a8d>: Abbrev Number: 7 (DW_TAG_member)
    <a8e>   DW_AT_name        : EGR
    <a92>   DW_AT_decl_file   : 5
    <a93>   DW_AT_decl_line   : 777
    <a95>   DW_AT_decl_column : 17
    <a96>   DW_AT_type        : <0x9b5>
    <a9a>   DW_AT_data_member_location: 20
 <2><a9b>: Abbrev Number: 8 (DW_TAG_member)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x27380): CCMR1
    <aa0>   DW_AT_decl_file   : 5
    <aa1>   DW_AT_decl_line   : 778
    <aa3>   DW_AT_decl_column : 17
    <aa4>   DW_AT_type        : <0x9b5>
    <aa8>   DW_AT_data_member_location: 24
 <2><aa9>: Abbrev Number: 8 (DW_TAG_member)
    <aaa>   DW_AT_name        : (indirect string, offset: 0x51439): CCMR2
    <aae>   DW_AT_decl_file   : 5
    <aaf>   DW_AT_decl_line   : 779
    <ab1>   DW_AT_decl_column : 17
    <ab2>   DW_AT_type        : <0x9b5>
    <ab6>   DW_AT_data_member_location: 28
 <2><ab7>: Abbrev Number: 8 (DW_TAG_member)
    <ab8>   DW_AT_name        : (indirect string, offset: 0x30f5b): CCER
    <abc>   DW_AT_decl_file   : 5
    <abd>   DW_AT_decl_line   : 780
    <abf>   DW_AT_decl_column : 17
    <ac0>   DW_AT_type        : <0x9b5>
    <ac4>   DW_AT_data_member_location: 32
 <2><ac5>: Abbrev Number: 7 (DW_TAG_member)
    <ac6>   DW_AT_name        : CNT
    <aca>   DW_AT_decl_file   : 5
    <acb>   DW_AT_decl_line   : 781
    <acd>   DW_AT_decl_column : 17
    <ace>   DW_AT_type        : <0x9b5>
    <ad2>   DW_AT_data_member_location: 36
 <2><ad3>: Abbrev Number: 7 (DW_TAG_member)
    <ad4>   DW_AT_name        : PSC
    <ad8>   DW_AT_decl_file   : 5
    <ad9>   DW_AT_decl_line   : 782
    <adb>   DW_AT_decl_column : 17
    <adc>   DW_AT_type        : <0x9b5>
    <ae0>   DW_AT_data_member_location: 40
 <2><ae1>: Abbrev Number: 7 (DW_TAG_member)
    <ae2>   DW_AT_name        : ARR
    <ae6>   DW_AT_decl_file   : 5
    <ae7>   DW_AT_decl_line   : 783
    <ae9>   DW_AT_decl_column : 17
    <aea>   DW_AT_type        : <0x9b5>
    <aee>   DW_AT_data_member_location: 44
 <2><aef>: Abbrev Number: 7 (DW_TAG_member)
    <af0>   DW_AT_name        : RCR
    <af4>   DW_AT_decl_file   : 5
    <af5>   DW_AT_decl_line   : 784
    <af7>   DW_AT_decl_column : 17
    <af8>   DW_AT_type        : <0x9b5>
    <afc>   DW_AT_data_member_location: 48
 <2><afd>: Abbrev Number: 8 (DW_TAG_member)
    <afe>   DW_AT_name        : (indirect string, offset: 0x18416): CCR1
    <b02>   DW_AT_decl_file   : 5
    <b03>   DW_AT_decl_line   : 785
    <b05>   DW_AT_decl_column : 17
    <b06>   DW_AT_type        : <0x9b5>
    <b0a>   DW_AT_data_member_location: 52
 <2><b0b>: Abbrev Number: 8 (DW_TAG_member)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x55329): CCR2
    <b10>   DW_AT_decl_file   : 5
    <b11>   DW_AT_decl_line   : 786
    <b13>   DW_AT_decl_column : 17
    <b14>   DW_AT_type        : <0x9b5>
    <b18>   DW_AT_data_member_location: 56
 <2><b19>: Abbrev Number: 8 (DW_TAG_member)
    <b1a>   DW_AT_name        : (indirect string, offset: 0x399b2): CCR3
    <b1e>   DW_AT_decl_file   : 5
    <b1f>   DW_AT_decl_line   : 787
    <b21>   DW_AT_decl_column : 17
    <b22>   DW_AT_type        : <0x9b5>
    <b26>   DW_AT_data_member_location: 60
 <2><b27>: Abbrev Number: 8 (DW_TAG_member)
    <b28>   DW_AT_name        : (indirect string, offset: 0xcedb): CCR4
    <b2c>   DW_AT_decl_file   : 5
    <b2d>   DW_AT_decl_line   : 788
    <b2f>   DW_AT_decl_column : 17
    <b30>   DW_AT_type        : <0x9b5>
    <b34>   DW_AT_data_member_location: 64
 <2><b35>: Abbrev Number: 8 (DW_TAG_member)
    <b36>   DW_AT_name        : (indirect string, offset: 0x5dce4): BDTR
    <b3a>   DW_AT_decl_file   : 5
    <b3b>   DW_AT_decl_line   : 789
    <b3d>   DW_AT_decl_column : 17
    <b3e>   DW_AT_type        : <0x9b5>
    <b42>   DW_AT_data_member_location: 68
 <2><b43>: Abbrev Number: 7 (DW_TAG_member)
    <b44>   DW_AT_name        : DCR
    <b48>   DW_AT_decl_file   : 5
    <b49>   DW_AT_decl_line   : 790
    <b4b>   DW_AT_decl_column : 17
    <b4c>   DW_AT_type        : <0x9b5>
    <b50>   DW_AT_data_member_location: 72
 <2><b51>: Abbrev Number: 8 (DW_TAG_member)
    <b52>   DW_AT_name        : (indirect string, offset: 0x96af9): DMAR
    <b56>   DW_AT_decl_file   : 5
    <b57>   DW_AT_decl_line   : 791
    <b59>   DW_AT_decl_column : 17
    <b5a>   DW_AT_type        : <0x9b5>
    <b5e>   DW_AT_data_member_location: 76
 <2><b5f>: Abbrev Number: 7 (DW_TAG_member)
    <b60>   DW_AT_name        : OR1
    <b64>   DW_AT_decl_file   : 5
    <b65>   DW_AT_decl_line   : 792
    <b67>   DW_AT_decl_column : 17
    <b68>   DW_AT_type        : <0x9b5>
    <b6c>   DW_AT_data_member_location: 80
 <2><b6d>: Abbrev Number: 8 (DW_TAG_member)
    <b6e>   DW_AT_name        : (indirect string, offset: 0xb4bd7): CCMR3
    <b72>   DW_AT_decl_file   : 5
    <b73>   DW_AT_decl_line   : 793
    <b75>   DW_AT_decl_column : 17
    <b76>   DW_AT_type        : <0x9b5>
    <b7a>   DW_AT_data_member_location: 84
 <2><b7b>: Abbrev Number: 8 (DW_TAG_member)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x23f88): CCR5
    <b80>   DW_AT_decl_file   : 5
    <b81>   DW_AT_decl_line   : 794
    <b83>   DW_AT_decl_column : 17
    <b84>   DW_AT_type        : <0x9b5>
    <b88>   DW_AT_data_member_location: 88
 <2><b89>: Abbrev Number: 8 (DW_TAG_member)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x8fc45): CCR6
    <b8e>   DW_AT_decl_file   : 5
    <b8f>   DW_AT_decl_line   : 795
    <b91>   DW_AT_decl_column : 17
    <b92>   DW_AT_type        : <0x9b5>
    <b96>   DW_AT_data_member_location: 92
 <2><b97>: Abbrev Number: 7 (DW_TAG_member)
    <b98>   DW_AT_name        : OR2
    <b9c>   DW_AT_decl_file   : 5
    <b9d>   DW_AT_decl_line   : 796
    <b9f>   DW_AT_decl_column : 17
    <ba0>   DW_AT_type        : <0x9b5>
    <ba4>   DW_AT_data_member_location: 96
 <2><ba5>: Abbrev Number: 7 (DW_TAG_member)
    <ba6>   DW_AT_name        : OR3
    <baa>   DW_AT_decl_file   : 5
    <bab>   DW_AT_decl_line   : 797
    <bad>   DW_AT_decl_column : 17
    <bae>   DW_AT_type        : <0x9b5>
    <bb2>   DW_AT_data_member_location: 100
 <2><bb3>: Abbrev Number: 0
 <1><bb4>: Abbrev Number: 9 (DW_TAG_typedef)
    <bb5>   DW_AT_name        : (indirect string, offset: 0xcc3f7): TIM_TypeDef
    <bb9>   DW_AT_decl_file   : 5
    <bba>   DW_AT_decl_line   : 798
    <bbc>   DW_AT_decl_column : 3
    <bbd>   DW_AT_type        : <0xa3e>
 <1><bc1>: Abbrev Number: 2 (DW_TAG_base_type)
    <bc2>   DW_AT_byte_size   : 8
    <bc3>   DW_AT_encoding    : 4	(float)
    <bc4>   DW_AT_name        : (indirect string, offset: 0x12e03): long double
 <1><bc8>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <bc9>   DW_AT_encoding    : 7	(unsigned)
    <bca>   DW_AT_byte_size   : 1
    <bcb>   DW_AT_type        : <0x95e>
    <bcf>   DW_AT_decl_file   : 6
    <bd0>   DW_AT_decl_line   : 39
    <bd1>   DW_AT_decl_column : 1
    <bd2>   DW_AT_sibling     : <0xbef>
 <2><bd6>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bd7>   DW_AT_name        : (indirect string, offset: 0xcbf11): HAL_OK
    <bdb>   DW_AT_const_value : 0
 <2><bdc>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bdd>   DW_AT_name        : (indirect string, offset: 0xcc16c): HAL_ERROR
    <be1>   DW_AT_const_value : 1
 <2><be2>: Abbrev Number: 11 (DW_TAG_enumerator)
    <be3>   DW_AT_name        : (indirect string, offset: 0xcbe46): HAL_BUSY
    <be7>   DW_AT_const_value : 2
 <2><be8>: Abbrev Number: 11 (DW_TAG_enumerator)
    <be9>   DW_AT_name        : (indirect string, offset: 0xcbed4): HAL_TIMEOUT
    <bed>   DW_AT_const_value : 3
 <2><bee>: Abbrev Number: 0
 <1><bef>: Abbrev Number: 3 (DW_TAG_typedef)
    <bf0>   DW_AT_name        : (indirect string, offset: 0xcbd6e): HAL_StatusTypeDef
    <bf4>   DW_AT_decl_file   : 6
    <bf5>   DW_AT_decl_line   : 44
    <bf6>   DW_AT_decl_column : 3
    <bf7>   DW_AT_type        : <0xbc8>
 <1><bfb>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <bfc>   DW_AT_encoding    : 7	(unsigned)
    <bfd>   DW_AT_byte_size   : 1
    <bfe>   DW_AT_type        : <0x95e>
    <c02>   DW_AT_decl_file   : 6
    <c03>   DW_AT_decl_line   : 50
    <c04>   DW_AT_decl_column : 1
    <c05>   DW_AT_sibling     : <0xc16>
 <2><c09>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c0a>   DW_AT_name        : (indirect string, offset: 0xcc265): HAL_UNLOCKED
    <c0e>   DW_AT_const_value : 0
 <2><c0f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c10>   DW_AT_name        : (indirect string, offset: 0xcc440): HAL_LOCKED
    <c14>   DW_AT_const_value : 1
 <2><c15>: Abbrev Number: 0
 <1><c16>: Abbrev Number: 3 (DW_TAG_typedef)
    <c17>   DW_AT_name        : (indirect string, offset: 0xcc123): HAL_LockTypeDef
    <c1b>   DW_AT_decl_file   : 6
    <c1c>   DW_AT_decl_line   : 53
    <c1d>   DW_AT_decl_column : 3
    <c1e>   DW_AT_type        : <0xbfb>
 <1><c22>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c23>   DW_AT_byte_size   : 28
    <c24>   DW_AT_decl_file   : 7
    <c25>   DW_AT_decl_line   : 45
    <c26>   DW_AT_decl_column : 9
    <c27>   DW_AT_sibling     : <0xc87>
 <2><c2b>: Abbrev Number: 13 (DW_TAG_member)
    <c2c>   DW_AT_name        : (indirect string, offset: 0xcc1ef): PLLState
    <c30>   DW_AT_decl_file   : 7
    <c31>   DW_AT_decl_line   : 47
    <c32>   DW_AT_decl_column : 12
    <c33>   DW_AT_type        : <0x9a9>
    <c37>   DW_AT_data_member_location: 0
 <2><c38>: Abbrev Number: 13 (DW_TAG_member)
    <c39>   DW_AT_name        : (indirect string, offset: 0xcc239): PLLSource
    <c3d>   DW_AT_decl_file   : 7
    <c3e>   DW_AT_decl_line   : 50
    <c3f>   DW_AT_decl_column : 12
    <c40>   DW_AT_type        : <0x9a9>
    <c44>   DW_AT_data_member_location: 4
 <2><c45>: Abbrev Number: 13 (DW_TAG_member)
    <c46>   DW_AT_name        : (indirect string, offset: 0xcc1ba): PLLM
    <c4a>   DW_AT_decl_file   : 7
    <c4b>   DW_AT_decl_line   : 53
    <c4c>   DW_AT_decl_column : 12
    <c4d>   DW_AT_type        : <0x9a9>
    <c51>   DW_AT_data_member_location: 8
 <2><c52>: Abbrev Number: 13 (DW_TAG_member)
    <c53>   DW_AT_name        : (indirect string, offset: 0xcc316): PLLN
    <c57>   DW_AT_decl_file   : 7
    <c58>   DW_AT_decl_line   : 57
    <c59>   DW_AT_decl_column : 12
    <c5a>   DW_AT_type        : <0x9a9>
    <c5e>   DW_AT_data_member_location: 12
 <2><c5f>: Abbrev Number: 13 (DW_TAG_member)
    <c60>   DW_AT_name        : (indirect string, offset: 0xcbe28): PLLP
    <c64>   DW_AT_decl_file   : 7
    <c65>   DW_AT_decl_line   : 61
    <c66>   DW_AT_decl_column : 12
    <c67>   DW_AT_type        : <0x9a9>
    <c6b>   DW_AT_data_member_location: 16
 <2><c6c>: Abbrev Number: 13 (DW_TAG_member)
    <c6d>   DW_AT_name        : (indirect string, offset: 0x4b74a): PLLQ
    <c71>   DW_AT_decl_file   : 7
    <c72>   DW_AT_decl_line   : 65
    <c73>   DW_AT_decl_column : 12
    <c74>   DW_AT_type        : <0x9a9>
    <c78>   DW_AT_data_member_location: 20
 <2><c79>: Abbrev Number: 13 (DW_TAG_member)
    <c7a>   DW_AT_name        : (indirect string, offset: 0xcc31b): PLLR
    <c7e>   DW_AT_decl_file   : 7
    <c7f>   DW_AT_decl_line   : 68
    <c80>   DW_AT_decl_column : 12
    <c81>   DW_AT_type        : <0x9a9>
    <c85>   DW_AT_data_member_location: 24
 <2><c86>: Abbrev Number: 0
 <1><c87>: Abbrev Number: 3 (DW_TAG_typedef)
    <c88>   DW_AT_name        : (indirect string, offset: 0xcc145): RCC_PLLInitTypeDef
    <c8c>   DW_AT_decl_file   : 7
    <c8d>   DW_AT_decl_line   : 73
    <c8e>   DW_AT_decl_column : 2
    <c8f>   DW_AT_type        : <0xc22>
 <1><c93>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c94>   DW_AT_byte_size   : 68
    <c95>   DW_AT_decl_file   : 7
    <c96>   DW_AT_decl_line   : 78
    <c97>   DW_AT_decl_column : 9
    <c98>   DW_AT_sibling     : <0xd2c>
 <2><c9c>: Abbrev Number: 13 (DW_TAG_member)
    <c9d>   DW_AT_name        : (indirect string, offset: 0xcc2dc): OscillatorType
    <ca1>   DW_AT_decl_file   : 7
    <ca2>   DW_AT_decl_line   : 80
    <ca3>   DW_AT_decl_column : 12
    <ca4>   DW_AT_type        : <0x9a9>
    <ca8>   DW_AT_data_member_location: 0
 <2><ca9>: Abbrev Number: 13 (DW_TAG_member)
    <caa>   DW_AT_name        : (indirect string, offset: 0xcc1f8): HSEState
    <cae>   DW_AT_decl_file   : 7
    <caf>   DW_AT_decl_line   : 83
    <cb0>   DW_AT_decl_column : 12
    <cb1>   DW_AT_type        : <0x9a9>
    <cb5>   DW_AT_data_member_location: 4
 <2><cb6>: Abbrev Number: 13 (DW_TAG_member)
    <cb7>   DW_AT_name        : (indirect string, offset: 0xcc176): LSEState
    <cbb>   DW_AT_decl_file   : 7
    <cbc>   DW_AT_decl_line   : 86
    <cbd>   DW_AT_decl_column : 12
    <cbe>   DW_AT_type        : <0x9a9>
    <cc2>   DW_AT_data_member_location: 8
 <2><cc3>: Abbrev Number: 13 (DW_TAG_member)
    <cc4>   DW_AT_name        : (indirect string, offset: 0xcbfc8): HSIState
    <cc8>   DW_AT_decl_file   : 7
    <cc9>   DW_AT_decl_line   : 89
    <cca>   DW_AT_decl_column : 12
    <ccb>   DW_AT_type        : <0x9a9>
    <ccf>   DW_AT_data_member_location: 12
 <2><cd0>: Abbrev Number: 13 (DW_TAG_member)
    <cd1>   DW_AT_name        : (indirect string, offset: 0xcc37c): HSICalibrationValue
    <cd5>   DW_AT_decl_file   : 7
    <cd6>   DW_AT_decl_line   : 92
    <cd7>   DW_AT_decl_column : 12
    <cd8>   DW_AT_type        : <0x9a9>
    <cdc>   DW_AT_data_member_location: 16
 <2><cdd>: Abbrev Number: 13 (DW_TAG_member)
    <cde>   DW_AT_name        : (indirect string, offset: 0xcbf2d): LSIState
    <ce2>   DW_AT_decl_file   : 7
    <ce3>   DW_AT_decl_line   : 98
    <ce4>   DW_AT_decl_column : 12
    <ce5>   DW_AT_type        : <0x9a9>
    <ce9>   DW_AT_data_member_location: 20
 <2><cea>: Abbrev Number: 13 (DW_TAG_member)
    <ceb>   DW_AT_name        : (indirect string, offset: 0xcbf18): MSIState
    <cef>   DW_AT_decl_file   : 7
    <cf0>   DW_AT_decl_line   : 106
    <cf1>   DW_AT_decl_column : 12
    <cf2>   DW_AT_type        : <0x9a9>
    <cf6>   DW_AT_data_member_location: 24
 <2><cf7>: Abbrev Number: 13 (DW_TAG_member)
    <cf8>   DW_AT_name        : (indirect string, offset: 0xcbee0): MSICalibrationValue
    <cfc>   DW_AT_decl_file   : 7
    <cfd>   DW_AT_decl_line   : 109
    <cfe>   DW_AT_decl_column : 12
    <cff>   DW_AT_type        : <0x9a9>
    <d03>   DW_AT_data_member_location: 28
 <2><d04>: Abbrev Number: 13 (DW_TAG_member)
    <d05>   DW_AT_name        : (indirect string, offset: 0xcc008): MSIClockRange
    <d09>   DW_AT_decl_file   : 7
    <d0a>   DW_AT_decl_line   : 112
    <d0b>   DW_AT_decl_column : 12
    <d0c>   DW_AT_type        : <0x9a9>
    <d10>   DW_AT_data_member_location: 32
 <2><d11>: Abbrev Number: 13 (DW_TAG_member)
    <d12>   DW_AT_name        : (indirect string, offset: 0xcc25a): HSI48State
    <d16>   DW_AT_decl_file   : 7
    <d17>   DW_AT_decl_line   : 115
    <d18>   DW_AT_decl_column : 12
    <d19>   DW_AT_type        : <0x9a9>
    <d1d>   DW_AT_data_member_location: 36
 <2><d1e>: Abbrev Number: 14 (DW_TAG_member)
    <d1f>   DW_AT_name        : PLL
    <d23>   DW_AT_decl_file   : 7
    <d24>   DW_AT_decl_line   : 118
    <d25>   DW_AT_decl_column : 22
    <d26>   DW_AT_type        : <0xc87>
    <d2a>   DW_AT_data_member_location: 40
 <2><d2b>: Abbrev Number: 0
 <1><d2c>: Abbrev Number: 3 (DW_TAG_typedef)
    <d2d>   DW_AT_name        : (indirect string, offset: 0xcc02c): RCC_OscInitTypeDef
    <d31>   DW_AT_decl_file   : 7
    <d32>   DW_AT_decl_line   : 120
    <d33>   DW_AT_decl_column : 2
    <d34>   DW_AT_type        : <0xc93>
 <1><d38>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d39>   DW_AT_byte_size   : 20
    <d3a>   DW_AT_decl_file   : 7
    <d3b>   DW_AT_decl_line   : 125
    <d3c>   DW_AT_decl_column : 9
    <d3d>   DW_AT_sibling     : <0xd83>
 <2><d41>: Abbrev Number: 13 (DW_TAG_member)
    <d42>   DW_AT_name        : (indirect string, offset: 0xcbef4): ClockType
    <d46>   DW_AT_decl_file   : 7
    <d47>   DW_AT_decl_line   : 127
    <d48>   DW_AT_decl_column : 12
    <d49>   DW_AT_type        : <0x9a9>
    <d4d>   DW_AT_data_member_location: 0
 <2><d4e>: Abbrev Number: 13 (DW_TAG_member)
    <d4f>   DW_AT_name        : (indirect string, offset: 0xcc138): SYSCLKSource
    <d53>   DW_AT_decl_file   : 7
    <d54>   DW_AT_decl_line   : 130
    <d55>   DW_AT_decl_column : 12
    <d56>   DW_AT_type        : <0x9a9>
    <d5a>   DW_AT_data_member_location: 4
 <2><d5b>: Abbrev Number: 13 (DW_TAG_member)
    <d5c>   DW_AT_name        : (indirect string, offset: 0xcc308): AHBCLKDivider
    <d60>   DW_AT_decl_file   : 7
    <d61>   DW_AT_decl_line   : 133
    <d62>   DW_AT_decl_column : 12
    <d63>   DW_AT_type        : <0x9a9>
    <d67>   DW_AT_data_member_location: 8
 <2><d68>: Abbrev Number: 13 (DW_TAG_member)
    <d69>   DW_AT_name        : (indirect string, offset: 0xcbdae): APB1CLKDivider
    <d6d>   DW_AT_decl_file   : 7
    <d6e>   DW_AT_decl_line   : 136
    <d6f>   DW_AT_decl_column : 12
    <d70>   DW_AT_type        : <0x9a9>
    <d74>   DW_AT_data_member_location: 12
 <2><d75>: Abbrev Number: 13 (DW_TAG_member)
    <d76>   DW_AT_name        : (indirect string, offset: 0xcbfd1): APB2CLKDivider
    <d7a>   DW_AT_decl_file   : 7
    <d7b>   DW_AT_decl_line   : 139
    <d7c>   DW_AT_decl_column : 12
    <d7d>   DW_AT_type        : <0x9a9>
    <d81>   DW_AT_data_member_location: 16
 <2><d82>: Abbrev Number: 0
 <1><d83>: Abbrev Number: 3 (DW_TAG_typedef)
    <d84>   DW_AT_name        : (indirect string, offset: 0xcbefe): RCC_ClkInitTypeDef
    <d88>   DW_AT_decl_file   : 7
    <d89>   DW_AT_decl_line   : 142
    <d8a>   DW_AT_decl_column : 2
    <d8b>   DW_AT_type        : <0xd38>
 <1><d8f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d90>   DW_AT_byte_size   : 32
    <d91>   DW_AT_decl_file   : 8
    <d92>   DW_AT_decl_line   : 46
    <d93>   DW_AT_decl_column : 9
    <d94>   DW_AT_sibling     : <0xe01>
 <2><d98>: Abbrev Number: 13 (DW_TAG_member)
    <d99>   DW_AT_name        : (indirect string, offset: 0xcc3a3): Request
    <d9d>   DW_AT_decl_file   : 8
    <d9e>   DW_AT_decl_line   : 48
    <d9f>   DW_AT_decl_column : 12
    <da0>   DW_AT_type        : <0x9a9>
    <da4>   DW_AT_data_member_location: 0
 <2><da5>: Abbrev Number: 13 (DW_TAG_member)
    <da6>   DW_AT_name        : (indirect string, offset: 0xcffa9): Direction
    <daa>   DW_AT_decl_file   : 8
    <dab>   DW_AT_decl_line   : 51
    <dac>   DW_AT_decl_column : 12
    <dad>   DW_AT_type        : <0x9a9>
    <db1>   DW_AT_data_member_location: 4
 <2><db2>: Abbrev Number: 13 (DW_TAG_member)
    <db3>   DW_AT_name        : (indirect string, offset: 0xcbe07): PeriphInc
    <db7>   DW_AT_decl_file   : 8
    <db8>   DW_AT_decl_line   : 55
    <db9>   DW_AT_decl_column : 12
    <dba>   DW_AT_type        : <0x9a9>
    <dbe>   DW_AT_data_member_location: 8
 <2><dbf>: Abbrev Number: 13 (DW_TAG_member)
    <dc0>   DW_AT_name        : (indirect string, offset: 0xcbe3f): MemInc
    <dc4>   DW_AT_decl_file   : 8
    <dc5>   DW_AT_decl_line   : 58
    <dc6>   DW_AT_decl_column : 12
    <dc7>   DW_AT_type        : <0x9a9>
    <dcb>   DW_AT_data_member_location: 12
 <2><dcc>: Abbrev Number: 13 (DW_TAG_member)
    <dcd>   DW_AT_name        : (indirect string, offset: 0xcbfe0): PeriphDataAlignment
    <dd1>   DW_AT_decl_file   : 8
    <dd2>   DW_AT_decl_line   : 61
    <dd3>   DW_AT_decl_column : 12
    <dd4>   DW_AT_type        : <0x9a9>
    <dd8>   DW_AT_data_member_location: 16
 <2><dd9>: Abbrev Number: 13 (DW_TAG_member)
    <dda>   DW_AT_name        : (indirect string, offset: 0xcc3ab): MemDataAlignment
    <dde>   DW_AT_decl_file   : 8
    <ddf>   DW_AT_decl_line   : 64
    <de0>   DW_AT_decl_column : 12
    <de1>   DW_AT_type        : <0x9a9>
    <de5>   DW_AT_data_member_location: 20
 <2><de6>: Abbrev Number: 13 (DW_TAG_member)
    <de7>   DW_AT_name        : (indirect string, offset: 0xcf6ad): Mode
    <deb>   DW_AT_decl_file   : 8
    <dec>   DW_AT_decl_line   : 67
    <ded>   DW_AT_decl_column : 12
    <dee>   DW_AT_type        : <0x9a9>
    <df2>   DW_AT_data_member_location: 24
 <2><df3>: Abbrev Number: 13 (DW_TAG_member)
    <df4>   DW_AT_name        : (indirect string, offset: 0xced93): Priority
    <df8>   DW_AT_decl_file   : 8
    <df9>   DW_AT_decl_line   : 72
    <dfa>   DW_AT_decl_column : 12
    <dfb>   DW_AT_type        : <0x9a9>
    <dff>   DW_AT_data_member_location: 28
 <2><e00>: Abbrev Number: 0
 <1><e01>: Abbrev Number: 3 (DW_TAG_typedef)
    <e02>   DW_AT_name        : (indirect string, offset: 0xcbeb0): DMA_InitTypeDef
    <e06>   DW_AT_decl_file   : 8
    <e07>   DW_AT_decl_line   : 74
    <e08>   DW_AT_decl_column : 3
    <e09>   DW_AT_type        : <0xd8f>
 <1><e0d>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <e0e>   DW_AT_encoding    : 7	(unsigned)
    <e0f>   DW_AT_byte_size   : 1
    <e10>   DW_AT_type        : <0x95e>
    <e14>   DW_AT_decl_file   : 8
    <e15>   DW_AT_decl_line   : 80
    <e16>   DW_AT_decl_column : 1
    <e17>   DW_AT_sibling     : <0xe34>
 <2><e1b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e1c>   DW_AT_name        : (indirect string, offset: 0xcc272): HAL_DMA_STATE_RESET
    <e20>   DW_AT_const_value : 0
 <2><e21>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e22>   DW_AT_name        : (indirect string, offset: 0xcbec0): HAL_DMA_STATE_READY
    <e26>   DW_AT_const_value : 1
 <2><e27>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e28>   DW_AT_name        : (indirect string, offset: 0xcc226): HAL_DMA_STATE_BUSY
    <e2c>   DW_AT_const_value : 2
 <2><e2d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e2e>   DW_AT_name        : (indirect string, offset: 0xcc419): HAL_DMA_STATE_TIMEOUT
    <e32>   DW_AT_const_value : 3
 <2><e33>: Abbrev Number: 0
 <1><e34>: Abbrev Number: 3 (DW_TAG_typedef)
    <e35>   DW_AT_name        : (indirect string, offset: 0xcc1da): HAL_DMA_StateTypeDef
    <e39>   DW_AT_decl_file   : 8
    <e3a>   DW_AT_decl_line   : 85
    <e3b>   DW_AT_decl_column : 2
    <e3c>   DW_AT_type        : <0xe0d>
 <1><e40>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <e41>   DW_AT_type        : <0xe34>
 <1><e45>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e46>   DW_AT_name        : (indirect string, offset: 0xcc354): __DMA_HandleTypeDef
    <e4a>   DW_AT_byte_size   : 72
    <e4b>   DW_AT_decl_file   : 8
    <e4c>   DW_AT_decl_line   : 112
    <e4d>   DW_AT_decl_column : 16
    <e4e>   DW_AT_sibling     : <0xeef>
 <2><e52>: Abbrev Number: 13 (DW_TAG_member)
    <e53>   DW_AT_name        : (indirect string, offset: 0xcc2eb): Instance
    <e57>   DW_AT_decl_file   : 8
    <e58>   DW_AT_decl_line   : 114
    <e59>   DW_AT_decl_column : 27
    <e5a>   DW_AT_type        : <0xeef>
    <e5e>   DW_AT_data_member_location: 0
 <2><e5f>: Abbrev Number: 13 (DW_TAG_member)
    <e60>   DW_AT_name        : (indirect string, offset: 0xcff9b): Init
    <e64>   DW_AT_decl_file   : 8
    <e65>   DW_AT_decl_line   : 116
    <e66>   DW_AT_decl_column : 25
    <e67>   DW_AT_type        : <0xe01>
    <e6b>   DW_AT_data_member_location: 4
 <2><e6c>: Abbrev Number: 13 (DW_TAG_member)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x90da2): Lock
    <e71>   DW_AT_decl_file   : 8
    <e72>   DW_AT_decl_line   : 118
    <e73>   DW_AT_decl_column : 25
    <e74>   DW_AT_type        : <0xc16>
    <e78>   DW_AT_data_member_location: 36
 <2><e79>: Abbrev Number: 13 (DW_TAG_member)
    <e7a>   DW_AT_name        : (indirect string, offset: 0xd0ff1): State
    <e7e>   DW_AT_decl_file   : 8
    <e7f>   DW_AT_decl_line   : 120
    <e80>   DW_AT_decl_column : 30
    <e81>   DW_AT_type        : <0xe40>
    <e85>   DW_AT_data_member_location: 37
 <2><e86>: Abbrev Number: 13 (DW_TAG_member)
    <e87>   DW_AT_name        : (indirect string, offset: 0xcc403): Parent
    <e8b>   DW_AT_decl_file   : 8
    <e8c>   DW_AT_decl_line   : 122
    <e8d>   DW_AT_decl_column : 26
    <e8e>   DW_AT_type        : <0xef5>
    <e92>   DW_AT_data_member_location: 40
 <2><e93>: Abbrev Number: 13 (DW_TAG_member)
    <e94>   DW_AT_name        : (indirect string, offset: 0xcc42f): XferCpltCallback
    <e98>   DW_AT_decl_file   : 8
    <e99>   DW_AT_decl_line   : 124
    <e9a>   DW_AT_decl_column : 28
    <e9b>   DW_AT_type        : <0xf08>
    <e9f>   DW_AT_data_member_location: 44
 <2><ea0>: Abbrev Number: 13 (DW_TAG_member)
    <ea1>   DW_AT_name        : (indirect string, offset: 0xcc29f): XferHalfCpltCallback
    <ea5>   DW_AT_decl_file   : 8
    <ea6>   DW_AT_decl_line   : 126
    <ea7>   DW_AT_decl_column : 28
    <ea8>   DW_AT_type        : <0xf08>
    <eac>   DW_AT_data_member_location: 48
 <2><ead>: Abbrev Number: 13 (DW_TAG_member)
    <eae>   DW_AT_name        : (indirect string, offset: 0xcbe2d): XferErrorCallback
    <eb2>   DW_AT_decl_file   : 8
    <eb3>   DW_AT_decl_line   : 128
    <eb4>   DW_AT_decl_column : 28
    <eb5>   DW_AT_type        : <0xf08>
    <eb9>   DW_AT_data_member_location: 52
 <2><eba>: Abbrev Number: 13 (DW_TAG_member)
    <ebb>   DW_AT_name        : (indirect string, offset: 0xcc3c8): XferAbortCallback
    <ebf>   DW_AT_decl_file   : 8
    <ec0>   DW_AT_decl_line   : 130
    <ec1>   DW_AT_decl_column : 28
    <ec2>   DW_AT_type        : <0xf08>
    <ec6>   DW_AT_data_member_location: 56
 <2><ec7>: Abbrev Number: 13 (DW_TAG_member)
    <ec8>   DW_AT_name        : (indirect string, offset: 0xcc40f): ErrorCode
    <ecc>   DW_AT_decl_file   : 8
    <ecd>   DW_AT_decl_line   : 132
    <ece>   DW_AT_decl_column : 25
    <ecf>   DW_AT_type        : <0x9b5>
    <ed3>   DW_AT_data_member_location: 60
 <2><ed4>: Abbrev Number: 13 (DW_TAG_member)
    <ed5>   DW_AT_name        : (indirect string, offset: 0xcbf7e): DmaBaseAddress
    <ed9>   DW_AT_decl_file   : 8
    <eda>   DW_AT_decl_line   : 134
    <edb>   DW_AT_decl_column : 26
    <edc>   DW_AT_type        : <0xf0e>
    <ee0>   DW_AT_data_member_location: 64
 <2><ee1>: Abbrev Number: 13 (DW_TAG_member)
    <ee2>   DW_AT_name        : (indirect string, offset: 0xcbdfa): ChannelIndex
    <ee6>   DW_AT_decl_file   : 8
    <ee7>   DW_AT_decl_line   : 136
    <ee8>   DW_AT_decl_column : 25
    <ee9>   DW_AT_type        : <0x9a9>
    <eed>   DW_AT_data_member_location: 68
 <2><eee>: Abbrev Number: 0
 <1><eef>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <ef0>   DW_AT_byte_size   : 4
    <ef1>   DW_AT_type        : <0x9fd>
 <1><ef5>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <ef6>   DW_AT_byte_size   : 4
 <1><ef7>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <ef8>   DW_AT_prototyped  : 1
    <ef8>   DW_AT_sibling     : <0xf02>
 <2><efc>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <efd>   DW_AT_type        : <0xf02>
 <2><f01>: Abbrev Number: 0
 <1><f02>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f03>   DW_AT_byte_size   : 4
    <f04>   DW_AT_type        : <0xe45>
 <1><f08>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f09>   DW_AT_byte_size   : 4
    <f0a>   DW_AT_type        : <0xef7>
 <1><f0e>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f0f>   DW_AT_byte_size   : 4
    <f10>   DW_AT_type        : <0xa31>
 <1><f14>: Abbrev Number: 3 (DW_TAG_typedef)
    <f15>   DW_AT_name        : (indirect string, offset: 0xcc356): DMA_HandleTypeDef
    <f19>   DW_AT_decl_file   : 8
    <f1a>   DW_AT_decl_line   : 153
    <f1b>   DW_AT_decl_column : 2
    <f1c>   DW_AT_type        : <0xe45>
 <1><f20>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <f21>   DW_AT_byte_size   : 4
    <f22>   DW_AT_type        : <0xf14>
 <1><f26>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f27>   DW_AT_byte_size   : 24
    <f28>   DW_AT_decl_file   : 9
    <f29>   DW_AT_decl_line   : 46
    <f2a>   DW_AT_decl_column : 9
    <f2b>   DW_AT_sibling     : <0xf7e>
 <2><f2f>: Abbrev Number: 13 (DW_TAG_member)
    <f30>   DW_AT_name        : (indirect string, offset: 0xccd45): Prescaler
    <f34>   DW_AT_decl_file   : 9
    <f35>   DW_AT_decl_line   : 48
    <f36>   DW_AT_decl_column : 12
    <f37>   DW_AT_type        : <0x9a9>
    <f3b>   DW_AT_data_member_location: 0
 <2><f3c>: Abbrev Number: 13 (DW_TAG_member)
    <f3d>   DW_AT_name        : (indirect string, offset: 0xcc3bc): CounterMode
    <f41>   DW_AT_decl_file   : 9
    <f42>   DW_AT_decl_line   : 51
    <f43>   DW_AT_decl_column : 12
    <f44>   DW_AT_type        : <0x9a9>
    <f48>   DW_AT_data_member_location: 4
 <2><f49>: Abbrev Number: 13 (DW_TAG_member)
    <f4a>   DW_AT_name        : (indirect string, offset: 0xd6d3c): Period
    <f4e>   DW_AT_decl_file   : 9
    <f4f>   DW_AT_decl_line   : 54
    <f50>   DW_AT_decl_column : 12
    <f51>   DW_AT_type        : <0x9a9>
    <f55>   DW_AT_data_member_location: 8
 <2><f56>: Abbrev Number: 13 (DW_TAG_member)
    <f57>   DW_AT_name        : (indirect string, offset: 0xcbf8d): ClockDivision
    <f5b>   DW_AT_decl_file   : 9
    <f5c>   DW_AT_decl_line   : 58
    <f5d>   DW_AT_decl_column : 12
    <f5e>   DW_AT_type        : <0x9a9>
    <f62>   DW_AT_data_member_location: 12
 <2><f63>: Abbrev Number: 13 (DW_TAG_member)
    <f64>   DW_AT_name        : (indirect string, offset: 0xcc248): RepetitionCounter
    <f68>   DW_AT_decl_file   : 9
    <f69>   DW_AT_decl_line   : 61
    <f6a>   DW_AT_decl_column : 12
    <f6b>   DW_AT_type        : <0x9a9>
    <f6f>   DW_AT_data_member_location: 16
 <2><f70>: Abbrev Number: 13 (DW_TAG_member)
    <f71>   DW_AT_name        : (indirect string, offset: 0xcbe16): AutoReloadPreload
    <f75>   DW_AT_decl_file   : 9
    <f76>   DW_AT_decl_line   : 72
    <f77>   DW_AT_decl_column : 12
    <f78>   DW_AT_type        : <0x9a9>
    <f7c>   DW_AT_data_member_location: 20
 <2><f7d>: Abbrev Number: 0
 <1><f7e>: Abbrev Number: 3 (DW_TAG_typedef)
    <f7f>   DW_AT_name        : (indirect string, offset: 0xcc2c7): TIM_Base_InitTypeDef
    <f83>   DW_AT_decl_file   : 9
    <f84>   DW_AT_decl_line   : 74
    <f85>   DW_AT_decl_column : 3
    <f86>   DW_AT_type        : <0xf26>
 <1><f8a>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <f8b>   DW_AT_encoding    : 7	(unsigned)
    <f8c>   DW_AT_byte_size   : 1
    <f8d>   DW_AT_type        : <0x95e>
    <f91>   DW_AT_decl_file   : 9
    <f92>   DW_AT_decl_line   : 301
    <f94>   DW_AT_decl_column : 1
    <f95>   DW_AT_sibling     : <0xfb8>
 <2><f99>: Abbrev Number: 11 (DW_TAG_enumerator)
    <f9a>   DW_AT_name        : (indirect string, offset: 0xcbff4): HAL_TIM_STATE_RESET
    <f9e>   DW_AT_const_value : 0
 <2><f9f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fa0>   DW_AT_name        : (indirect string, offset: 0xcbd9a): HAL_TIM_STATE_READY
    <fa4>   DW_AT_const_value : 1
 <2><fa5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fa6>   DW_AT_name        : (indirect string, offset: 0xcbe9d): HAL_TIM_STATE_BUSY
    <faa>   DW_AT_const_value : 2
 <2><fab>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fac>   DW_AT_name        : (indirect string, offset: 0xcc320): HAL_TIM_STATE_TIMEOUT
    <fb0>   DW_AT_const_value : 3
 <2><fb1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fb2>   DW_AT_name        : (indirect string, offset: 0xcc158): HAL_TIM_STATE_ERROR
    <fb6>   DW_AT_const_value : 4
 <2><fb7>: Abbrev Number: 0
 <1><fb8>: Abbrev Number: 9 (DW_TAG_typedef)
    <fb9>   DW_AT_name        : (indirect string, offset: 0xcc1c5): HAL_TIM_StateTypeDef
    <fbd>   DW_AT_decl_file   : 9
    <fbe>   DW_AT_decl_line   : 307
    <fc0>   DW_AT_decl_column : 3
    <fc1>   DW_AT_type        : <0xf8a>
 <1><fc5>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <fc6>   DW_AT_type        : <0xfb8>
 <1><fca>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <fcb>   DW_AT_encoding    : 7	(unsigned)
    <fcc>   DW_AT_byte_size   : 1
    <fcd>   DW_AT_type        : <0x95e>
    <fd1>   DW_AT_decl_file   : 9
    <fd2>   DW_AT_decl_line   : 313
    <fd4>   DW_AT_decl_column : 1
    <fd5>   DW_AT_sibling     : <0xfec>
 <2><fd9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fda>   DW_AT_name        : (indirect string, offset: 0xcbdde): HAL_TIM_CHANNEL_STATE_RESET
    <fde>   DW_AT_const_value : 0
 <2><fdf>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fe0>   DW_AT_name        : (indirect string, offset: 0xcc107): HAL_TIM_CHANNEL_STATE_READY
    <fe4>   DW_AT_const_value : 1
 <2><fe5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fe6>   DW_AT_name        : (indirect string, offset: 0xcc17f): HAL_TIM_CHANNEL_STATE_BUSY
    <fea>   DW_AT_const_value : 2
 <2><feb>: Abbrev Number: 0
 <1><fec>: Abbrev Number: 9 (DW_TAG_typedef)
    <fed>   DW_AT_name        : (indirect string, offset: 0xcbe4f): HAL_TIM_ChannelStateTypeDef
    <ff1>   DW_AT_decl_file   : 9
    <ff2>   DW_AT_decl_line   : 317
    <ff4>   DW_AT_decl_column : 3
    <ff5>   DW_AT_type        : <0xfca>
 <1><ff9>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <ffa>   DW_AT_type        : <0xfec>
 <1><ffe>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <fff>   DW_AT_encoding    : 7	(unsigned)
    <1000>   DW_AT_byte_size   : 1
    <1001>   DW_AT_type        : <0x95e>
    <1005>   DW_AT_decl_file   : 9
    <1006>   DW_AT_decl_line   : 323
    <1008>   DW_AT_decl_column : 1
    <1009>   DW_AT_sibling     : <0x1020>
 <2><100d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <100e>   DW_AT_name        : (indirect string, offset: 0xcbd80): HAL_DMA_BURST_STATE_RESET
    <1012>   DW_AT_const_value : 0
 <2><1013>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1014>   DW_AT_name        : (indirect string, offset: 0xcc03f): HAL_DMA_BURST_STATE_READY
    <1018>   DW_AT_const_value : 1
 <2><1019>: Abbrev Number: 11 (DW_TAG_enumerator)
    <101a>   DW_AT_name        : (indirect string, offset: 0xcc286): HAL_DMA_BURST_STATE_BUSY
    <101e>   DW_AT_const_value : 2
 <2><101f>: Abbrev Number: 0
 <1><1020>: Abbrev Number: 9 (DW_TAG_typedef)
    <1021>   DW_AT_name        : (indirect string, offset: 0xcbf61): HAL_TIM_DMABurstStateTypeDef
    <1025>   DW_AT_decl_file   : 9
    <1026>   DW_AT_decl_line   : 327
    <1028>   DW_AT_decl_column : 3
    <1029>   DW_AT_type        : <0xffe>
 <1><102d>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <102e>   DW_AT_type        : <0x1020>
 <1><1032>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <1033>   DW_AT_encoding    : 7	(unsigned)
    <1034>   DW_AT_byte_size   : 1
    <1035>   DW_AT_type        : <0x95e>
    <1039>   DW_AT_decl_file   : 9
    <103a>   DW_AT_decl_line   : 333
    <103c>   DW_AT_decl_column : 1
    <103d>   DW_AT_sibling     : <0x106c>
 <2><1041>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1042>   DW_AT_name        : (indirect string, offset: 0xcc06c): HAL_TIM_ACTIVE_CHANNEL_1
    <1046>   DW_AT_const_value : 1
 <2><1047>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1048>   DW_AT_name        : (indirect string, offset: 0xcc085): HAL_TIM_ACTIVE_CHANNEL_2
    <104c>   DW_AT_const_value : 2
 <2><104d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <104e>   DW_AT_name        : (indirect string, offset: 0xcc09e): HAL_TIM_ACTIVE_CHANNEL_3
    <1052>   DW_AT_const_value : 4
 <2><1053>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1054>   DW_AT_name        : (indirect string, offset: 0xcc0b7): HAL_TIM_ACTIVE_CHANNEL_4
    <1058>   DW_AT_const_value : 8
 <2><1059>: Abbrev Number: 11 (DW_TAG_enumerator)
    <105a>   DW_AT_name        : (indirect string, offset: 0xcc0d0): HAL_TIM_ACTIVE_CHANNEL_5
    <105e>   DW_AT_const_value : 16
 <2><105f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1060>   DW_AT_name        : (indirect string, offset: 0xcc0e9): HAL_TIM_ACTIVE_CHANNEL_6
    <1064>   DW_AT_const_value : 32
 <2><1065>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1066>   DW_AT_name        : (indirect string, offset: 0xcbf9b): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <106a>   DW_AT_const_value : 0
 <2><106b>: Abbrev Number: 0
 <1><106c>: Abbrev Number: 9 (DW_TAG_typedef)
    <106d>   DW_AT_name        : (indirect string, offset: 0xcc016): HAL_TIM_ActiveChannel
    <1071>   DW_AT_decl_file   : 9
    <1072>   DW_AT_decl_line   : 341
    <1074>   DW_AT_decl_column : 3
    <1075>   DW_AT_type        : <0x1032>
 <1><1079>: Abbrev Number: 6 (DW_TAG_structure_type)
    <107a>   DW_AT_byte_size   : 76
    <107b>   DW_AT_decl_file   : 9
    <107c>   DW_AT_decl_line   : 349
    <107e>   DW_AT_decl_column : 9
    <107f>   DW_AT_sibling     : <0x1102>
 <2><1083>: Abbrev Number: 8 (DW_TAG_member)
    <1084>   DW_AT_name        : (indirect string, offset: 0xcc2eb): Instance
    <1088>   DW_AT_decl_file   : 9
    <1089>   DW_AT_decl_line   : 352
    <108b>   DW_AT_decl_column : 39
    <108c>   DW_AT_type        : <0x1102>
    <1090>   DW_AT_data_member_location: 0
 <2><1091>: Abbrev Number: 8 (DW_TAG_member)
    <1092>   DW_AT_name        : (indirect string, offset: 0xcff9b): Init
    <1096>   DW_AT_decl_file   : 9
    <1097>   DW_AT_decl_line   : 353
    <1099>   DW_AT_decl_column : 38
    <109a>   DW_AT_type        : <0xf7e>
    <109e>   DW_AT_data_member_location: 4
 <2><109f>: Abbrev Number: 8 (DW_TAG_member)
    <10a0>   DW_AT_name        : (indirect string, offset: 0xcc024): Channel
    <10a4>   DW_AT_decl_file   : 9
    <10a5>   DW_AT_decl_line   : 354
    <10a7>   DW_AT_decl_column : 38
    <10a8>   DW_AT_type        : <0x106c>
    <10ac>   DW_AT_data_member_location: 28
 <2><10ad>: Abbrev Number: 8 (DW_TAG_member)
    <10ae>   DW_AT_name        : (indirect string, offset: 0xcc133): hdma
    <10b2>   DW_AT_decl_file   : 9
    <10b3>   DW_AT_decl_line   : 355
    <10b5>   DW_AT_decl_column : 39
    <10b6>   DW_AT_type        : <0x1108>
    <10ba>   DW_AT_data_member_location: 32
 <2><10bb>: Abbrev Number: 8 (DW_TAG_member)
    <10bc>   DW_AT_name        : (indirect string, offset: 0x90da2): Lock
    <10c0>   DW_AT_decl_file   : 9
    <10c1>   DW_AT_decl_line   : 357
    <10c3>   DW_AT_decl_column : 38
    <10c4>   DW_AT_type        : <0xc16>
    <10c8>   DW_AT_data_member_location: 60
 <2><10c9>: Abbrev Number: 8 (DW_TAG_member)
    <10ca>   DW_AT_name        : (indirect string, offset: 0xd0ff1): State
    <10ce>   DW_AT_decl_file   : 9
    <10cf>   DW_AT_decl_line   : 358
    <10d1>   DW_AT_decl_column : 38
    <10d2>   DW_AT_type        : <0xfc5>
    <10d6>   DW_AT_data_member_location: 61
 <2><10d7>: Abbrev Number: 8 (DW_TAG_member)
    <10d8>   DW_AT_name        : (indirect string, offset: 0xd0c79): ChannelState
    <10dc>   DW_AT_decl_file   : 9
    <10dd>   DW_AT_decl_line   : 359
    <10df>   DW_AT_decl_column : 38
    <10e0>   DW_AT_type        : <0x1128>
    <10e4>   DW_AT_data_member_location: 62
 <2><10e5>: Abbrev Number: 8 (DW_TAG_member)
    <10e6>   DW_AT_name        : (indirect string, offset: 0xd1395): ChannelNState
    <10ea>   DW_AT_decl_file   : 9
    <10eb>   DW_AT_decl_line   : 360
    <10ed>   DW_AT_decl_column : 38
    <10ee>   DW_AT_type        : <0x113d>
    <10f2>   DW_AT_data_member_location: 68
 <2><10f3>: Abbrev Number: 8 (DW_TAG_member)
    <10f4>   DW_AT_name        : (indirect string, offset: 0xd083a): DMABurstState
    <10f8>   DW_AT_decl_file   : 9
    <10f9>   DW_AT_decl_line   : 361
    <10fb>   DW_AT_decl_column : 38
    <10fc>   DW_AT_type        : <0x102d>
    <1100>   DW_AT_data_member_location: 72
 <2><1101>: Abbrev Number: 0
 <1><1102>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1103>   DW_AT_byte_size   : 4
    <1104>   DW_AT_type        : <0xbb4>
 <1><1108>: Abbrev Number: 21 (DW_TAG_array_type)
    <1109>   DW_AT_type        : <0xf20>
    <110d>   DW_AT_sibling     : <0x1118>
 <2><1111>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <1112>   DW_AT_type        : <0x9a2>
    <1116>   DW_AT_upper_bound : 6
 <2><1117>: Abbrev Number: 0
 <1><1118>: Abbrev Number: 21 (DW_TAG_array_type)
    <1119>   DW_AT_type        : <0xff9>
    <111d>   DW_AT_sibling     : <0x1128>
 <2><1121>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <1122>   DW_AT_type        : <0x9a2>
    <1126>   DW_AT_upper_bound : 5
 <2><1127>: Abbrev Number: 0
 <1><1128>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1129>   DW_AT_type        : <0x1118>
 <1><112d>: Abbrev Number: 21 (DW_TAG_array_type)
    <112e>   DW_AT_type        : <0xff9>
    <1132>   DW_AT_sibling     : <0x113d>
 <2><1136>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <1137>   DW_AT_type        : <0x9a2>
    <113b>   DW_AT_upper_bound : 3
 <2><113c>: Abbrev Number: 0
 <1><113d>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <113e>   DW_AT_type        : <0x112d>
 <1><1142>: Abbrev Number: 9 (DW_TAG_typedef)
    <1143>   DW_AT_name        : (indirect string, offset: 0xcbe6b): TIM_HandleTypeDef
    <1147>   DW_AT_decl_file   : 9
    <1148>   DW_AT_decl_line   : 393
    <114a>   DW_AT_decl_column : 3
    <114b>   DW_AT_type        : <0x1079>
 <1><114f>: Abbrev Number: 2 (DW_TAG_base_type)
    <1150>   DW_AT_byte_size   : 1
    <1151>   DW_AT_encoding    : 8	(unsigned char)
    <1152>   DW_AT_name        : (indirect string, offset: 0x413d3): char
 <1><1156>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <1157>   DW_AT_encoding    : 5	(signed)
    <1158>   DW_AT_byte_size   : 4
    <1159>   DW_AT_type        : <0x99b>
    <115d>   DW_AT_decl_file   : 10
    <115e>   DW_AT_decl_line   : 176
    <115f>   DW_AT_decl_column : 14
    <1160>   DW_AT_sibling     : <0x1198>
 <2><1164>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1165>   DW_AT_name        : (indirect string, offset: 0x9c5cc): osOK
    <1169>   DW_AT_const_value : 0
 <2><116a>: Abbrev Number: 23 (DW_TAG_enumerator)
    <116b>   DW_AT_name        : (indirect string, offset: 0x5e316): osError
    <116f>   DW_AT_const_value : -1
 <2><1170>: Abbrev Number: 23 (DW_TAG_enumerator)
    <1171>   DW_AT_name        : (indirect string, offset: 0x22c3b): osErrorTimeout
    <1175>   DW_AT_const_value : -2
 <2><1176>: Abbrev Number: 23 (DW_TAG_enumerator)
    <1177>   DW_AT_name        : (indirect string, offset: 0x856ab): osErrorResource
    <117b>   DW_AT_const_value : -3
 <2><117c>: Abbrev Number: 23 (DW_TAG_enumerator)
    <117d>   DW_AT_name        : (indirect string, offset: 0x34ad4): osErrorParameter
    <1181>   DW_AT_const_value : -4
 <2><1182>: Abbrev Number: 23 (DW_TAG_enumerator)
    <1183>   DW_AT_name        : (indirect string, offset: 0x23309): osErrorNoMemory
    <1187>   DW_AT_const_value : -5
 <2><1188>: Abbrev Number: 23 (DW_TAG_enumerator)
    <1189>   DW_AT_name        : (indirect string, offset: 0x36c13): osErrorISR
    <118d>   DW_AT_const_value : -6
 <2><118e>: Abbrev Number: 24 (DW_TAG_enumerator)
    <118f>   DW_AT_name        : (indirect string, offset: 0x66f74): osStatusReserved
    <1193>   DW_AT_const_value : 0x7fffffff
 <2><1197>: Abbrev Number: 0
 <1><1198>: Abbrev Number: 3 (DW_TAG_typedef)
    <1199>   DW_AT_name        : (indirect string, offset: 0x44eb4): osStatus_t
    <119d>   DW_AT_decl_file   : 10
    <119e>   DW_AT_decl_line   : 185
    <119f>   DW_AT_decl_column : 3
    <11a0>   DW_AT_type        : <0x1156>
 <1><11a4>: Abbrev Number: 25 (DW_TAG_subprogram)
    <11a5>   DW_AT_external    : 1
    <11a5>   DW_AT_name        : (indirect string, offset: 0xcbf21): HAL_IncTick
    <11a9>   DW_AT_decl_file   : 12
    <11aa>   DW_AT_decl_line   : 651
    <11ac>   DW_AT_decl_column : 20
    <11ad>   DW_AT_prototyped  : 1
    <11ad>   DW_AT_declaration : 1
 <1><11ad>: Abbrev Number: 26 (DW_TAG_subprogram)
    <11ae>   DW_AT_external    : 1
    <11ae>   DW_AT_name        : (indirect string, offset: 0xcc368): HAL_RCC_ClockConfig
    <11b2>   DW_AT_decl_file   : 7
    <11b3>   DW_AT_decl_line   : 4837
    <11b5>   DW_AT_decl_column : 19
    <11b6>   DW_AT_prototyped  : 1
    <11b6>   DW_AT_type        : <0xbef>
    <11ba>   DW_AT_declaration : 1
    <11ba>   DW_AT_sibling     : <0x11c9>
 <2><11be>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <11bf>   DW_AT_type        : <0x11c9>
 <2><11c3>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <11c4>   DW_AT_type        : <0x9a9>
 <2><11c8>: Abbrev Number: 0
 <1><11c9>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <11ca>   DW_AT_byte_size   : 4
    <11cb>   DW_AT_type        : <0xd83>
 <1><11cf>: Abbrev Number: 26 (DW_TAG_subprogram)
    <11d0>   DW_AT_external    : 1
    <11d0>   DW_AT_name        : (indirect string, offset: 0xcc201): HAL_RCC_OscConfig
    <11d4>   DW_AT_decl_file   : 7
    <11d5>   DW_AT_decl_line   : 4836
    <11d7>   DW_AT_decl_column : 19
    <11d8>   DW_AT_prototyped  : 1
    <11d8>   DW_AT_type        : <0xbef>
    <11dc>   DW_AT_declaration : 1
    <11dc>   DW_AT_sibling     : <0x11e6>
 <2><11e0>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <11e1>   DW_AT_type        : <0x11e6>
 <2><11e5>: Abbrev Number: 0
 <1><11e6>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <11e7>   DW_AT_byte_size   : 4
    <11e8>   DW_AT_type        : <0xd2c>
 <1><11ec>: Abbrev Number: 26 (DW_TAG_subprogram)
    <11ed>   DW_AT_external    : 1
    <11ed>   DW_AT_name        : (indirect string, offset: 0xcc19a): HAL_PWREx_ControlVoltageScaling
    <11f1>   DW_AT_decl_file   : 11
    <11f2>   DW_AT_decl_line   : 837
    <11f4>   DW_AT_decl_column : 19
    <11f5>   DW_AT_prototyped  : 1
    <11f5>   DW_AT_type        : <0xbef>
    <11f9>   DW_AT_declaration : 1
    <11f9>   DW_AT_sibling     : <0x1203>
 <2><11fd>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <11fe>   DW_AT_type        : <0x9a9>
 <2><1202>: Abbrev Number: 0
 <1><1203>: Abbrev Number: 27 (DW_TAG_subprogram)
    <1204>   DW_AT_external    : 1
    <1204>   DW_AT_name        : (indirect string, offset: 0xcbe8f): osKernelStart
    <1208>   DW_AT_decl_file   : 10
    <1209>   DW_AT_decl_line   : 302
    <120b>   DW_AT_decl_column : 12
    <120c>   DW_AT_prototyped  : 1
