Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xdc4 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xc342f): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x8961a): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x7861d): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/Assign1_Rieder_Nikolaus/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x1093f): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5c3dd): long long int

    <40>   DW_AT_encoding    : 4	(float)
    <41>   DW_AT_name        : (indirect string, offset: 0x12aca): long double
 <1><45>: Abbrev Number: 3 (DW_TAG_base_type)
    <46>   DW_AT_byte_size   : 1
    <47>   DW_AT_encoding    : 6	(signed char)
    <48>   DW_AT_name        : (indirect string, offset: 0x65687): signed char
 <1><4c>: Abbrev Number: 4 (DW_TAG_typedef)
    <4d>   DW_AT_name        : (indirect string, offset: 0x3a0a1): __uint8_t
    <51>   DW_AT_decl_file   : 2
    <52>   DW_AT_decl_line   : 43
    <53>   DW_AT_decl_column : 24
    <54>   DW_AT_type        : <0x58>
 <1><58>: Abbrev Number: 3 (DW_TAG_base_type)
    <59>   DW_AT_byte_size   : 1
    <5a>   DW_AT_encoding    : 8	(unsigned char)
    <5b>   DW_AT_name        : (indirect string, offset: 0xc214e): unsigned char
 <1><5f>: Abbrev Number: 3 (DW_TAG_base_type)
    <60>   DW_AT_byte_size   : 2
    <61>   DW_AT_encoding    : 5	(signed)
    <62>   DW_AT_name        : (indirect string, offset: 0x95e0d): short int
 <1><66>: Abbrev Number: 3 (DW_TAG_base_type)
    <67>   DW_AT_byte_size   : 2
    <68>   DW_AT_encoding    : 7	(unsigned)
    <69>   DW_AT_name        : (indirect string, offset: 0xc085b): short unsigned int
 <1><6d>: Abbrev Number: 3 (DW_TAG_base_type)
    <6e>   DW_AT_byte_size   : 4
    <6f>   DW_AT_encoding    : 5	(signed)
    <70>   DW_AT_name        : (indirect string, offset: 0x11351): long int
 <1><74>: Abbrev Number: 4 (DW_TAG_typedef)
    <75>   DW_AT_name        : (indirect string, offset: 0x80c7d): __uint32_t
    <79>   DW_AT_decl_file   : 2
    <7a>   DW_AT_decl_line   : 79
    <7b>   DW_AT_decl_column : 25
    <7c>   DW_AT_type        : <0x80>
 <1><80>: Abbrev Number: 3 (DW_TAG_base_type)
    <81>   DW_AT_byte_size   : 4
    <82>   DW_AT_encoding    : 7	(unsigned)
    <83>   DW_AT_name        : (indirect string, offset: 0x4d311): long unsigned int
 <1><87>: Abbrev Number: 3 (DW_TAG_base_type)
    <88>   DW_AT_byte_size   : 8
    <89>   DW_AT_encoding    : 7	(unsigned)
    <8a>   DW_AT_name        : (indirect string, offset: 0x29b33): long long unsigned int
 <1><8e>: Abbrev Number: 4 (DW_TAG_typedef)
    <8f>   DW_AT_name        : (indirect string, offset: 0x3a0a3): uint8_t
    <93>   DW_AT_decl_file   : 3
    <94>   DW_AT_decl_line   : 24
    <95>   DW_AT_decl_column : 19
    <96>   DW_AT_type        : <0x4c>
 <1><9a>: Abbrev Number: 4 (DW_TAG_typedef)
    <9b>   DW_AT_name        : (indirect string, offset: 0x924ab): uint32_t
    <9f>   DW_AT_decl_file   : 3
    <a0>   DW_AT_decl_line   : 48
    <a1>   DW_AT_decl_column : 20
    <a2>   DW_AT_type        : <0x74>
 <1><a6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a7>   DW_AT_byte_size   : 4
    <a8>   DW_AT_type        : <0xac>
 <1><ac>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <ad>   DW_AT_prototyped  : 1
    <ad>   DW_AT_sibling     : <0xb7>
 <2><b1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <b2>   DW_AT_type        : <0xb7>
 <2><b6>: Abbrev Number: 0
 <1><b7>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b8>   DW_AT_byte_size   : 4
 <1><b9>: Abbrev Number: 4 (DW_TAG_typedef)
    <ba>   DW_AT_name        : (indirect string, offset: 0xb8bb7): UBaseType_t
    <be>   DW_AT_decl_file   : 4
    <bf>   DW_AT_decl_line   : 57
    <c0>   DW_AT_decl_column : 23
    <c1>   DW_AT_type        : <0x80>
 <1><c5>: Abbrev Number: 4 (DW_TAG_typedef)
    <c6>   DW_AT_name        : (indirect string, offset: 0x6f2d9): TickType_t
    <ca>   DW_AT_decl_file   : 4
    <cb>   DW_AT_decl_line   : 63
    <cc>   DW_AT_decl_column : 19
    <cd>   DW_AT_type        : <0x9a>
 <1><d1>: Abbrev Number: 9 (DW_TAG_typedef)
    <d2>   DW_AT_name        : (indirect string, offset: 0x94388): wint_t
    <d6>   DW_AT_decl_file   : 5
    <d7>   DW_AT_decl_line   : 350
    <d9>   DW_AT_decl_column : 23
    <da>   DW_AT_type        : <0x30>
 <1><de>: Abbrev Number: 4 (DW_TAG_typedef)
    <df>   DW_AT_name        : (indirect string, offset: 0xcd7a8): _off_t
    <e3>   DW_AT_decl_file   : 6
    <e4>   DW_AT_decl_line   : 46
    <e5>   DW_AT_decl_column : 14
    <e6>   DW_AT_type        : <0x6d>
 <1><ea>: Abbrev Number: 4 (DW_TAG_typedef)
    <eb>   DW_AT_name        : (indirect string, offset: 0x2c441): _fpos_t
    <ef>   DW_AT_decl_file   : 6
    <f0>   DW_AT_decl_line   : 116
    <f1>   DW_AT_decl_column : 14
    <f2>   DW_AT_type        : <0x6d>
 <1><f6>: Abbrev Number: 10 (DW_TAG_union_type)
    <f7>   DW_AT_byte_size   : 4
    <f8>   DW_AT_decl_file   : 6
    <f9>   DW_AT_decl_line   : 165
    <fa>   DW_AT_decl_column : 3
    <fb>   DW_AT_sibling     : <0x118>
 <2><ff>: Abbrev Number: 11 (DW_TAG_member)
    <100>   DW_AT_name        : (indirect string, offset: 0x9a3d7): __wch
    <104>   DW_AT_decl_file   : 6
    <105>   DW_AT_decl_line   : 167
    <106>   DW_AT_decl_column : 12
    <107>   DW_AT_type        : <0xd1>
 <2><10b>: Abbrev Number: 11 (DW_TAG_member)
    <10c>   DW_AT_name        : (indirect string, offset: 0x6838c): __wchb
    <110>   DW_AT_decl_file   : 6
    <111>   DW_AT_decl_line   : 168
    <112>   DW_AT_decl_column : 19
    <113>   DW_AT_type        : <0x118>
 <2><117>: Abbrev Number: 0
 <1><118>: Abbrev Number: 12 (DW_TAG_array_type)
    <119>   DW_AT_type        : <0x58>
    <11d>   DW_AT_sibling     : <0x128>
 <2><121>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <122>   DW_AT_type        : <0x30>
    <126>   DW_AT_upper_bound : 3
 <2><127>: Abbrev Number: 0
 <1><128>: Abbrev Number: 14 (DW_TAG_structure_type)
    <129>   DW_AT_byte_size   : 8
    <12a>   DW_AT_decl_file   : 6
    <12b>   DW_AT_decl_line   : 162
    <12c>   DW_AT_decl_column : 9
    <12d>   DW_AT_sibling     : <0x14c>
 <2><131>: Abbrev Number: 15 (DW_TAG_member)
    <132>   DW_AT_name        : (indirect string, offset: 0x3836f): __count
    <136>   DW_AT_decl_file   : 6
    <137>   DW_AT_decl_line   : 164
    <138>   DW_AT_decl_column : 7
    <139>   DW_AT_type        : <0x29>
    <13d>   DW_AT_data_member_location: 0
 <2><13e>: Abbrev Number: 15 (DW_TAG_member)
    <13f>   DW_AT_name        : (indirect string, offset: 0x28d63): __value
    <143>   DW_AT_decl_file   : 6
    <144>   DW_AT_decl_line   : 169
    <145>   DW_AT_decl_column : 5
    <146>   DW_AT_type        : <0xf6>
    <14a>   DW_AT_data_member_location: 4
 <2><14b>: Abbrev Number: 0
 <1><14c>: Abbrev Number: 4 (DW_TAG_typedef)
    <14d>   DW_AT_name        : (indirect string, offset: 0x92d0f): _mbstate_t
    <151>   DW_AT_decl_file   : 6
    <152>   DW_AT_decl_line   : 170
    <153>   DW_AT_decl_column : 3
    <154>   DW_AT_type        : <0x128>
 <1><158>: Abbrev Number: 4 (DW_TAG_typedef)
    <159>   DW_AT_name        : (indirect string, offset: 0xb375a): __ULong
    <15d>   DW_AT_decl_file   : 7
    <15e>   DW_AT_decl_line   : 22
    <15f>   DW_AT_decl_column : 25
    <160>   DW_AT_type        : <0x80>
 <1><164>: Abbrev Number: 4 (DW_TAG_typedef)
    <165>   DW_AT_name        : (indirect string, offset: 0x6ed7b): _LOCK_T
    <169>   DW_AT_decl_file   : 8
    <16a>   DW_AT_decl_line   : 34
    <16b>   DW_AT_decl_column : 25
    <16c>   DW_AT_type        : <0x170>
 <1><170>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <171>   DW_AT_byte_size   : 4
    <172>   DW_AT_type        : <0x176>
 <1><176>: Abbrev Number: 16 (DW_TAG_structure_type)
    <177>   DW_AT_name        : (indirect string, offset: 0x194e3): __lock
    <17b>   DW_AT_declaration : 1
 <1><17b>: Abbrev Number: 4 (DW_TAG_typedef)
    <17c>   DW_AT_name        : (indirect string, offset: 0x63fdd): _flock_t
    <180>   DW_AT_decl_file   : 7
    <181>   DW_AT_decl_line   : 35
    <182>   DW_AT_decl_column : 27
    <183>   DW_AT_type        : <0x164>
 <1><187>: Abbrev Number: 17 (DW_TAG_structure_type)
    <188>   DW_AT_name        : (indirect string, offset: 0x45014): _Bigint
    <18c>   DW_AT_byte_size   : 24
    <18d>   DW_AT_decl_file   : 7
    <18e>   DW_AT_decl_line   : 52
    <18f>   DW_AT_decl_column : 8
    <190>   DW_AT_sibling     : <0x1e1>
 <2><194>: Abbrev Number: 15 (DW_TAG_member)
    <195>   DW_AT_name        : (indirect string, offset: 0x77d20): _next
    <199>   DW_AT_decl_file   : 7
    <19a>   DW_AT_decl_line   : 54
    <19b>   DW_AT_decl_column : 19
    <19c>   DW_AT_type        : <0x1e1>
    <1a0>   DW_AT_data_member_location: 0
 <2><1a1>: Abbrev Number: 18 (DW_TAG_member)
    <1a2>   DW_AT_name        : _k
    <1a5>   DW_AT_decl_file   : 7
    <1a6>   DW_AT_decl_line   : 55
    <1a7>   DW_AT_decl_column : 7
    <1a8>   DW_AT_type        : <0x29>
    <1ac>   DW_AT_data_member_location: 4
 <2><1ad>: Abbrev Number: 15 (DW_TAG_member)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x903b6): _maxwds
    <1b2>   DW_AT_decl_file   : 7
    <1b3>   DW_AT_decl_line   : 55
    <1b4>   DW_AT_decl_column : 11
    <1b5>   DW_AT_type        : <0x29>
    <1b9>   DW_AT_data_member_location: 8
 <2><1ba>: Abbrev Number: 15 (DW_TAG_member)
    <1bb>   DW_AT_name        : (indirect string, offset: 0x6ba69): _sign
    <1bf>   DW_AT_decl_file   : 7
    <1c0>   DW_AT_decl_line   : 55
    <1c1>   DW_AT_decl_column : 20
    <1c2>   DW_AT_type        : <0x29>
    <1c6>   DW_AT_data_member_location: 12
 <2><1c7>: Abbrev Number: 15 (DW_TAG_member)
    <1c8>   DW_AT_name        : (indirect string, offset: 0x6b726): _wds
    <1cc>   DW_AT_decl_file   : 7
    <1cd>   DW_AT_decl_line   : 55
    <1ce>   DW_AT_decl_column : 27
    <1cf>   DW_AT_type        : <0x29>
    <1d3>   DW_AT_data_member_location: 16
 <2><1d4>: Abbrev Number: 18 (DW_TAG_member)
    <1d5>   DW_AT_name        : _x
    <1d8>   DW_AT_decl_file   : 7
    <1d9>   DW_AT_decl_line   : 56
    <1da>   DW_AT_decl_column : 11
    <1db>   DW_AT_type        : <0x1e7>
    <1df>   DW_AT_data_member_location: 20
 <2><1e0>: Abbrev Number: 0
 <1><1e1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1e2>   DW_AT_byte_size   : 4
    <1e3>   DW_AT_type        : <0x187>
 <1><1e7>: Abbrev Number: 12 (DW_TAG_array_type)
    <1e8>   DW_AT_type        : <0x158>
    <1ec>   DW_AT_sibling     : <0x1f7>
 <2><1f0>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <1f1>   DW_AT_type        : <0x30>
    <1f5>   DW_AT_upper_bound : 0
 <2><1f6>: Abbrev Number: 0
 <1><1f7>: Abbrev Number: 17 (DW_TAG_structure_type)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x36df6): __tm
    <1fc>   DW_AT_byte_size   : 36
    <1fd>   DW_AT_decl_file   : 7
    <1fe>   DW_AT_decl_line   : 60
    <1ff>   DW_AT_decl_column : 8
    <200>   DW_AT_sibling     : <0x27a>
 <2><204>: Abbrev Number: 15 (DW_TAG_member)
    <205>   DW_AT_name        : (indirect string, offset: 0xa4bb6): __tm_sec
    <209>   DW_AT_decl_file   : 7
    <20a>   DW_AT_decl_line   : 62
    <20b>   DW_AT_decl_column : 9
    <20c>   DW_AT_type        : <0x29>
    <210>   DW_AT_data_member_location: 0
 <2><211>: Abbrev Number: 15 (DW_TAG_member)
    <212>   DW_AT_name        : (indirect string, offset: 0xd6d): __tm_min
    <216>   DW_AT_decl_file   : 7
    <217>   DW_AT_decl_line   : 63
    <218>   DW_AT_decl_column : 9
    <219>   DW_AT_type        : <0x29>
    <21d>   DW_AT_data_member_location: 4
 <2><21e>: Abbrev Number: 15 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x2a986): __tm_hour
    <223>   DW_AT_decl_file   : 7
    <224>   DW_AT_decl_line   : 64
    <225>   DW_AT_decl_column : 9
    <226>   DW_AT_type        : <0x29>
    <22a>   DW_AT_data_member_location: 8
 <2><22b>: Abbrev Number: 15 (DW_TAG_member)
    <22c>   DW_AT_name        : (indirect string, offset: 0x75ffa): __tm_mday
    <230>   DW_AT_decl_file   : 7
    <231>   DW_AT_decl_line   : 65
    <232>   DW_AT_decl_column : 9
    <233>   DW_AT_type        : <0x29>
    <237>   DW_AT_data_member_location: 12
 <2><238>: Abbrev Number: 15 (DW_TAG_member)
    <239>   DW_AT_name        : (indirect string, offset: 0x37d4): __tm_mon
    <23d>   DW_AT_decl_file   : 7
    <23e>   DW_AT_decl_line   : 66
    <23f>   DW_AT_decl_column : 9
    <240>   DW_AT_type        : <0x29>
    <244>   DW_AT_data_member_location: 16
 <2><245>: Abbrev Number: 15 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x78af1): __tm_year
    <24a>   DW_AT_decl_file   : 7
    <24b>   DW_AT_decl_line   : 67
    <24c>   DW_AT_decl_column : 9
    <24d>   DW_AT_type        : <0x29>
    <251>   DW_AT_data_member_location: 20
 <2><252>: Abbrev Number: 15 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x5535b): __tm_wday
    <257>   DW_AT_decl_file   : 7
    <258>   DW_AT_decl_line   : 68
    <259>   DW_AT_decl_column : 9
    <25a>   DW_AT_type        : <0x29>
    <25e>   DW_AT_data_member_location: 24
 <2><25f>: Abbrev Number: 15 (DW_TAG_member)
    <260>   DW_AT_name        : (indirect string, offset: 0x4ed54): __tm_yday
    <264>   DW_AT_decl_file   : 7
    <265>   DW_AT_decl_line   : 69
    <266>   DW_AT_decl_column : 9
    <267>   DW_AT_type        : <0x29>
    <26b>   DW_AT_data_member_location: 28
 <2><26c>: Abbrev Number: 15 (DW_TAG_member)
    <26d>   DW_AT_name        : (indirect string, offset: 0xb4b6a): __tm_isdst
    <271>   DW_AT_decl_file   : 7
    <272>   DW_AT_decl_line   : 70
    <273>   DW_AT_decl_column : 9
    <274>   DW_AT_type        : <0x29>
    <278>   DW_AT_data_member_location: 32
 <2><279>: Abbrev Number: 0
 <1><27a>: Abbrev Number: 17 (DW_TAG_structure_type)
    <27b>   DW_AT_name        : (indirect string, offset: 0x872a3): __sbuf
    <27f>   DW_AT_byte_size   : 8
    <280>   DW_AT_decl_file   : 7
    <281>   DW_AT_decl_line   : 122
    <282>   DW_AT_decl_column : 8
    <283>   DW_AT_sibling     : <0x2a2>
 <2><287>: Abbrev Number: 15 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0x43033): _base
    <28c>   DW_AT_decl_file   : 7
    <28d>   DW_AT_decl_line   : 123
    <28e>   DW_AT_decl_column : 17
    <28f>   DW_AT_type        : <0x2a2>
    <293>   DW_AT_data_member_location: 0
 <2><294>: Abbrev Number: 15 (DW_TAG_member)
    <295>   DW_AT_name        : (indirect string, offset: 0xbe37d): _size
    <299>   DW_AT_decl_file   : 7
    <29a>   DW_AT_decl_line   : 124
    <29b>   DW_AT_decl_column : 6
    <29c>   DW_AT_type        : <0x29>
    <2a0>   DW_AT_data_member_location: 4
 <2><2a1>: Abbrev Number: 0
 <1><2a2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <2a3>   DW_AT_byte_size   : 4
    <2a4>   DW_AT_type        : <0x58>
 <1><2a8>: Abbrev Number: 19 (DW_TAG_structure_type)
    <2a9>   DW_AT_name        : (indirect string, offset: 0xd6827): _reent
    <2ad>   DW_AT_byte_size   : 96
    <2ae>   DW_AT_decl_file   : 7
    <2af>   DW_AT_decl_line   : 377
    <2b1>   DW_AT_decl_column : 8
    <2b2>   DW_AT_sibling     : <0x3eb>
 <2><2b6>: Abbrev Number: 20 (DW_TAG_member)
    <2b7>   DW_AT_name        : (indirect string, offset: 0xcd45b): _errno
    <2bb>   DW_AT_decl_file   : 7
    <2bc>   DW_AT_decl_line   : 381
    <2be>   DW_AT_decl_column : 7
    <2bf>   DW_AT_type        : <0x29>
    <2c3>   DW_AT_data_member_location: 0
 <2><2c4>: Abbrev Number: 20 (DW_TAG_member)
    <2c5>   DW_AT_name        : (indirect string, offset: 0xd5db9): _stdin
    <2c9>   DW_AT_decl_file   : 7
    <2ca>   DW_AT_decl_line   : 386
    <2cc>   DW_AT_decl_column : 11
    <2cd>   DW_AT_type        : <0x63e>
    <2d1>   DW_AT_data_member_location: 4
 <2><2d2>: Abbrev Number: 20 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0xd6756): _stdout
    <2d7>   DW_AT_decl_file   : 7
    <2d8>   DW_AT_decl_line   : 386
    <2da>   DW_AT_decl_column : 20
    <2db>   DW_AT_type        : <0x63e>
    <2df>   DW_AT_data_member_location: 8
 <2><2e0>: Abbrev Number: 20 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0xd66ff): _stderr
    <2e5>   DW_AT_decl_file   : 7
    <2e6>   DW_AT_decl_line   : 386
    <2e8>   DW_AT_decl_column : 30
    <2e9>   DW_AT_type        : <0x63e>
    <2ed>   DW_AT_data_member_location: 12
 <2><2ee>: Abbrev Number: 20 (DW_TAG_member)
    <2ef>   DW_AT_name        : (indirect string, offset: 0x800ff): _inc
    <2f3>   DW_AT_decl_file   : 7
    <2f4>   DW_AT_decl_line   : 388
    <2f6>   DW_AT_decl_column : 8
    <2f7>   DW_AT_type        : <0x29>
    <2fb>   DW_AT_data_member_location: 16
 <2><2fc>: Abbrev Number: 20 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0x9eedf): _emergency
    <301>   DW_AT_decl_file   : 7
    <302>   DW_AT_decl_line   : 390
    <304>   DW_AT_decl_column : 9
    <305>   DW_AT_type        : <0x552>
    <309>   DW_AT_data_member_location: 20
 <2><30a>: Abbrev Number: 20 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x25f9b): __sdidinit
    <30f>   DW_AT_decl_file   : 7
    <310>   DW_AT_decl_line   : 392
    <312>   DW_AT_decl_column : 7
    <313>   DW_AT_type        : <0x29>
    <317>   DW_AT_data_member_location: 24
 <2><318>: Abbrev Number: 20 (DW_TAG_member)
    <319>   DW_AT_name        : (indirect string, offset: 0x121ed): _unspecified_locale_info
    <31d>   DW_AT_decl_file   : 7
    <31e>   DW_AT_decl_line   : 394
    <320>   DW_AT_decl_column : 7
    <321>   DW_AT_type        : <0x29>
    <325>   DW_AT_data_member_location: 28
 <2><326>: Abbrev Number: 20 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0xb1e72): _locale
    <32b>   DW_AT_decl_file   : 7
    <32c>   DW_AT_decl_line   : 395
    <32e>   DW_AT_decl_column : 22
    <32f>   DW_AT_type        : <0x7a6>
    <333>   DW_AT_data_member_location: 32
 <2><334>: Abbrev Number: 21 (DW_TAG_member)
    <335>   DW_AT_name        : _mp
    <339>   DW_AT_decl_file   : 7
    <33a>   DW_AT_decl_line   : 397
    <33c>   DW_AT_decl_column : 18
    <33d>   DW_AT_type        : <0x7ac>
    <341>   DW_AT_data_member_location: 36
 <2><342>: Abbrev Number: 20 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0x1f00c): __cleanup
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 399
    <34a>   DW_AT_decl_column : 10
    <34b>   DW_AT_type        : <0x7bd>
    <34f>   DW_AT_data_member_location: 40
 <2><350>: Abbrev Number: 20 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x7c86f): _gamma_signgam
    <355>   DW_AT_decl_file   : 7
    <356>   DW_AT_decl_line   : 401
    <358>   DW_AT_decl_column : 7
    <359>   DW_AT_type        : <0x29>
    <35d>   DW_AT_data_member_location: 44
 <2><35e>: Abbrev Number: 20 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0xa13ad): _cvtlen
    <363>   DW_AT_decl_file   : 7
    <364>   DW_AT_decl_line   : 404
    <366>   DW_AT_decl_column : 7
    <367>   DW_AT_type        : <0x29>
    <36b>   DW_AT_data_member_location: 48
 <2><36c>: Abbrev Number: 20 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0x5d6c0): _cvtbuf
    <371>   DW_AT_decl_file   : 7
    <372>   DW_AT_decl_line   : 405
    <374>   DW_AT_decl_column : 9
    <375>   DW_AT_type        : <0x552>
    <379>   DW_AT_data_member_location: 52
 <2><37a>: Abbrev Number: 20 (DW_TAG_member)
    <37b>   DW_AT_name        : (indirect string, offset: 0x96663): _r48
    <37f>   DW_AT_decl_file   : 7
    <380>   DW_AT_decl_line   : 407
    <382>   DW_AT_decl_column : 19
    <383>   DW_AT_type        : <0x7c3>
    <387>   DW_AT_data_member_location: 56
 <2><388>: Abbrev Number: 20 (DW_TAG_member)
    <389>   DW_AT_name        : (indirect string, offset: 0xa716c): _localtime_buf
    <38d>   DW_AT_decl_file   : 7
    <38e>   DW_AT_decl_line   : 408
    <390>   DW_AT_decl_column : 16
    <391>   DW_AT_type        : <0x7c9>
    <395>   DW_AT_data_member_location: 60
 <2><396>: Abbrev Number: 20 (DW_TAG_member)
    <397>   DW_AT_name        : (indirect string, offset: 0x2c68b): _asctime_buf
    <39b>   DW_AT_decl_file   : 7
    <39c>   DW_AT_decl_line   : 409
    <39e>   DW_AT_decl_column : 9
    <39f>   DW_AT_type        : <0x552>
    <3a3>   DW_AT_data_member_location: 64
 <2><3a4>: Abbrev Number: 20 (DW_TAG_member)
    <3a5>   DW_AT_name        : (indirect string, offset: 0xa50a8): _sig_func
    <3a9>   DW_AT_decl_file   : 7
    <3aa>   DW_AT_decl_line   : 412
    <3ac>   DW_AT_decl_column : 12
    <3ad>   DW_AT_type        : <0x7da>
    <3b1>   DW_AT_data_member_location: 68
 <2><3b2>: Abbrev Number: 20 (DW_TAG_member)
    <3b3>   DW_AT_name        : (indirect string, offset: 0x90239): __sglue
    <3b7>   DW_AT_decl_file   : 7
    <3b8>   DW_AT_decl_line   : 420
    <3ba>   DW_AT_decl_column : 16
    <3bb>   DW_AT_type        : <0x5ff>
    <3bf>   DW_AT_data_member_location: 72
 <2><3c0>: Abbrev Number: 20 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x36762): __sf
    <3c5>   DW_AT_decl_file   : 7
    <3c6>   DW_AT_decl_line   : 421
    <3c8>   DW_AT_decl_column : 11
    <3c9>   DW_AT_type        : <0x63e>
    <3cd>   DW_AT_data_member_location: 84
 <2><3ce>: Abbrev Number: 20 (DW_TAG_member)
    <3cf>   DW_AT_name        : (indirect string, offset: 0x5b82e): _misc
    <3d3>   DW_AT_decl_file   : 7
    <3d4>   DW_AT_decl_line   : 422
    <3d6>   DW_AT_decl_column : 23
    <3d7>   DW_AT_type        : <0x7e6>
    <3db>   DW_AT_data_member_location: 88
 <2><3dc>: Abbrev Number: 20 (DW_TAG_member)
    <3dd>   DW_AT_name        : (indirect string, offset: 0x7df9c): _signal_buf
    <3e1>   DW_AT_decl_file   : 7
    <3e2>   DW_AT_decl_line   : 423
    <3e4>   DW_AT_decl_column : 9
    <3e5>   DW_AT_type        : <0x552>
    <3e9>   DW_AT_data_member_location: 92
 <2><3ea>: Abbrev Number: 0
 <1><3eb>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <3ec>   DW_AT_byte_size   : 4
    <3ed>   DW_AT_type        : <0x2a8>
 <1><3f1>: Abbrev Number: 17 (DW_TAG_structure_type)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x9a023): __sFILE
    <3f6>   DW_AT_byte_size   : 104
    <3f7>   DW_AT_decl_file   : 7
    <3f8>   DW_AT_decl_line   : 186
    <3f9>   DW_AT_decl_column : 8
    <3fa>   DW_AT_sibling     : <0x534>
 <2><3fe>: Abbrev Number: 18 (DW_TAG_member)
    <3ff>   DW_AT_name        : _p
    <402>   DW_AT_decl_file   : 7
    <403>   DW_AT_decl_line   : 187
    <404>   DW_AT_decl_column : 18
    <405>   DW_AT_type        : <0x2a2>
    <409>   DW_AT_data_member_location: 0
 <2><40a>: Abbrev Number: 18 (DW_TAG_member)
    <40b>   DW_AT_name        : _r
    <40e>   DW_AT_decl_file   : 7
    <40f>   DW_AT_decl_line   : 188
    <410>   DW_AT_decl_column : 7
    <411>   DW_AT_type        : <0x29>
    <415>   DW_AT_data_member_location: 4
 <2><416>: Abbrev Number: 18 (DW_TAG_member)
    <417>   DW_AT_name        : _w
    <41a>   DW_AT_decl_file   : 7
    <41b>   DW_AT_decl_line   : 189
    <41c>   DW_AT_decl_column : 7
    <41d>   DW_AT_type        : <0x29>
    <421>   DW_AT_data_member_location: 8
 <2><422>: Abbrev Number: 15 (DW_TAG_member)
    <423>   DW_AT_name        : (indirect string, offset: 0x5c4c6): _flags
    <427>   DW_AT_decl_file   : 7
    <428>   DW_AT_decl_line   : 190
    <429>   DW_AT_decl_column : 9
    <42a>   DW_AT_type        : <0x5f>
    <42e>   DW_AT_data_member_location: 12
 <2><42f>: Abbrev Number: 15 (DW_TAG_member)
    <430>   DW_AT_name        : (indirect string, offset: 0x1557c): _file
    <434>   DW_AT_decl_file   : 7
    <435>   DW_AT_decl_line   : 191
    <436>   DW_AT_decl_column : 9
    <437>   DW_AT_type        : <0x5f>
    <43b>   DW_AT_data_member_location: 14
 <2><43c>: Abbrev Number: 18 (DW_TAG_member)
    <43d>   DW_AT_name        : _bf
    <441>   DW_AT_decl_file   : 7
    <442>   DW_AT_decl_line   : 192
    <443>   DW_AT_decl_column : 17
    <444>   DW_AT_type        : <0x27a>
    <448>   DW_AT_data_member_location: 16
 <2><449>: Abbrev Number: 15 (DW_TAG_member)
    <44a>   DW_AT_name        : (indirect string, offset: 0x5cab3): _lbfsize
    <44e>   DW_AT_decl_file   : 7
    <44f>   DW_AT_decl_line   : 193
    <450>   DW_AT_decl_column : 7
    <451>   DW_AT_type        : <0x29>
    <455>   DW_AT_data_member_location: 24
 <2><456>: Abbrev Number: 15 (DW_TAG_member)
    <457>   DW_AT_name        : (indirect string, offset: 0xd1e7b): _data
    <45b>   DW_AT_decl_file   : 7
    <45c>   DW_AT_decl_line   : 196
    <45d>   DW_AT_decl_column : 18
    <45e>   DW_AT_type        : <0x3eb>
    <462>   DW_AT_data_member_location: 28
 <2><463>: Abbrev Number: 15 (DW_TAG_member)
    <464>   DW_AT_name        : (indirect string, offset: 0xb2e70): _cookie
    <468>   DW_AT_decl_file   : 7
    <469>   DW_AT_decl_line   : 200
    <46a>   DW_AT_decl_column : 10
    <46b>   DW_AT_type        : <0xb7>
    <46f>   DW_AT_data_member_location: 32
 <2><470>: Abbrev Number: 15 (DW_TAG_member)
    <471>   DW_AT_name        : (indirect string, offset: 0x9eb8a): _read
    <475>   DW_AT_decl_file   : 7
    <476>   DW_AT_decl_line   : 202
    <477>   DW_AT_decl_column : 29
    <478>   DW_AT_type        : <0x564>
    <47c>   DW_AT_data_member_location: 36
 <2><47d>: Abbrev Number: 15 (DW_TAG_member)
    <47e>   DW_AT_name        : (indirect string, offset: 0x19541): _write
    <482>   DW_AT_decl_file   : 7
    <483>   DW_AT_decl_line   : 204
    <484>   DW_AT_decl_column : 29
    <485>   DW_AT_type        : <0x58e>
    <489>   DW_AT_data_member_location: 40
 <2><48a>: Abbrev Number: 15 (DW_TAG_member)
    <48b>   DW_AT_name        : (indirect string, offset: 0x3a367): _seek
    <48f>   DW_AT_decl_file   : 7
    <490>   DW_AT_decl_line   : 207
    <491>   DW_AT_decl_column : 13
    <492>   DW_AT_type        : <0x5b2>
    <496>   DW_AT_data_member_location: 44
 <2><497>: Abbrev Number: 15 (DW_TAG_member)
    <498>   DW_AT_name        : (indirect string, offset: 0x589ac): _close
    <49c>   DW_AT_decl_file   : 7
    <49d>   DW_AT_decl_line   : 208
    <49e>   DW_AT_decl_column : 9
    <49f>   DW_AT_type        : <0x5cc>
    <4a3>   DW_AT_data_member_location: 48
 <2><4a4>: Abbrev Number: 18 (DW_TAG_member)
    <4a5>   DW_AT_name        : _ub
    <4a9>   DW_AT_decl_file   : 7
    <4aa>   DW_AT_decl_line   : 211
    <4ab>   DW_AT_decl_column : 17
    <4ac>   DW_AT_type        : <0x27a>
    <4b0>   DW_AT_data_member_location: 52
 <2><4b1>: Abbrev Number: 18 (DW_TAG_member)
    <4b2>   DW_AT_name        : _up
    <4b6>   DW_AT_decl_file   : 7
    <4b7>   DW_AT_decl_line   : 212
    <4b8>   DW_AT_decl_column : 18
    <4b9>   DW_AT_type        : <0x2a2>
    <4bd>   DW_AT_data_member_location: 60
 <2><4be>: Abbrev Number: 18 (DW_TAG_member)
    <4bf>   DW_AT_name        : _ur
    <4c3>   DW_AT_decl_file   : 7
    <4c4>   DW_AT_decl_line   : 213
    <4c5>   DW_AT_decl_column : 7
    <4c6>   DW_AT_type        : <0x29>
    <4ca>   DW_AT_data_member_location: 64
 <2><4cb>: Abbrev Number: 15 (DW_TAG_member)
    <4cc>   DW_AT_name        : (indirect string, offset: 0xc330f): _ubuf
    <4d0>   DW_AT_decl_file   : 7
    <4d1>   DW_AT_decl_line   : 216
    <4d2>   DW_AT_decl_column : 17
    <4d3>   DW_AT_type        : <0x5d2>
    <4d7>   DW_AT_data_member_location: 68
 <2><4d8>: Abbrev Number: 15 (DW_TAG_member)
    <4d9>   DW_AT_name        : (indirect string, offset: 0x89902): _nbuf
    <4dd>   DW_AT_decl_file   : 7
    <4de>   DW_AT_decl_line   : 217
    <4df>   DW_AT_decl_column : 17
    <4e0>   DW_AT_type        : <0x5e2>
    <4e4>   DW_AT_data_member_location: 71
 <2><4e5>: Abbrev Number: 18 (DW_TAG_member)
    <4e6>   DW_AT_name        : _lb
    <4ea>   DW_AT_decl_file   : 7
    <4eb>   DW_AT_decl_line   : 220
    <4ec>   DW_AT_decl_column : 17
    <4ed>   DW_AT_type        : <0x27a>
    <4f1>   DW_AT_data_member_location: 72
 <2><4f2>: Abbrev Number: 15 (DW_TAG_member)
    <4f3>   DW_AT_name        : (indirect string, offset: 0xccfe5): _blksize
    <4f7>   DW_AT_decl_file   : 7
    <4f8>   DW_AT_decl_line   : 223
    <4f9>   DW_AT_decl_column : 7
    <4fa>   DW_AT_type        : <0x29>
    <4fe>   DW_AT_data_member_location: 80
 <2><4ff>: Abbrev Number: 15 (DW_TAG_member)
    <500>   DW_AT_name        : (indirect string, offset: 0x40684): _offset
    <504>   DW_AT_decl_file   : 7
    <505>   DW_AT_decl_line   : 224
    <506>   DW_AT_decl_column : 10
    <507>   DW_AT_type        : <0xde>
    <50b>   DW_AT_data_member_location: 84
 <2><50c>: Abbrev Number: 15 (DW_TAG_member)
    <50d>   DW_AT_name        : (indirect string, offset: 0x194e4): _lock
    <511>   DW_AT_decl_file   : 7
    <512>   DW_AT_decl_line   : 231
    <513>   DW_AT_decl_column : 12
    <514>   DW_AT_type        : <0x17b>
    <518>   DW_AT_data_member_location: 88
 <2><519>: Abbrev Number: 15 (DW_TAG_member)
    <51a>   DW_AT_name        : (indirect string, offset: 0x174f9): _mbstate
    <51e>   DW_AT_decl_file   : 7
    <51f>   DW_AT_decl_line   : 233
    <520>   DW_AT_decl_column : 14
    <521>   DW_AT_type        : <0x14c>
    <525>   DW_AT_data_member_location: 92
 <2><526>: Abbrev Number: 15 (DW_TAG_member)
    <527>   DW_AT_name        : (indirect string, offset: 0xb810d): _flags2
    <52b>   DW_AT_decl_file   : 7
    <52c>   DW_AT_decl_line   : 234
    <52d>   DW_AT_decl_column : 9
    <52e>   DW_AT_type        : <0x29>
    <532>   DW_AT_data_member_location: 100
 <2><533>: Abbrev Number: 0
 <1><534>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <535>   DW_AT_prototyped  : 1
    <535>   DW_AT_type        : <0x29>
    <539>   DW_AT_sibling     : <0x552>
 <2><53d>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <53e>   DW_AT_type        : <0x3eb>
 <2><542>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <543>   DW_AT_type        : <0xb7>
 <2><547>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <548>   DW_AT_type        : <0x552>
 <2><54c>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <54d>   DW_AT_type        : <0x29>
 <2><551>: Abbrev Number: 0
 <1><552>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <553>   DW_AT_byte_size   : 4
    <554>   DW_AT_type        : <0x558>
 <1><558>: Abbrev Number: 3 (DW_TAG_base_type)
    <559>   DW_AT_byte_size   : 1
    <55a>   DW_AT_encoding    : 8	(unsigned char)
    <55b>   DW_AT_name        : (indirect string, offset: 0x40bc1): char
 <1><55f>: Abbrev Number: 23 (DW_TAG_const_type)
    <560>   DW_AT_type        : <0x558>
 <1><564>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <565>   DW_AT_byte_size   : 4
    <566>   DW_AT_type        : <0x534>
 <1><56a>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <56b>   DW_AT_prototyped  : 1
    <56b>   DW_AT_type        : <0x29>
    <56f>   DW_AT_sibling     : <0x588>
 <2><573>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <574>   DW_AT_type        : <0x3eb>
 <2><578>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <579>   DW_AT_type        : <0xb7>
 <2><57d>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <57e>   DW_AT_type        : <0x588>
 <2><582>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <583>   DW_AT_type        : <0x29>
 <2><587>: Abbrev Number: 0
 <1><588>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <589>   DW_AT_byte_size   : 4
    <58a>   DW_AT_type        : <0x55f>
 <1><58e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <58f>   DW_AT_byte_size   : 4
    <590>   DW_AT_type        : <0x56a>
 <1><594>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <595>   DW_AT_prototyped  : 1
    <595>   DW_AT_type        : <0xea>
    <599>   DW_AT_sibling     : <0x5b2>
 <2><59d>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <59e>   DW_AT_type        : <0x3eb>
 <2><5a2>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <5a3>   DW_AT_type        : <0xb7>
 <2><5a7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <5a8>   DW_AT_type        : <0xea>
 <2><5ac>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <5ad>   DW_AT_type        : <0x29>
 <2><5b1>: Abbrev Number: 0
 <1><5b2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <5b3>   DW_AT_byte_size   : 4
    <5b4>   DW_AT_type        : <0x594>
 <1><5b8>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <5b9>   DW_AT_prototyped  : 1
    <5b9>   DW_AT_type        : <0x29>
    <5bd>   DW_AT_sibling     : <0x5cc>
 <2><5c1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <5c2>   DW_AT_type        : <0x3eb>
 <2><5c6>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <5c7>   DW_AT_type        : <0xb7>
 <2><5cb>: Abbrev Number: 0
 <1><5cc>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <5cd>   DW_AT_byte_size   : 4
    <5ce>   DW_AT_type        : <0x5b8>
 <1><5d2>: Abbrev Number: 12 (DW_TAG_array_type)
    <5d3>   DW_AT_type        : <0x58>
    <5d7>   DW_AT_sibling     : <0x5e2>
 <2><5db>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <5dc>   DW_AT_type        : <0x30>
    <5e0>   DW_AT_upper_bound : 2
 <2><5e1>: Abbrev Number: 0
 <1><5e2>: Abbrev Number: 12 (DW_TAG_array_type)
    <5e3>   DW_AT_type        : <0x58>
    <5e7>   DW_AT_sibling     : <0x5f2>
 <2><5eb>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <5ec>   DW_AT_type        : <0x30>
    <5f0>   DW_AT_upper_bound : 0
 <2><5f1>: Abbrev Number: 0
 <1><5f2>: Abbrev Number: 9 (DW_TAG_typedef)
    <5f3>   DW_AT_name        : (indirect string, offset: 0xa10ac): __FILE
    <5f7>   DW_AT_decl_file   : 7
    <5f8>   DW_AT_decl_line   : 292
    <5fa>   DW_AT_decl_column : 26
    <5fb>   DW_AT_type        : <0x3f1>
 <1><5ff>: Abbrev Number: 19 (DW_TAG_structure_type)
    <600>   DW_AT_name        : (indirect string, offset: 0xac7f9): _glue
    <604>   DW_AT_byte_size   : 12
    <605>   DW_AT_decl_file   : 7
    <606>   DW_AT_decl_line   : 296
    <608>   DW_AT_decl_column : 8
    <609>   DW_AT_sibling     : <0x638>
 <2><60d>: Abbrev Number: 20 (DW_TAG_member)
    <60e>   DW_AT_name        : (indirect string, offset: 0x77d20): _next
    <612>   DW_AT_decl_file   : 7
    <613>   DW_AT_decl_line   : 298
    <615>   DW_AT_decl_column : 17
    <616>   DW_AT_type        : <0x638>
    <61a>   DW_AT_data_member_location: 0
 <2><61b>: Abbrev Number: 20 (DW_TAG_member)
    <61c>   DW_AT_name        : (indirect string, offset: 0x4ba25): _niobs
    <620>   DW_AT_decl_file   : 7
    <621>   DW_AT_decl_line   : 299
    <623>   DW_AT_decl_column : 7
    <624>   DW_AT_type        : <0x29>
    <628>   DW_AT_data_member_location: 4
 <2><629>: Abbrev Number: 20 (DW_TAG_member)
    <62a>   DW_AT_name        : (indirect string, offset: 0x665d6): _iobs
    <62e>   DW_AT_decl_file   : 7
    <62f>   DW_AT_decl_line   : 300
    <631>   DW_AT_decl_column : 11
    <632>   DW_AT_type        : <0x63e>
    <636>   DW_AT_data_member_location: 8
 <2><637>: Abbrev Number: 0
 <1><638>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <639>   DW_AT_byte_size   : 4
    <63a>   DW_AT_type        : <0x5ff>
 <1><63e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <63f>   DW_AT_byte_size   : 4
    <640>   DW_AT_type        : <0x5f2>
 <1><644>: Abbrev Number: 19 (DW_TAG_structure_type)
    <645>   DW_AT_name        : (indirect string, offset: 0x45fa6): _rand48
    <649>   DW_AT_byte_size   : 24
    <64a>   DW_AT_decl_file   : 7
    <64b>   DW_AT_decl_line   : 324
    <64d>   DW_AT_decl_column : 8
    <64e>   DW_AT_sibling     : <0x68b>
 <2><652>: Abbrev Number: 20 (DW_TAG_member)
    <653>   DW_AT_name        : (indirect string, offset: 0xc56e1): _seed
    <657>   DW_AT_decl_file   : 7
    <658>   DW_AT_decl_line   : 325
    <65a>   DW_AT_decl_column : 18
    <65b>   DW_AT_type        : <0x68b>
    <65f>   DW_AT_data_member_location: 0
 <2><660>: Abbrev Number: 20 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0xb7ac6): _mult
    <665>   DW_AT_decl_file   : 7
    <666>   DW_AT_decl_line   : 326
    <668>   DW_AT_decl_column : 18
    <669>   DW_AT_type        : <0x68b>
    <66d>   DW_AT_data_member_location: 6
 <2><66e>: Abbrev Number: 20 (DW_TAG_member)
    <66f>   DW_AT_name        : (indirect string, offset: 0x6843b): _add
    <673>   DW_AT_decl_file   : 7
    <674>   DW_AT_decl_line   : 327
    <676>   DW_AT_decl_column : 18
    <677>   DW_AT_type        : <0x66>
    <67b>   DW_AT_data_member_location: 12
 <2><67c>: Abbrev Number: 20 (DW_TAG_member)
    <67d>   DW_AT_name        : (indirect string, offset: 0x77d1b): _rand_next
    <681>   DW_AT_decl_file   : 7
    <682>   DW_AT_decl_line   : 330
    <684>   DW_AT_decl_column : 36
    <685>   DW_AT_type        : <0x87>
    <689>   DW_AT_data_member_location: 16
 <2><68a>: Abbrev Number: 0
 <1><68b>: Abbrev Number: 12 (DW_TAG_array_type)
    <68c>   DW_AT_type        : <0x66>
    <690>   DW_AT_sibling     : <0x69b>
 <2><694>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <695>   DW_AT_type        : <0x30>
    <699>   DW_AT_upper_bound : 2
 <2><69a>: Abbrev Number: 0
 <1><69b>: Abbrev Number: 19 (DW_TAG_structure_type)
    <69c>   DW_AT_name        : (indirect string, offset: 0x990ed): _mprec
    <6a0>   DW_AT_byte_size   : 16
    <6a1>   DW_AT_decl_file   : 7
    <6a2>   DW_AT_decl_line   : 349
    <6a4>   DW_AT_decl_column : 8
    <6a5>   DW_AT_sibling     : <0x6e2>
 <2><6a9>: Abbrev Number: 20 (DW_TAG_member)
    <6aa>   DW_AT_name        : (indirect string, offset: 0xc86ea): _result
    <6ae>   DW_AT_decl_file   : 7
    <6af>   DW_AT_decl_line   : 352
    <6b1>   DW_AT_decl_column : 19
    <6b2>   DW_AT_type        : <0x1e1>
    <6b6>   DW_AT_data_member_location: 0
 <2><6b7>: Abbrev Number: 20 (DW_TAG_member)
    <6b8>   DW_AT_name        : (indirect string, offset: 0x7dfdd): _result_k
    <6bc>   DW_AT_decl_file   : 7
    <6bd>   DW_AT_decl_line   : 353
    <6bf>   DW_AT_decl_column : 7
    <6c0>   DW_AT_type        : <0x29>
    <6c4>   DW_AT_data_member_location: 4
 <2><6c5>: Abbrev Number: 20 (DW_TAG_member)
    <6c6>   DW_AT_name        : (indirect string, offset: 0x60443): _p5s
    <6ca>   DW_AT_decl_file   : 7
    <6cb>   DW_AT_decl_line   : 354
    <6cd>   DW_AT_decl_column : 19
    <6ce>   DW_AT_type        : <0x1e1>
    <6d2>   DW_AT_data_member_location: 8
 <2><6d3>: Abbrev Number: 20 (DW_TAG_member)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x74940): _freelist
    <6d8>   DW_AT_decl_file   : 7
    <6d9>   DW_AT_decl_line   : 355
    <6db>   DW_AT_decl_column : 20
    <6dc>   DW_AT_type        : <0x6e2>
    <6e0>   DW_AT_data_member_location: 12
 <2><6e1>: Abbrev Number: 0
 <1><6e2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <6e3>   DW_AT_byte_size   : 4
    <6e4>   DW_AT_type        : <0x1e1>
 <1><6e8>: Abbrev Number: 19 (DW_TAG_structure_type)
    <6e9>   DW_AT_name        : (indirect string, offset: 0x6040b): _misc_reent
    <6ed>   DW_AT_byte_size   : 80
    <6ee>   DW_AT_decl_file   : 7
    <6ef>   DW_AT_decl_line   : 359
    <6f1>   DW_AT_decl_column : 8
    <6f2>   DW_AT_sibling     : <0x791>
 <2><6f6>: Abbrev Number: 20 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0xb768c): _strtok_last
    <6fb>   DW_AT_decl_file   : 7
    <6fc>   DW_AT_decl_line   : 362
    <6fe>   DW_AT_decl_column : 9
    <6ff>   DW_AT_type        : <0x552>
    <703>   DW_AT_data_member_location: 0
 <2><704>: Abbrev Number: 20 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0x57dcf): _mblen_state
    <709>   DW_AT_decl_file   : 7
    <70a>   DW_AT_decl_line   : 363
    <70c>   DW_AT_decl_column : 14
    <70d>   DW_AT_type        : <0x14c>
    <711>   DW_AT_data_member_location: 4
 <2><712>: Abbrev Number: 20 (DW_TAG_member)
    <713>   DW_AT_name        : (indirect string, offset: 0xb76b2): _wctomb_state
    <717>   DW_AT_decl_file   : 7
    <718>   DW_AT_decl_line   : 364
    <71a>   DW_AT_decl_column : 14
    <71b>   DW_AT_type        : <0x14c>
    <71f>   DW_AT_data_member_location: 12
 <2><720>: Abbrev Number: 20 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0xabb10): _mbtowc_state
    <725>   DW_AT_decl_file   : 7
    <726>   DW_AT_decl_line   : 365
    <728>   DW_AT_decl_column : 14
    <729>   DW_AT_type        : <0x14c>
    <72d>   DW_AT_data_member_location: 20
 <2><72e>: Abbrev Number: 20 (DW_TAG_member)
    <72f>   DW_AT_name        : (indirect string, offset: 0x31f3a): _l64a_buf
    <733>   DW_AT_decl_file   : 7
    <734>   DW_AT_decl_line   : 366
    <736>   DW_AT_decl_column : 8
    <737>   DW_AT_type        : <0x791>
    <73b>   DW_AT_data_member_location: 28
 <2><73c>: Abbrev Number: 20 (DW_TAG_member)
    <73d>   DW_AT_name        : (indirect string, offset: 0xb6059): _getdate_err
    <741>   DW_AT_decl_file   : 7
    <742>   DW_AT_decl_line   : 367
    <744>   DW_AT_decl_column : 7
    <745>   DW_AT_type        : <0x29>
    <749>   DW_AT_data_member_location: 36
 <2><74a>: Abbrev Number: 20 (DW_TAG_member)
    <74b>   DW_AT_name        : (indirect string, offset: 0x61606): _mbrlen_state
    <74f>   DW_AT_decl_file   : 7
    <750>   DW_AT_decl_line   : 368
    <752>   DW_AT_decl_column : 14
    <753>   DW_AT_type        : <0x14c>
    <757>   DW_AT_data_member_location: 40
 <2><758>: Abbrev Number: 20 (DW_TAG_member)
    <759>   DW_AT_name        : (indirect string, offset: 0xb660e): _mbrtowc_state
    <75d>   DW_AT_decl_file   : 7
    <75e>   DW_AT_decl_line   : 369
    <760>   DW_AT_decl_column : 14
    <761>   DW_AT_type        : <0x14c>
    <765>   DW_AT_data_member_location: 48
 <2><766>: Abbrev Number: 20 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x77a22): _mbsrtowcs_state
    <76b>   DW_AT_decl_file   : 7
    <76c>   DW_AT_decl_line   : 370
    <76e>   DW_AT_decl_column : 14
    <76f>   DW_AT_type        : <0x14c>
    <773>   DW_AT_data_member_location: 56
 <2><774>: Abbrev Number: 20 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0x3dabf): _wcrtomb_state
    <779>   DW_AT_decl_file   : 7
    <77a>   DW_AT_decl_line   : 371
    <77c>   DW_AT_decl_column : 14
    <77d>   DW_AT_type        : <0x14c>
    <781>   DW_AT_data_member_location: 64
 <2><782>: Abbrev Number: 20 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x72cc0): _wcsrtombs_state
    <787>   DW_AT_decl_file   : 7
    <788>   DW_AT_decl_line   : 372
    <78a>   DW_AT_decl_column : 14
    <78b>   DW_AT_type        : <0x14c>
    <78f>   DW_AT_data_member_location: 72
 <2><790>: Abbrev Number: 0
 <1><791>: Abbrev Number: 12 (DW_TAG_array_type)
    <792>   DW_AT_type        : <0x558>
    <796>   DW_AT_sibling     : <0x7a1>
 <2><79a>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <79b>   DW_AT_type        : <0x30>
    <79f>   DW_AT_upper_bound : 7
 <2><7a0>: Abbrev Number: 0
 <1><7a1>: Abbrev Number: 16 (DW_TAG_structure_type)
    <7a2>   DW_AT_name        : (indirect string, offset: 0xac876): __locale_t
    <7a6>   DW_AT_declaration : 1
 <1><7a6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7a7>   DW_AT_byte_size   : 4
    <7a8>   DW_AT_type        : <0x7a1>
 <1><7ac>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7ad>   DW_AT_byte_size   : 4
    <7ae>   DW_AT_type        : <0x69b>
 <1><7b2>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <7b3>   DW_AT_prototyped  : 1
    <7b3>   DW_AT_sibling     : <0x7bd>
 <2><7b7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <7b8>   DW_AT_type        : <0x3eb>
 <2><7bc>: Abbrev Number: 0
 <1><7bd>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7be>   DW_AT_byte_size   : 4
    <7bf>   DW_AT_type        : <0x7b2>
 <1><7c3>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7c4>   DW_AT_byte_size   : 4
    <7c5>   DW_AT_type        : <0x644>
 <1><7c9>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7ca>   DW_AT_byte_size   : 4
    <7cb>   DW_AT_type        : <0x1f7>
 <1><7cf>: Abbrev Number: 6 (DW_TAG_subroutine_type)
    <7d0>   DW_AT_prototyped  : 1
    <7d0>   DW_AT_sibling     : <0x7da>
 <2><7d4>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <7d5>   DW_AT_type        : <0x29>
 <2><7d9>: Abbrev Number: 0
 <1><7da>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7db>   DW_AT_byte_size   : 4
    <7dc>   DW_AT_type        : <0x7e0>
 <1><7e0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7e1>   DW_AT_byte_size   : 4
    <7e2>   DW_AT_type        : <0x7cf>
 <1><7e6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <7e7>   DW_AT_byte_size   : 4
    <7e8>   DW_AT_type        : <0x6e8>
 <1><7ec>: Abbrev Number: 19 (DW_TAG_structure_type)
    <7ed>   DW_AT_name        : (indirect string, offset: 0xa83d8): xSTATIC_LIST_ITEM
    <7f1>   DW_AT_byte_size   : 20
    <7f2>   DW_AT_decl_file   : 9
    <7f3>   DW_AT_decl_line   : 1061
    <7f5>   DW_AT_decl_column : 8
    <7f6>   DW_AT_sibling     : <0x817>
 <2><7fa>: Abbrev Number: 20 (DW_TAG_member)
    <7fb>   DW_AT_name        : (indirect string, offset: 0xd25f2): xDummy2
    <7ff>   DW_AT_decl_file   : 9
    <800>   DW_AT_decl_line   : 1066
    <802>   DW_AT_decl_column : 13
    <803>   DW_AT_type        : <0xc5>
    <807>   DW_AT_data_member_location: 0
 <2><808>: Abbrev Number: 20 (DW_TAG_member)
    <809>   DW_AT_name        : (indirect string, offset: 0x48cb0): pvDummy3
    <80d>   DW_AT_decl_file   : 9
    <80e>   DW_AT_decl_line   : 1067
    <810>   DW_AT_decl_column : 8
    <811>   DW_AT_type        : <0x817>
    <815>   DW_AT_data_member_location: 4
 <2><816>: Abbrev Number: 0
 <1><817>: Abbrev Number: 12 (DW_TAG_array_type)
    <818>   DW_AT_type        : <0xb7>
    <81c>   DW_AT_sibling     : <0x827>
 <2><820>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <821>   DW_AT_type        : <0x30>
    <825>   DW_AT_upper_bound : 3
 <2><826>: Abbrev Number: 0
 <1><827>: Abbrev Number: 9 (DW_TAG_typedef)
    <828>   DW_AT_name        : (indirect string, offset: 0x97fc8): StaticListItem_t
    <82c>   DW_AT_decl_file   : 9
    <82d>   DW_AT_decl_line   : 1072
    <82f>   DW_AT_decl_column : 34
    <830>   DW_AT_type        : <0x7ec>
 <1><834>: Abbrev Number: 19 (DW_TAG_structure_type)
    <835>   DW_AT_name        : (indirect string, offset: 0x60033): xSTATIC_TCB
    <839>   DW_AT_byte_size   : 188
    <83a>   DW_AT_decl_file   : 9
    <83b>   DW_AT_decl_line   : 1112
    <83d>   DW_AT_decl_column : 16
    <83e>   DW_AT_sibling     : <0x8dd>
 <2><842>: Abbrev Number: 20 (DW_TAG_member)
    <843>   DW_AT_name        : (indirect string, offset: 0x28ae0): pxDummy1
    <847>   DW_AT_decl_file   : 9
    <848>   DW_AT_decl_line   : 1114
    <84a>   DW_AT_decl_column : 11
    <84b>   DW_AT_type        : <0xb7>
    <84f>   DW_AT_data_member_location: 0
 <2><850>: Abbrev Number: 20 (DW_TAG_member)
    <851>   DW_AT_name        : (indirect string, offset: 0xd25fb): xDummy3
    <855>   DW_AT_decl_file   : 9
    <856>   DW_AT_decl_line   : 1118
    <858>   DW_AT_decl_column : 19
    <859>   DW_AT_type        : <0x8dd>
    <85d>   DW_AT_data_member_location: 4
 <2><85e>: Abbrev Number: 20 (DW_TAG_member)
    <85f>   DW_AT_name        : (indirect string, offset: 0x1bb69): uxDummy5
    <863>   DW_AT_decl_file   : 9
    <864>   DW_AT_decl_line   : 1119
    <866>   DW_AT_decl_column : 16
    <867>   DW_AT_type        : <0xb9>
    <86b>   DW_AT_data_member_location: 44
 <2><86c>: Abbrev Number: 20 (DW_TAG_member)
    <86d>   DW_AT_name        : (indirect string, offset: 0x28b99): pxDummy6
    <871>   DW_AT_decl_file   : 9
    <872>   DW_AT_decl_line   : 1120
    <874>   DW_AT_decl_column : 11
    <875>   DW_AT_type        : <0xb7>
    <879>   DW_AT_data_member_location: 48
 <2><87a>: Abbrev Number: 20 (DW_TAG_member)
    <87b>   DW_AT_name        : (indirect string, offset: 0x47206): ucDummy7
    <87f>   DW_AT_decl_file   : 9
    <880>   DW_AT_decl_line   : 1121
    <882>   DW_AT_decl_column : 13
    <883>   DW_AT_type        : <0x8ed>
    <887>   DW_AT_data_member_location: 52
 <2><888>: Abbrev Number: 20 (DW_TAG_member)
    <889>   DW_AT_name        : (indirect string, offset: 0x2be3e): uxDummy10
    <88d>   DW_AT_decl_file   : 9
    <88e>   DW_AT_decl_line   : 1129
    <890>   DW_AT_decl_column : 16
    <891>   DW_AT_type        : <0x8fd>
    <895>   DW_AT_data_member_location: 68
 <2><896>: Abbrev Number: 20 (DW_TAG_member)
    <897>   DW_AT_name        : (indirect string, offset: 0x2be7f): uxDummy12
    <89b>   DW_AT_decl_file   : 9
    <89c>   DW_AT_decl_line   : 1132
    <89e>   DW_AT_decl_column : 16
    <89f>   DW_AT_type        : <0x8fd>
    <8a3>   DW_AT_data_member_location: 76
 <2><8a4>: Abbrev Number: 20 (DW_TAG_member)
    <8a5>   DW_AT_name        : (indirect string, offset: 0xa0af1): xDummy17
    <8a9>   DW_AT_decl_file   : 9
    <8aa>   DW_AT_decl_line   : 1144
    <8ac>   DW_AT_decl_column : 17
    <8ad>   DW_AT_type        : <0x2a8>
    <8b1>   DW_AT_data_member_location: 84
 <2><8b2>: Abbrev Number: 20 (DW_TAG_member)
    <8b3>   DW_AT_name        : (indirect string, offset: 0x1cf99): ulDummy18
    <8b7>   DW_AT_decl_file   : 9
    <8b8>   DW_AT_decl_line   : 1147
    <8ba>   DW_AT_decl_column : 14
    <8bb>   DW_AT_type        : <0x9a>
    <8bf>   DW_AT_data_member_location: 180
 <2><8c0>: Abbrev Number: 20 (DW_TAG_member)
    <8c1>   DW_AT_name        : (indirect string, offset: 0x3cf43): ucDummy19
    <8c5>   DW_AT_decl_file   : 9
    <8c6>   DW_AT_decl_line   : 1148
    <8c8>   DW_AT_decl_column : 13
    <8c9>   DW_AT_type        : <0x8e>
    <8cd>   DW_AT_data_member_location: 184
 <2><8ce>: Abbrev Number: 20 (DW_TAG_member)
    <8cf>   DW_AT_name        : (indirect string, offset: 0xb591a): uxDummy20
    <8d3>   DW_AT_decl_file   : 9
    <8d4>   DW_AT_decl_line   : 1151
    <8d6>   DW_AT_decl_column : 13
    <8d7>   DW_AT_type        : <0x8e>
    <8db>   DW_AT_data_member_location: 185
 <2><8dc>: Abbrev Number: 0
 <1><8dd>: Abbrev Number: 12 (DW_TAG_array_type)
    <8de>   DW_AT_type        : <0x827>
    <8e2>   DW_AT_sibling     : <0x8ed>
 <2><8e6>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <8e7>   DW_AT_type        : <0x30>
    <8eb>   DW_AT_upper_bound : 1
 <2><8ec>: Abbrev Number: 0
 <1><8ed>: Abbrev Number: 12 (DW_TAG_array_type)
    <8ee>   DW_AT_type        : <0x8e>
    <8f2>   DW_AT_sibling     : <0x8fd>
 <2><8f6>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <8f7>   DW_AT_type        : <0x30>
    <8fb>   DW_AT_upper_bound : 15
 <2><8fc>: Abbrev Number: 0
 <1><8fd>: Abbrev Number: 12 (DW_TAG_array_type)
    <8fe>   DW_AT_type        : <0xb9>
    <902>   DW_AT_sibling     : <0x90d>
 <2><906>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <907>   DW_AT_type        : <0x30>
    <90b>   DW_AT_upper_bound : 1
 <2><90c>: Abbrev Number: 0
 <1><90d>: Abbrev Number: 9 (DW_TAG_typedef)
    <90e>   DW_AT_name        : (indirect string, offset: 0x64373): StaticTask_t
    <912>   DW_AT_decl_file   : 9
    <913>   DW_AT_decl_line   : 1160
    <915>   DW_AT_decl_column : 3
    <916>   DW_AT_type        : <0x834>
 <1><91a>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <91b>   DW_AT_encoding    : 5	(signed)
    <91c>   DW_AT_byte_size   : 4
    <91d>   DW_AT_type        : <0x29>
    <921>   DW_AT_decl_file   : 10
    <922>   DW_AT_decl_line   : 82
    <923>   DW_AT_decl_column : 14
    <924>   DW_AT_sibling     : <0xa6a>
 <2><928>: Abbrev Number: 25 (DW_TAG_enumerator)
    <929>   DW_AT_name        : (indirect string, offset: 0x3b4f2): osPriorityNone
    <92d>   DW_AT_const_value : 0
 <2><92e>: Abbrev Number: 25 (DW_TAG_enumerator)
    <92f>   DW_AT_name        : (indirect string, offset: 0xae909): osPriorityIdle
    <933>   DW_AT_const_value : 1
 <2><934>: Abbrev Number: 25 (DW_TAG_enumerator)
    <935>   DW_AT_name        : (indirect string, offset: 0xb914d): osPriorityLow
    <939>   DW_AT_const_value : 8
 <2><93a>: Abbrev Number: 25 (DW_TAG_enumerator)
    <93b>   DW_AT_name        : (indirect string, offset: 0xa0f81): osPriorityLow1
    <93f>   DW_AT_const_value : 9
 <2><940>: Abbrev Number: 25 (DW_TAG_enumerator)
    <941>   DW_AT_name        : (indirect string, offset: 0xbeb2f): osPriorityLow2
    <945>   DW_AT_const_value : 10
 <2><946>: Abbrev Number: 25 (DW_TAG_enumerator)
    <947>   DW_AT_name        : (indirect string, offset: 0xbeb3e): osPriorityLow3
    <94b>   DW_AT_const_value : 11
 <2><94c>: Abbrev Number: 25 (DW_TAG_enumerator)
    <94d>   DW_AT_name        : (indirect string, offset: 0xbeb4d): osPriorityLow4
    <951>   DW_AT_const_value : 12
 <2><952>: Abbrev Number: 25 (DW_TAG_enumerator)
    <953>   DW_AT_name        : (indirect string, offset: 0xbeb5c): osPriorityLow5
    <957>   DW_AT_const_value : 13
 <2><958>: Abbrev Number: 25 (DW_TAG_enumerator)
    <959>   DW_AT_name        : (indirect string, offset: 0xbeb6b): osPriorityLow6
    <95d>   DW_AT_const_value : 14
 <2><95e>: Abbrev Number: 25 (DW_TAG_enumerator)
    <95f>   DW_AT_name        : (indirect string, offset: 0x4b1c0): osPriorityLow7
    <963>   DW_AT_const_value : 15
 <2><964>: Abbrev Number: 25 (DW_TAG_enumerator)
    <965>   DW_AT_name        : (indirect string, offset: 0xc1135): osPriorityBelowNormal
    <969>   DW_AT_const_value : 16
 <2><96a>: Abbrev Number: 25 (DW_TAG_enumerator)
    <96b>   DW_AT_name        : (indirect string, offset: 0x79021): osPriorityBelowNormal1
    <96f>   DW_AT_const_value : 17
 <2><970>: Abbrev Number: 25 (DW_TAG_enumerator)
    <971>   DW_AT_name        : (indirect string, offset: 0xaab15): osPriorityBelowNormal2
    <975>   DW_AT_const_value : 18
 <2><976>: Abbrev Number: 25 (DW_TAG_enumerator)
    <977>   DW_AT_name        : (indirect string, offset: 0x89b51): osPriorityBelowNormal3
    <97b>   DW_AT_const_value : 19
 <2><97c>: Abbrev Number: 25 (DW_TAG_enumerator)
    <97d>   DW_AT_name        : (indirect string, offset: 0xaab44): osPriorityBelowNormal4
    <981>   DW_AT_const_value : 20
 <2><982>: Abbrev Number: 25 (DW_TAG_enumerator)
    <983>   DW_AT_name        : (indirect string, offset: 0xaab5b): osPriorityBelowNormal5
    <987>   DW_AT_const_value : 21
 <2><988>: Abbrev Number: 25 (DW_TAG_enumerator)
    <989>   DW_AT_name        : (indirect string, offset: 0xaab72): osPriorityBelowNormal6
    <98d>   DW_AT_const_value : 22
 <2><98e>: Abbrev Number: 25 (DW_TAG_enumerator)
    <98f>   DW_AT_name        : (indirect string, offset: 0xaab89): osPriorityBelowNormal7
    <993>   DW_AT_const_value : 23
 <2><994>: Abbrev Number: 25 (DW_TAG_enumerator)
    <995>   DW_AT_name        : (indirect string, offset: 0xa3eec): osPriorityNormal
    <999>   DW_AT_const_value : 24
 <2><99a>: Abbrev Number: 25 (DW_TAG_enumerator)
    <99b>   DW_AT_name        : (indirect string, offset: 0x1fed6): osPriorityNormal1
    <99f>   DW_AT_const_value : 25
 <2><9a0>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9a1>   DW_AT_name        : (indirect string, offset: 0x1fee8): osPriorityNormal2
    <9a5>   DW_AT_const_value : 26
 <2><9a6>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9a7>   DW_AT_name        : (indirect string, offset: 0x1fefa): osPriorityNormal3
    <9ab>   DW_AT_const_value : 27
 <2><9ac>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9ad>   DW_AT_name        : (indirect string, offset: 0x1ff0c): osPriorityNormal4
    <9b1>   DW_AT_const_value : 28
 <2><9b2>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9b3>   DW_AT_name        : (indirect string, offset: 0x988ea): osPriorityNormal5
    <9b7>   DW_AT_const_value : 29
 <2><9b8>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9b9>   DW_AT_name        : (indirect string, offset: 0x1ff44): osPriorityNormal6
    <9bd>   DW_AT_const_value : 30
 <2><9be>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9bf>   DW_AT_name        : (indirect string, offset: 0x1ff56): osPriorityNormal7
    <9c3>   DW_AT_const_value : 31
 <2><9c4>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9c5>   DW_AT_name        : (indirect string, offset: 0x81ba2): osPriorityAboveNormal
    <9c9>   DW_AT_const_value : 32
 <2><9ca>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9cb>   DW_AT_name        : (indirect string, offset: 0xc882c): osPriorityAboveNormal1
    <9cf>   DW_AT_const_value : 33
 <2><9d0>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9d1>   DW_AT_name        : (indirect string, offset: 0xc8843): osPriorityAboveNormal2
    <9d5>   DW_AT_const_value : 34
 <2><9d6>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9d7>   DW_AT_name        : (indirect string, offset: 0xc885a): osPriorityAboveNormal3
    <9db>   DW_AT_const_value : 35
 <2><9dc>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9dd>   DW_AT_name        : (indirect string, offset: 0xc8871): osPriorityAboveNormal4
    <9e1>   DW_AT_const_value : 36
 <2><9e2>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9e3>   DW_AT_name        : (indirect string, offset: 0xb1b4e): osPriorityAboveNormal5
    <9e7>   DW_AT_const_value : 37
 <2><9e8>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9e9>   DW_AT_name        : (indirect string, offset: 0xc889e): osPriorityAboveNormal6
    <9ed>   DW_AT_const_value : 38
 <2><9ee>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9ef>   DW_AT_name        : (indirect string, offset: 0xc88b5): osPriorityAboveNormal7
    <9f3>   DW_AT_const_value : 39
 <2><9f4>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x47c41): osPriorityHigh
    <9f9>   DW_AT_const_value : 40
 <2><9fa>: Abbrev Number: 25 (DW_TAG_enumerator)
    <9fb>   DW_AT_name        : (indirect string, offset: 0x8608d): osPriorityHigh1
    <9ff>   DW_AT_const_value : 41
 <2><a00>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a01>   DW_AT_name        : (indirect string, offset: 0x8609d): osPriorityHigh2
    <a05>   DW_AT_const_value : 42
 <2><a06>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a07>   DW_AT_name        : (indirect string, offset: 0x860ad): osPriorityHigh3
    <a0b>   DW_AT_const_value : 43
 <2><a0c>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x860bd): osPriorityHigh4
    <a11>   DW_AT_const_value : 44
 <2><a12>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a13>   DW_AT_name        : (indirect string, offset: 0x42b9): osPriorityHigh5
    <a17>   DW_AT_const_value : 45
 <2><a18>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a19>   DW_AT_name        : (indirect string, offset: 0x860f9): osPriorityHigh6
    <a1d>   DW_AT_const_value : 46
 <2><a1e>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a1f>   DW_AT_name        : (indirect string, offset: 0x86109): osPriorityHigh7
    <a23>   DW_AT_const_value : 47
 <2><a24>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a25>   DW_AT_name        : (indirect string, offset: 0xb5ef6): osPriorityRealtime
    <a29>   DW_AT_const_value : 48
 <2><a2a>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a2b>   DW_AT_name        : (indirect string, offset: 0x7ed8e): osPriorityRealtime1
    <a2f>   DW_AT_const_value : 49
 <2><a30>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a31>   DW_AT_name        : (indirect string, offset: 0x7eda2): osPriorityRealtime2
    <a35>   DW_AT_const_value : 50
 <2><a36>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a37>   DW_AT_name        : (indirect string, offset: 0x7edb6): osPriorityRealtime3
    <a3b>   DW_AT_const_value : 51
 <2><a3c>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x7edca): osPriorityRealtime4
    <a41>   DW_AT_const_value : 52
 <2><a42>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a43>   DW_AT_name        : (indirect string, offset: 0x7edde): osPriorityRealtime5
    <a47>   DW_AT_const_value : 53
 <2><a48>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a49>   DW_AT_name        : (indirect string, offset: 0x7edf2): osPriorityRealtime6
    <a4d>   DW_AT_const_value : 54
 <2><a4e>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a4f>   DW_AT_name        : (indirect string, offset: 0x7ee06): osPriorityRealtime7
    <a53>   DW_AT_const_value : 55
 <2><a54>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a55>   DW_AT_name        : (indirect string, offset: 0xcb0): osPriorityISR
    <a59>   DW_AT_const_value : 56
 <2><a5a>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a5b>   DW_AT_name        : (indirect string, offset: 0xb167e): osPriorityError
    <a5f>   DW_AT_const_value : -1
 <2><a60>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a61>   DW_AT_name        : (indirect string, offset: 0xbf12c): osPriorityReserved
    <a65>   DW_AT_const_value : 0x7fffffff
 <2><a69>: Abbrev Number: 0
 <1><a6a>: Abbrev Number: 4 (DW_TAG_typedef)
    <a6b>   DW_AT_name        : (indirect string, offset: 0x94707): osPriority_t
    <a6f>   DW_AT_decl_file   : 10
    <a70>   DW_AT_decl_line   : 136
    <a71>   DW_AT_decl_column : 3
    <a72>   DW_AT_type        : <0x91a>
 <1><a76>: Abbrev Number: 4 (DW_TAG_typedef)
    <a77>   DW_AT_name        : (indirect string, offset: 0x6d914): osThreadFunc_t
    <a7b>   DW_AT_decl_file   : 10
    <a7c>   DW_AT_decl_line   : 139
    <a7d>   DW_AT_decl_column : 16
    <a7e>   DW_AT_type        : <0xa6>
 <1><a82>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <a83>   DW_AT_encoding    : 5	(signed)
    <a84>   DW_AT_byte_size   : 4
    <a85>   DW_AT_type        : <0x29>
    <a89>   DW_AT_decl_file   : 10
    <a8a>   DW_AT_decl_line   : 176
    <a8b>   DW_AT_decl_column : 14
    <a8c>   DW_AT_sibling     : <0xac4>
 <2><a90>: Abbrev Number: 25 (DW_TAG_enumerator)
    <a91>   DW_AT_name        : (indirect string, offset: 0x9b23b): osOK
    <a95>   DW_AT_const_value : 0
 <2><a96>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a97>   DW_AT_name        : (indirect string, offset: 0x5d710): osError
    <a9b>   DW_AT_const_value : -1
 <2><a9c>: Abbrev Number: 26 (DW_TAG_enumerator)
    <a9d>   DW_AT_name        : (indirect string, offset: 0x22708): osErrorTimeout
    <aa1>   DW_AT_const_value : -2
 <2><aa2>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aa3>   DW_AT_name        : (indirect string, offset: 0x844ed): osErrorResource
    <aa7>   DW_AT_const_value : -3
 <2><aa8>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x343d5): osErrorParameter
    <aad>   DW_AT_const_value : -4
 <2><aae>: Abbrev Number: 26 (DW_TAG_enumerator)
    <aaf>   DW_AT_name        : (indirect string, offset: 0x22dd6): osErrorNoMemory
    <ab3>   DW_AT_const_value : -5
 <2><ab4>: Abbrev Number: 26 (DW_TAG_enumerator)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x364be): osErrorISR
    <ab9>   DW_AT_const_value : -6
 <2><aba>: Abbrev Number: 27 (DW_TAG_enumerator)
    <abb>   DW_AT_name        : (indirect string, offset: 0x6620d): osStatusReserved
    <abf>   DW_AT_const_value : 0x7fffffff
 <2><ac3>: Abbrev Number: 0
 <1><ac4>: Abbrev Number: 4 (DW_TAG_typedef)
    <ac5>   DW_AT_name        : (indirect string, offset: 0x445be): osStatus_t
    <ac9>   DW_AT_decl_file   : 10
    <aca>   DW_AT_decl_line   : 185
    <acb>   DW_AT_decl_column : 3
    <acc>   DW_AT_type        : <0xa82>
 <1><ad0>: Abbrev Number: 4 (DW_TAG_typedef)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x24aa7): osThreadId_t
    <ad5>   DW_AT_decl_file   : 10
    <ad6>   DW_AT_decl_line   : 189
    <ad7>   DW_AT_decl_column : 15
    <ad8>   DW_AT_type        : <0xb7>
 <1><adc>: Abbrev Number: 4 (DW_TAG_typedef)
    <add>   DW_AT_name        : (indirect string, offset: 0x87c85): TZ_ModuleId_t
    <ae1>   DW_AT_decl_file   : 10
    <ae2>   DW_AT_decl_line   : 213
    <ae3>   DW_AT_decl_column : 18
    <ae4>   DW_AT_type        : <0x9a>
 <1><ae8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <ae9>   DW_AT_byte_size   : 36
    <aea>   DW_AT_decl_file   : 10
    <aeb>   DW_AT_decl_line   : 218
    <aec>   DW_AT_decl_column : 9
    <aed>   DW_AT_sibling     : <0xb67>
 <2><af1>: Abbrev Number: 15 (DW_TAG_member)
    <af2>   DW_AT_name        : (indirect string, offset: 0xb3e31): name
    <af6>   DW_AT_decl_file   : 10
    <af7>   DW_AT_decl_line   : 219
    <af8>   DW_AT_decl_column : 33
    <af9>   DW_AT_type        : <0x588>
    <afd>   DW_AT_data_member_location: 0
 <2><afe>: Abbrev Number: 15 (DW_TAG_member)
    <aff>   DW_AT_name        : (indirect string, offset: 0x84231): attr_bits
    <b03>   DW_AT_decl_file   : 10
    <b04>   DW_AT_decl_line   : 220
    <b05>   DW_AT_decl_column : 28
    <b06>   DW_AT_type        : <0x9a>
    <b0a>   DW_AT_data_member_location: 4
 <2><b0b>: Abbrev Number: 15 (DW_TAG_member)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x271fc): cb_mem
    <b10>   DW_AT_decl_file   : 10
    <b11>   DW_AT_decl_line   : 221
    <b12>   DW_AT_decl_column : 30
    <b13>   DW_AT_type        : <0xb7>
    <b17>   DW_AT_data_member_location: 8
 <2><b18>: Abbrev Number: 15 (DW_TAG_member)
    <b19>   DW_AT_name        : (indirect string, offset: 0xbe37b): cb_size
    <b1d>   DW_AT_decl_file   : 10
    <b1e>   DW_AT_decl_line   : 222
    <b1f>   DW_AT_decl_column : 30
    <b20>   DW_AT_type        : <0x9a>
    <b24>   DW_AT_data_member_location: 12
 <2><b25>: Abbrev Number: 15 (DW_TAG_member)
    <b26>   DW_AT_name        : (indirect string, offset: 0xb6767): stack_mem
    <b2a>   DW_AT_decl_file   : 10
    <b2b>   DW_AT_decl_line   : 223
    <b2c>   DW_AT_decl_column : 27
    <b2d>   DW_AT_type        : <0xb7>
    <b31>   DW_AT_data_member_location: 16
 <2><b32>: Abbrev Number: 15 (DW_TAG_member)
    <b33>   DW_AT_name        : (indirect string, offset: 0x7ee6b): stack_size
    <b37>   DW_AT_decl_file   : 10
    <b38>   DW_AT_decl_line   : 224
    <b39>   DW_AT_decl_column : 27
    <b3a>   DW_AT_type        : <0x9a>
    <b3e>   DW_AT_data_member_location: 20
 <2><b3f>: Abbrev Number: 15 (DW_TAG_member)
    <b40>   DW_AT_name        : (indirect string, offset: 0x4ffea): priority
    <b44>   DW_AT_decl_file   : 10
    <b45>   DW_AT_decl_line   : 225
    <b46>   DW_AT_decl_column : 29
    <b47>   DW_AT_type        : <0xa6a>
    <b4b>   DW_AT_data_member_location: 24
 <2><b4c>: Abbrev Number: 15 (DW_TAG_member)
    <b4d>   DW_AT_name        : (indirect string, offset: 0x5610c): tz_module
    <b51>   DW_AT_decl_file   : 10
    <b52>   DW_AT_decl_line   : 226
    <b53>   DW_AT_decl_column : 28
    <b54>   DW_AT_type        : <0xadc>
    <b58>   DW_AT_data_member_location: 28
 <2><b59>: Abbrev Number: 15 (DW_TAG_member)
    <b5a>   DW_AT_name        : (indirect string, offset: 0xb462b): reserved
    <b5e>   DW_AT_decl_file   : 10
    <b5f>   DW_AT_decl_line   : 227
    <b60>   DW_AT_decl_column : 29
    <b61>   DW_AT_type        : <0x9a>
    <b65>   DW_AT_data_member_location: 32
 <2><b66>: Abbrev Number: 0
 <1><b67>: Abbrev Number: 4 (DW_TAG_typedef)
    <b68>   DW_AT_name        : (indirect string, offset: 0x1fd1e): osThreadAttr_t
    <b6c>   DW_AT_decl_file   : 10
    <b6d>   DW_AT_decl_line   : 228
    <b6e>   DW_AT_decl_column : 3
    <b6f>   DW_AT_type        : <0xae8>
 <1><b73>: Abbrev Number: 23 (DW_TAG_const_type)
    <b74>   DW_AT_type        : <0xb67>
 <1><b78>: Abbrev Number: 4 (DW_TAG_typedef)
    <b79>   DW_AT_name        : (indirect string, offset: 0x7e225): osStaticThreadDef_t
    <b7d>   DW_AT_decl_file   : 1
    <b7e>   DW_AT_decl_line   : 32
    <b7f>   DW_AT_decl_column : 22
    <b80>   DW_AT_type        : <0x90d>
 <1><b84>: Abbrev Number: 28 (DW_TAG_variable)
    <b85>   DW_AT_name        : (indirect string, offset: 0x5053e): defaultTaskHandle
    <b89>   DW_AT_decl_file   : 1
    <b8a>   DW_AT_decl_line   : 52
    <b8b>   DW_AT_decl_column : 14
    <b8c>   DW_AT_type        : <0xad0>
    <b90>   DW_AT_external    : 1
    <b90>   DW_AT_location    : 5 byte block: 3 fc 1 0 20 	(DW_OP_addr: 200001fc)
 <1><b96>: Abbrev Number: 28 (DW_TAG_variable)
    <b97>   DW_AT_name        : (indirect string, offset: 0x599ac): defaultTask_attributes
    <b9b>   DW_AT_decl_file   : 1
    <b9c>   DW_AT_decl_line   : 53
    <b9d>   DW_AT_decl_column : 22
    <b9e>   DW_AT_type        : <0xb73>
    <ba2>   DW_AT_external    : 1
    <ba2>   DW_AT_location    : 5 byte block: 3 1c 97 0 8 	(DW_OP_addr: 800971c)
 <1><ba8>: Abbrev Number: 28 (DW_TAG_variable)
    <ba9>   DW_AT_name        : (indirect string, offset: 0xc2ead): allocTask1Handle
    <bad>   DW_AT_decl_file   : 1
    <bae>   DW_AT_decl_line   : 59
    <baf>   DW_AT_decl_column : 14
    <bb0>   DW_AT_type        : <0xad0>
    <bb4>   DW_AT_external    : 1
    <bb4>   DW_AT_location    : 5 byte block: 3 0 2 0 20 	(DW_OP_addr: 20000200)
 <1><bba>: Abbrev Number: 12 (DW_TAG_array_type)
    <bbb>   DW_AT_type        : <0x9a>
    <bbf>   DW_AT_sibling     : <0xbca>
 <2><bc3>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <bc4>   DW_AT_type        : <0x30>
    <bc8>   DW_AT_upper_bound : 255
 <2><bc9>: Abbrev Number: 0
 <1><bca>: Abbrev Number: 28 (DW_TAG_variable)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x5c935): allocTask1Buffer
    <bcf>   DW_AT_decl_file   : 1
    <bd0>   DW_AT_decl_line   : 60
    <bd1>   DW_AT_decl_column : 10
    <bd2>   DW_AT_type        : <0xbba>
    <bd6>   DW_AT_external    : 1
    <bd6>   DW_AT_location    : 5 byte block: 3 4 2 0 20 	(DW_OP_addr: 20000204)
 <1><bdc>: Abbrev Number: 28 (DW_TAG_variable)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x8363d): allocTask1ControlBlock
    <be1>   DW_AT_decl_file   : 1
    <be2>   DW_AT_decl_line   : 61
    <be3>   DW_AT_decl_column : 21
    <be4>   DW_AT_type        : <0xb78>
    <be8>   DW_AT_external    : 1
    <be8>   DW_AT_location    : 5 byte block: 3 4 6 0 20 	(DW_OP_addr: 20000604)
 <1><bee>: Abbrev Number: 28 (DW_TAG_variable)
    <bef>   DW_AT_name        : (indirect string, offset: 0x8c418): allocTask1_attributes
    <bf3>   DW_AT_decl_file   : 1
    <bf4>   DW_AT_decl_line   : 62
    <bf5>   DW_AT_decl_column : 22
    <bf6>   DW_AT_type        : <0xb73>
    <bfa>   DW_AT_external    : 1
    <bfa>   DW_AT_location    : 5 byte block: 3 40 97 0 8 	(DW_OP_addr: 8009740)
 <1><c00>: Abbrev Number: 28 (DW_TAG_variable)
    <c01>   DW_AT_name        : (indirect string, offset: 0x6d8ec): allocTask2Handle
    <c05>   DW_AT_decl_file   : 1
    <c06>   DW_AT_decl_line   : 71
    <c07>   DW_AT_decl_column : 14
    <c08>   DW_AT_type        : <0xad0>
    <c0c>   DW_AT_external    : 1
    <c0c>   DW_AT_location    : 5 byte block: 3 c0 6 0 20 	(DW_OP_addr: 200006c0)
 <1><c12>: Abbrev Number: 12 (DW_TAG_array_type)
    <c13>   DW_AT_type        : <0x9a>
    <c17>   DW_AT_sibling     : <0xc23>
 <2><c1b>: Abbrev Number: 29 (DW_TAG_subrange_type)
    <c1c>   DW_AT_type        : <0x30>
    <c20>   DW_AT_upper_bound : 511
 <2><c22>: Abbrev Number: 0
 <1><c23>: Abbrev Number: 28 (DW_TAG_variable)
    <c24>   DW_AT_name        : (indirect string, offset: 0xbf7fb): allocTask2Buffer
    <c28>   DW_AT_decl_file   : 1
    <c29>   DW_AT_decl_line   : 72
    <c2a>   DW_AT_decl_column : 10
    <c2b>   DW_AT_type        : <0xc12>
    <c2f>   DW_AT_external    : 1
    <c2f>   DW_AT_location    : 5 byte block: 3 c4 6 0 20 	(DW_OP_addr: 200006c4)
 <1><c35>: Abbrev Number: 28 (DW_TAG_variable)
    <c36>   DW_AT_name        : (indirect string, offset: 0xb35bc): allocTask2ControlBlock
    <c3a>   DW_AT_decl_file   : 1
    <c3b>   DW_AT_decl_line   : 73
    <c3c>   DW_AT_decl_column : 21
    <c3d>   DW_AT_type        : <0xb78>
    <c41>   DW_AT_external    : 1
    <c41>   DW_AT_location    : 5 byte block: 3 c4 e 0 20 	(DW_OP_addr: 20000ec4)
 <1><c47>: Abbrev Number: 28 (DW_TAG_variable)
    <c48>   DW_AT_name        : (indirect string, offset: 0xaf32a): allocTask2_attributes
    <c4c>   DW_AT_decl_file   : 1
    <c4d>   DW_AT_decl_line   : 74
    <c4e>   DW_AT_decl_column : 22
    <c4f>   DW_AT_type        : <0xb73>
    <c53>   DW_AT_external    : 1
    <c53>   DW_AT_location    : 5 byte block: 3 64 97 0 8 	(DW_OP_addr: 8009764)
 <1><c59>: Abbrev Number: 28 (DW_TAG_variable)
    <c5a>   DW_AT_name        : (indirect string, offset: 0xa2cfc): allocTask3Handle
    <c5e>   DW_AT_decl_file   : 1
    <c5f>   DW_AT_decl_line   : 83
    <c60>   DW_AT_decl_column : 14
    <c61>   DW_AT_type        : <0xad0>
    <c65>   DW_AT_external    : 1
    <c65>   DW_AT_location    : 5 byte block: 3 80 f 0 20 	(DW_OP_addr: 20000f80)
 <1><c6b>: Abbrev Number: 12 (DW_TAG_array_type)
    <c6c>   DW_AT_type        : <0x9a>
    <c70>   DW_AT_sibling     : <0xc7b>
 <2><c74>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <c75>   DW_AT_type        : <0x30>
    <c79>   DW_AT_upper_bound : 63
 <2><c7a>: Abbrev Number: 0
 <1><c7b>: Abbrev Number: 28 (DW_TAG_variable)
    <c7c>   DW_AT_name        : (indirect string, offset: 0x4aad7): allocTask3Buffer
    <c80>   DW_AT_decl_file   : 1
    <c81>   DW_AT_decl_line   : 84
    <c82>   DW_AT_decl_column : 10
    <c83>   DW_AT_type        : <0xc6b>
    <c87>   DW_AT_external    : 1
    <c87>   DW_AT_location    : 5 byte block: 3 84 f 0 20 	(DW_OP_addr: 20000f84)
 <1><c8d>: Abbrev Number: 28 (DW_TAG_variable)
    <c8e>   DW_AT_name        : (indirect string, offset: 0x31df0): allocTask3ControlBlock
    <c92>   DW_AT_decl_file   : 1
    <c93>   DW_AT_decl_line   : 85
    <c94>   DW_AT_decl_column : 21
    <c95>   DW_AT_type        : <0xb78>
    <c99>   DW_AT_external    : 1
    <c99>   DW_AT_location    : 5 byte block: 3 84 10 0 20 	(DW_OP_addr: 20001084)
 <1><c9f>: Abbrev Number: 28 (DW_TAG_variable)
    <ca0>   DW_AT_name        : (indirect string, offset: 0x1a9d5): allocTask3_attributes
    <ca4>   DW_AT_decl_file   : 1
    <ca5>   DW_AT_decl_line   : 86
    <ca6>   DW_AT_decl_column : 22
    <ca7>   DW_AT_type        : <0xb73>
    <cab>   DW_AT_external    : 1
    <cab>   DW_AT_location    : 5 byte block: 3 88 97 0 8 	(DW_OP_addr: 8009788)
 <1><cb1>: Abbrev Number: 28 (DW_TAG_variable)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x9fb03): pollStackSizeHandle
    <cb6>   DW_AT_decl_file   : 1
    <cb7>   DW_AT_decl_line   : 95
    <cb8>   DW_AT_decl_column : 14
    <cb9>   DW_AT_type        : <0xad0>
    <cbd>   DW_AT_external    : 1
    <cbd>   DW_AT_location    : 5 byte block: 3 40 11 0 20 	(DW_OP_addr: 20001140)
 <1><cc3>: Abbrev Number: 12 (DW_TAG_array_type)
    <cc4>   DW_AT_type        : <0x9a>
    <cc8>   DW_AT_sibling     : <0xcd3>
 <2><ccc>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <ccd>   DW_AT_type        : <0x30>
    <cd1>   DW_AT_upper_bound : 127
 <2><cd2>: Abbrev Number: 0
 <1><cd3>: Abbrev Number: 28 (DW_TAG_variable)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x3e66c): pollStackSizeBuffer
    <cd8>   DW_AT_decl_file   : 1
    <cd9>   DW_AT_decl_line   : 96
    <cda>   DW_AT_decl_column : 10
    <cdb>   DW_AT_type        : <0xcc3>
    <cdf>   DW_AT_external    : 1
    <cdf>   DW_AT_location    : 5 byte block: 3 44 11 0 20 	(DW_OP_addr: 20001144)
 <1><ce5>: Abbrev Number: 28 (DW_TAG_variable)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x2dc1e): pollStackSizeControlBlock
    <cea>   DW_AT_decl_file   : 1
    <ceb>   DW_AT_decl_line   : 97
    <cec>   DW_AT_decl_column : 21
    <ced>   DW_AT_type        : <0xb78>
    <cf1>   DW_AT_external    : 1
    <cf1>   DW_AT_location    : 5 byte block: 3 44 13 0 20 	(DW_OP_addr: 20001344)
 <1><cf7>: Abbrev Number: 28 (DW_TAG_variable)
    <cf8>   DW_AT_name        : (indirect string, offset: 0x2eb7f): pollStackSize_attributes
    <cfc>   DW_AT_decl_file   : 1
    <cfd>   DW_AT_decl_line   : 98
    <cfe>   DW_AT_decl_column : 22
    <cff>   DW_AT_type        : <0xb73>
    <d03>   DW_AT_external    : 1
    <d03>   DW_AT_location    : 5 byte block: 3 ac 97 0 8 	(DW_OP_addr: 80097ac)
 <1><d09>: Abbrev Number: 30 (DW_TAG_subprogram)
    <d0a>   DW_AT_external    : 1
    <d0a>   DW_AT_name        : (indirect string, offset: 0xc6f24): osDelay
    <d0e>   DW_AT_decl_file   : 10
    <d0f>   DW_AT_decl_line   : 459
    <d11>   DW_AT_decl_column : 12
    <d12>   DW_AT_prototyped  : 1
    <d12>   DW_AT_type        : <0xac4>
    <d16>   DW_AT_declaration : 1
    <d16>   DW_AT_sibling     : <0xd20>
 <2><d1a>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d1b>   DW_AT_type        : <0x9a>
 <2><d1f>: Abbrev Number: 0
 <1><d20>: Abbrev Number: 31 (DW_TAG_subprogram)
    <d21>   DW_AT_external    : 1
    <d21>   DW_AT_name        : (indirect string, offset: 0x339de): PollStackSize
    <d25>   DW_AT_decl_file   : 1
    <d26>   DW_AT_decl_line   : 116
    <d27>   DW_AT_decl_column : 13
    <d28>   DW_AT_prototyped  : 1
    <d28>   DW_AT_declaration : 1
    <d28>   DW_AT_sibling     : <0xd32>
 <2><d2c>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d2d>   DW_AT_type        : <0xb7>
 <2><d31>: Abbrev Number: 0
 <1><d32>: Abbrev Number: 31 (DW_TAG_subprogram)
    <d33>   DW_AT_external    : 1
    <d33>   DW_AT_name        : (indirect string, offset: 0x53a51): AllocTask3
    <d37>   DW_AT_decl_file   : 1
    <d38>   DW_AT_decl_line   : 115
    <d39>   DW_AT_decl_column : 13
    <d3a>   DW_AT_prototyped  : 1
    <d3a>   DW_AT_declaration : 1
    <d3a>   DW_AT_sibling     : <0xd44>
 <2><d3e>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d3f>   DW_AT_type        : <0xb7>
 <2><d43>: Abbrev Number: 0
 <1><d44>: Abbrev Number: 31 (DW_TAG_subprogram)
    <d45>   DW_AT_external    : 1
    <d45>   DW_AT_name        : (indirect string, offset: 0x53a46): AllocTask2
    <d49>   DW_AT_decl_file   : 1
    <d4a>   DW_AT_decl_line   : 114
    <d4b>   DW_AT_decl_column : 13
    <d4c>   DW_AT_prototyped  : 1
    <d4c>   DW_AT_declaration : 1
    <d4c>   DW_AT_sibling     : <0xd56>
 <2><d50>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d51>   DW_AT_type        : <0xb7>
 <2><d55>: Abbrev Number: 0
 <1><d56>: Abbrev Number: 31 (DW_TAG_subprogram)
    <d57>   DW_AT_external    : 1
    <d57>   DW_AT_name        : (indirect string, offset: 0x53a3b): AllocTask1
    <d5b>   DW_AT_decl_file   : 1
    <d5c>   DW_AT_decl_line   : 113
    <d5d>   DW_AT_decl_column : 13
    <d5e>   DW_AT_prototyped  : 1
    <d5e>   DW_AT_declaration : 1
    <d5e>   DW_AT_sibling     : <0xd68>
 <2><d62>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d63>   DW_AT_type        : <0xb7>
 <2><d67>: Abbrev Number: 0
 <1><d68>: Abbrev Number: 30 (DW_TAG_subprogram)
    <d69>   DW_AT_external    : 1
    <d69>   DW_AT_name        : (indirect string, offset: 0x70689): osThreadNew
    <d6d>   DW_AT_decl_file   : 10
    <d6e>   DW_AT_decl_line   : 349
    <d70>   DW_AT_decl_column : 14
    <d71>   DW_AT_prototyped  : 1
    <d71>   DW_AT_type        : <0xad0>
    <d75>   DW_AT_declaration : 1
    <d75>   DW_AT_sibling     : <0xd89>
 <2><d79>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d7a>   DW_AT_type        : <0xa76>
 <2><d7e>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d7f>   DW_AT_type        : <0xb7>
 <2><d83>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d84>   DW_AT_type        : <0xd89>
 <2><d88>: Abbrev Number: 0
 <1><d89>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d8a>   DW_AT_byte_size   : 4
    <d8b>   DW_AT_type        : <0xb73>
 <1><d8f>: Abbrev Number: 32 (DW_TAG_subprogram)
    <d90>   DW_AT_external    : 1
    <d90>   DW_AT_name        : (indirect string, offset: 0x21775): DefaultTask
    <d94>   DW_AT_decl_file   : 1
    <d95>   DW_AT_decl_line   : 179
    <d96>   DW_AT_decl_column : 6
    <d97>   DW_AT_prototyped  : 1
    <d97>   DW_AT_low_pc      : 0x8000f40
    <d9b>   DW_AT_high_pc     : 0x10
    <d9f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <da1>   DW_AT_GNU_all_tail_call_sites: 1
    <da1>   DW_AT_sibling     : <0xdb5>
 <2><da5>: Abbrev Number: 33 (DW_TAG_formal_parameter)
    <da6>   DW_AT_name        : (indirect string, offset: 0x2addb): argument
    <daa>   DW_AT_decl_file   : 1
    <dab>   DW_AT_decl_line   : 179
    <dac>   DW_AT_decl_column : 24
    <dad>   DW_AT_type        : <0xb7>
    <db1>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><db4>: Abbrev Number: 0
 <1><db5>: Abbrev Number: 34 (DW_TAG_subprogram)
    <db6>   DW_AT_external    : 1
    <db6>   DW_AT_name        : (indirect string, offset: 0xa1e2e): MX_FREERTOS_Init
    <dba>   DW_AT_decl_file   : 1
    <dbb>   DW_AT_decl_line   : 125
    <dbc>   DW_AT_decl_column : 6
    <dbd>   DW_AT_prototyped  : 1
    <dbd>   DW_AT_low_pc      : 0x8000eac
    <dc1>   DW_AT_high_pc     : 0x94
    <dc5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dc7>   DW_AT_GNU_all_tail_call_sites: 1
 <1><dc7>: Abbrev Number: 0
  Compilation Unit @ offset 0xdc8:
   Length:        0x4ce (32-bit)
   Version:       4
   Abbrev Offset: 0x1e8
   Pointer Size:  4
 <0><dd3>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <dd4>   DW_AT_producer    : (indirect string, offset: 0xc342f): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <dd8>   DW_AT_language    : 12	(ANSI C99)
    <dd9>   DW_AT_name        : (indirect string, offset: 0xc9abe): ../Core/Src/gpio.c
    <ddd>   DW_AT_comp_dir    : (indirect string, offset: 0x7861d): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/Assign1_Rieder_Nikolaus/Debug
    <de1>   DW_AT_ranges      : 0x18
    <de5>   DW_AT_low_pc      : 0x0
    <de9>   DW_AT_stmt_list   : 0x9e6
    <ded>   DW_AT_GNU_macros  : 0x1f970
 <1><df1>: Abbrev Number: 2 (DW_TAG_base_type)
    <df2>   DW_AT_byte_size   : 1
    <df3>   DW_AT_encoding    : 6	(signed char)
    <df4>   DW_AT_name        : (indirect string, offset: 0x65687): signed char
 <1><df8>: Abbrev Number: 2 (DW_TAG_base_type)
    <df9>   DW_AT_byte_size   : 1
    <dfa>   DW_AT_encoding    : 8	(unsigned char)
    <dfb>   DW_AT_name        : (indirect string, offset: 0xc214e): unsigned char
 <1><dff>: Abbrev Number: 2 (DW_TAG_base_type)
    <e00>   DW_AT_byte_size   : 2
    <e01>   DW_AT_encoding    : 5	(signed)
    <e02>   DW_AT_name        : (indirect string, offset: 0x95e0d): short int
 <1><e06>: Abbrev Number: 3 (DW_TAG_typedef)
    <e07>   DW_AT_name        : (indirect string, offset: 0xc9bf3): __uint16_t
    <e0b>   DW_AT_decl_file   : 2
    <e0c>   DW_AT_decl_line   : 57
    <e0d>   DW_AT_decl_column : 25
    <e0e>   DW_AT_type        : <0xe12>
 <1><e12>: Abbrev Number: 2 (DW_TAG_base_type)
    <e13>   DW_AT_byte_size   : 2
    <e14>   DW_AT_encoding    : 7	(unsigned)
    <e15>   DW_AT_name        : (indirect string, offset: 0xc085b): short unsigned int
 <1><e19>: Abbrev Number: 2 (DW_TAG_base_type)
    <e1a>   DW_AT_byte_size   : 4
    <e1b>   DW_AT_encoding    : 5	(signed)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x11351): long int
 <1><e20>: Abbrev Number: 3 (DW_TAG_typedef)
    <e21>   DW_AT_name        : (indirect string, offset: 0x80c7d): __uint32_t
    <e25>   DW_AT_decl_file   : 2
    <e26>   DW_AT_decl_line   : 79
    <e27>   DW_AT_decl_column : 25
    <e28>   DW_AT_type        : <0xe2c>
 <1><e2c>: Abbrev Number: 2 (DW_TAG_base_type)
    <e2d>   DW_AT_byte_size   : 4
    <e2e>   DW_AT_encoding    : 7	(unsigned)
    <e2f>   DW_AT_name        : (indirect string, offset: 0x4d311): long unsigned int
 <1><e33>: Abbrev Number: 2 (DW_TAG_base_type)
    <e34>   DW_AT_byte_size   : 8
    <e35>   DW_AT_encoding    : 5	(signed)
    <e36>   DW_AT_name        : (indirect string, offset: 0x5c3dd): long long int
 <1><e3a>: Abbrev Number: 2 (DW_TAG_base_type)
    <e3b>   DW_AT_byte_size   : 8
    <e3c>   DW_AT_encoding    : 7	(unsigned)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x29b33): long long unsigned int
 <1><e41>: Abbrev Number: 4 (DW_TAG_base_type)
    <e42>   DW_AT_byte_size   : 4
    <e43>   DW_AT_encoding    : 5	(signed)
    <e44>   DW_AT_name        : int
 <1><e48>: Abbrev Number: 2 (DW_TAG_base_type)
    <e49>   DW_AT_byte_size   : 4
    <e4a>   DW_AT_encoding    : 7	(unsigned)
    <e4b>   DW_AT_name        : (indirect string, offset: 0x1093f): unsigned int
 <1><e4f>: Abbrev Number: 3 (DW_TAG_typedef)
    <e50>   DW_AT_name        : (indirect string, offset: 0x92f17): uint16_t
    <e54>   DW_AT_decl_file   : 3
    <e55>   DW_AT_decl_line   : 36
    <e56>   DW_AT_decl_column : 20
    <e57>   DW_AT_type        : <0xe06>
 <1><e5b>: Abbrev Number: 3 (DW_TAG_typedef)
    <e5c>   DW_AT_name        : (indirect string, offset: 0x924ab): uint32_t
    <e60>   DW_AT_decl_file   : 3
    <e61>   DW_AT_decl_line   : 48
    <e62>   DW_AT_decl_column : 20
    <e63>   DW_AT_type        : <0xe20>
 <1><e67>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <e68>   DW_AT_type        : <0xe5b>
 <1><e6c>: Abbrev Number: 6 (DW_TAG_structure_type)
    <e6d>   DW_AT_byte_size   : 44
    <e6e>   DW_AT_decl_file   : 4
    <e6f>   DW_AT_decl_line   : 451
    <e71>   DW_AT_decl_column : 9
    <e72>   DW_AT_sibling     : <0xf03>
 <2><e76>: Abbrev Number: 7 (DW_TAG_member)
    <e77>   DW_AT_name        : (indirect string, offset: 0xc9a4a): MODER
    <e7b>   DW_AT_decl_file   : 4
    <e7c>   DW_AT_decl_line   : 453
    <e7e>   DW_AT_decl_column : 17
    <e7f>   DW_AT_type        : <0xe67>
    <e83>   DW_AT_data_member_location: 0
 <2><e84>: Abbrev Number: 7 (DW_TAG_member)
    <e85>   DW_AT_name        : (indirect string, offset: 0xc9bb8): OTYPER
    <e89>   DW_AT_decl_file   : 4
    <e8a>   DW_AT_decl_line   : 454
    <e8c>   DW_AT_decl_column : 17
    <e8d>   DW_AT_type        : <0xe67>
    <e91>   DW_AT_data_member_location: 4
 <2><e92>: Abbrev Number: 7 (DW_TAG_member)
    <e93>   DW_AT_name        : (indirect string, offset: 0xc9c03): OSPEEDR
    <e97>   DW_AT_decl_file   : 4
    <e98>   DW_AT_decl_line   : 455
    <e9a>   DW_AT_decl_column : 17
    <e9b>   DW_AT_type        : <0xe67>
    <e9f>   DW_AT_data_member_location: 8
 <2><ea0>: Abbrev Number: 7 (DW_TAG_member)
    <ea1>   DW_AT_name        : (indirect string, offset: 0xc9b97): PUPDR
    <ea5>   DW_AT_decl_file   : 4
    <ea6>   DW_AT_decl_line   : 456
    <ea8>   DW_AT_decl_column : 17
    <ea9>   DW_AT_type        : <0xe67>
    <ead>   DW_AT_data_member_location: 12
 <2><eae>: Abbrev Number: 8 (DW_TAG_member)
    <eaf>   DW_AT_name        : IDR
    <eb3>   DW_AT_decl_file   : 4
    <eb4>   DW_AT_decl_line   : 457
    <eb6>   DW_AT_decl_column : 17
    <eb7>   DW_AT_type        : <0xe67>
    <ebb>   DW_AT_data_member_location: 16
 <2><ebc>: Abbrev Number: 8 (DW_TAG_member)
    <ebd>   DW_AT_name        : ODR
    <ec1>   DW_AT_decl_file   : 4
    <ec2>   DW_AT_decl_line   : 458
    <ec4>   DW_AT_decl_column : 17
    <ec5>   DW_AT_type        : <0xe67>
    <ec9>   DW_AT_data_member_location: 20
 <2><eca>: Abbrev Number: 7 (DW_TAG_member)
    <ecb>   DW_AT_name        : (indirect string, offset: 0xc9af4): BSRR
    <ecf>   DW_AT_decl_file   : 4
    <ed0>   DW_AT_decl_line   : 459
    <ed2>   DW_AT_decl_column : 17
    <ed3>   DW_AT_type        : <0xe67>
    <ed7>   DW_AT_data_member_location: 24
 <2><ed8>: Abbrev Number: 7 (DW_TAG_member)
    <ed9>   DW_AT_name        : (indirect string, offset: 0xc9bfe): LCKR
    <edd>   DW_AT_decl_file   : 4
    <ede>   DW_AT_decl_line   : 460
    <ee0>   DW_AT_decl_column : 17
    <ee1>   DW_AT_type        : <0xe67>
    <ee5>   DW_AT_data_member_location: 28
 <2><ee6>: Abbrev Number: 8 (DW_TAG_member)
    <ee7>   DW_AT_name        : AFR
    <eeb>   DW_AT_decl_file   : 4
    <eec>   DW_AT_decl_line   : 461
    <eee>   DW_AT_decl_column : 17
    <eef>   DW_AT_type        : <0xf13>
    <ef3>   DW_AT_data_member_location: 32
 <2><ef4>: Abbrev Number: 8 (DW_TAG_member)
    <ef5>   DW_AT_name        : BRR
    <ef9>   DW_AT_decl_file   : 4
    <efa>   DW_AT_decl_line   : 462
    <efc>   DW_AT_decl_column : 17
    <efd>   DW_AT_type        : <0xe67>
    <f01>   DW_AT_data_member_location: 40
 <2><f02>: Abbrev Number: 0
 <1><f03>: Abbrev Number: 9 (DW_TAG_array_type)
    <f04>   DW_AT_type        : <0xe67>
    <f08>   DW_AT_sibling     : <0xf13>
 <2><f0c>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f0d>   DW_AT_type        : <0xe48>
    <f11>   DW_AT_upper_bound : 1
 <2><f12>: Abbrev Number: 0
 <1><f13>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <f14>   DW_AT_type        : <0xf03>
 <1><f18>: Abbrev Number: 11 (DW_TAG_typedef)
    <f19>   DW_AT_name        : (indirect string, offset: 0xc9c5d): GPIO_TypeDef
    <f1d>   DW_AT_decl_file   : 4
    <f1e>   DW_AT_decl_line   : 464
    <f20>   DW_AT_decl_column : 3
    <f21>   DW_AT_type        : <0xe6c>
 <1><f25>: Abbrev Number: 6 (DW_TAG_structure_type)
    <f26>   DW_AT_byte_size   : 156
    <f27>   DW_AT_decl_file   : 4
    <f28>   DW_AT_decl_line   : 590
    <f2a>   DW_AT_decl_column : 9
    <f2b>   DW_AT_sibling     : <0x1151>
 <2><f2f>: Abbrev Number: 8 (DW_TAG_member)
    <f30>   DW_AT_name        : CR
    <f33>   DW_AT_decl_file   : 4
    <f34>   DW_AT_decl_line   : 592
    <f36>   DW_AT_decl_column : 17
    <f37>   DW_AT_type        : <0xe67>
    <f3b>   DW_AT_data_member_location: 0
 <2><f3c>: Abbrev Number: 7 (DW_TAG_member)
    <f3d>   DW_AT_name        : (indirect string, offset: 0xc9baa): ICSCR
    <f41>   DW_AT_decl_file   : 4
    <f42>   DW_AT_decl_line   : 593
    <f44>   DW_AT_decl_column : 17
    <f45>   DW_AT_type        : <0xe67>
    <f49>   DW_AT_data_member_location: 4
 <2><f4a>: Abbrev Number: 7 (DW_TAG_member)
    <f4b>   DW_AT_name        : (indirect string, offset: 0xc9b19): CFGR
    <f4f>   DW_AT_decl_file   : 4
    <f50>   DW_AT_decl_line   : 594
    <f52>   DW_AT_decl_column : 17
    <f53>   DW_AT_type        : <0xe67>
    <f57>   DW_AT_data_member_location: 8
 <2><f58>: Abbrev Number: 7 (DW_TAG_member)
    <f59>   DW_AT_name        : (indirect string, offset: 0xc9bb0): PLLCFGR
    <f5d>   DW_AT_decl_file   : 4
    <f5e>   DW_AT_decl_line   : 595
    <f60>   DW_AT_decl_column : 17
    <f61>   DW_AT_type        : <0xe67>
    <f65>   DW_AT_data_member_location: 12
 <2><f66>: Abbrev Number: 7 (DW_TAG_member)
    <f67>   DW_AT_name        : (indirect string, offset: 0xc9b12): PLLSAI1CFGR
    <f6b>   DW_AT_decl_file   : 4
    <f6c>   DW_AT_decl_line   : 596
    <f6e>   DW_AT_decl_column : 17
    <f6f>   DW_AT_type        : <0xe67>
    <f73>   DW_AT_data_member_location: 16
 <2><f74>: Abbrev Number: 7 (DW_TAG_member)
    <f75>   DW_AT_name        : (indirect string, offset: 0x79ce5): RESERVED
    <f79>   DW_AT_decl_file   : 4
    <f7a>   DW_AT_decl_line   : 597
    <f7c>   DW_AT_decl_column : 17
    <f7d>   DW_AT_type        : <0xe5b>
    <f81>   DW_AT_data_member_location: 20
 <2><f82>: Abbrev Number: 7 (DW_TAG_member)
    <f83>   DW_AT_name        : (indirect string, offset: 0xc9a5c): CIER
    <f87>   DW_AT_decl_file   : 4
    <f88>   DW_AT_decl_line   : 598
    <f8a>   DW_AT_decl_column : 17
    <f8b>   DW_AT_type        : <0xe67>
    <f8f>   DW_AT_data_member_location: 24
 <2><f90>: Abbrev Number: 7 (DW_TAG_member)
    <f91>   DW_AT_name        : (indirect string, offset: 0xc9a61): CIFR
    <f95>   DW_AT_decl_file   : 4
    <f96>   DW_AT_decl_line   : 599
    <f98>   DW_AT_decl_column : 17
    <f99>   DW_AT_type        : <0xe67>
    <f9d>   DW_AT_data_member_location: 28
 <2><f9e>: Abbrev Number: 7 (DW_TAG_member)
    <f9f>   DW_AT_name        : (indirect string, offset: 0xc9a57): CICR
    <fa3>   DW_AT_decl_file   : 4
    <fa4>   DW_AT_decl_line   : 600
    <fa6>   DW_AT_decl_column : 17
    <fa7>   DW_AT_type        : <0xe67>
    <fab>   DW_AT_data_member_location: 32
 <2><fac>: Abbrev Number: 7 (DW_TAG_member)
    <fad>   DW_AT_name        : (indirect string, offset: 0xc9c21): RESERVED0
    <fb1>   DW_AT_decl_file   : 4
    <fb2>   DW_AT_decl_line   : 601
    <fb4>   DW_AT_decl_column : 17
    <fb5>   DW_AT_type        : <0xe5b>
    <fb9>   DW_AT_data_member_location: 36
 <2><fba>: Abbrev Number: 7 (DW_TAG_member)
    <fbb>   DW_AT_name        : (indirect string, offset: 0xc9bd0): AHB1RSTR
    <fbf>   DW_AT_decl_file   : 4
    <fc0>   DW_AT_decl_line   : 602
    <fc2>   DW_AT_decl_column : 17
    <fc3>   DW_AT_type        : <0xe67>
    <fc7>   DW_AT_data_member_location: 40
 <2><fc8>: Abbrev Number: 7 (DW_TAG_member)
    <fc9>   DW_AT_name        : (indirect string, offset: 0xc9ab5): AHB2RSTR
    <fcd>   DW_AT_decl_file   : 4
    <fce>   DW_AT_decl_line   : 603
    <fd0>   DW_AT_decl_column : 17
    <fd1>   DW_AT_type        : <0xe67>
    <fd5>   DW_AT_data_member_location: 44
 <2><fd6>: Abbrev Number: 7 (DW_TAG_member)
    <fd7>   DW_AT_name        : (indirect string, offset: 0xc9b31): AHB3RSTR
    <fdb>   DW_AT_decl_file   : 4
    <fdc>   DW_AT_decl_line   : 604
    <fde>   DW_AT_decl_column : 17
    <fdf>   DW_AT_type        : <0xe67>
    <fe3>   DW_AT_data_member_location: 48
 <2><fe4>: Abbrev Number: 7 (DW_TAG_member)
    <fe5>   DW_AT_name        : (indirect string, offset: 0xc9c2b): RESERVED1
    <fe9>   DW_AT_decl_file   : 4
    <fea>   DW_AT_decl_line   : 605
    <fec>   DW_AT_decl_column : 17
    <fed>   DW_AT_type        : <0xe5b>
    <ff1>   DW_AT_data_member_location: 52
 <2><ff2>: Abbrev Number: 7 (DW_TAG_member)
    <ff3>   DW_AT_name        : (indirect string, offset: 0xc9ad1): APB1RSTR1
    <ff7>   DW_AT_decl_file   : 4
    <ff8>   DW_AT_decl_line   : 606
    <ffa>   DW_AT_decl_column : 17
    <ffb>   DW_AT_type        : <0xe67>
    <fff>   DW_AT_data_member_location: 56
 <2><1000>: Abbrev Number: 7 (DW_TAG_member)
    <1001>   DW_AT_name        : (indirect string, offset: 0xc9adb): APB1RSTR2
    <1005>   DW_AT_decl_file   : 4
    <1006>   DW_AT_decl_line   : 607
    <1008>   DW_AT_decl_column : 17
    <1009>   DW_AT_type        : <0xe67>
    <100d>   DW_AT_data_member_location: 60
 <2><100e>: Abbrev Number: 7 (DW_TAG_member)
    <100f>   DW_AT_name        : (indirect string, offset: 0xc9b28): APB2RSTR
    <1013>   DW_AT_decl_file   : 4
    <1014>   DW_AT_decl_line   : 608
    <1016>   DW_AT_decl_column : 17
    <1017>   DW_AT_type        : <0xe67>
    <101b>   DW_AT_data_member_location: 64
 <2><101c>: Abbrev Number: 7 (DW_TAG_member)
    <101d>   DW_AT_name        : (indirect string, offset: 0xc9c35): RESERVED2
    <1021>   DW_AT_decl_file   : 4
    <1022>   DW_AT_decl_line   : 609
    <1024>   DW_AT_decl_column : 17
    <1025>   DW_AT_type        : <0xe5b>
    <1029>   DW_AT_data_member_location: 68
 <2><102a>: Abbrev Number: 7 (DW_TAG_member)
    <102b>   DW_AT_name        : (indirect string, offset: 0xc9a8e): AHB1ENR
    <102f>   DW_AT_decl_file   : 4
    <1030>   DW_AT_decl_line   : 610
    <1032>   DW_AT_decl_column : 17
    <1033>   DW_AT_type        : <0xe67>
    <1037>   DW_AT_data_member_location: 72
 <2><1038>: Abbrev Number: 7 (DW_TAG_member)
    <1039>   DW_AT_name        : (indirect string, offset: 0xc9afe): AHB2ENR
    <103d>   DW_AT_decl_file   : 4
    <103e>   DW_AT_decl_line   : 611
    <1040>   DW_AT_decl_column : 17
    <1041>   DW_AT_type        : <0xe67>
    <1045>   DW_AT_data_member_location: 76
 <2><1046>: Abbrev Number: 7 (DW_TAG_member)
    <1047>   DW_AT_name        : (indirect string, offset: 0xc9b3a): AHB3ENR
    <104b>   DW_AT_decl_file   : 4
    <104c>   DW_AT_decl_line   : 612
    <104e>   DW_AT_decl_column : 17
    <104f>   DW_AT_type        : <0xe67>
    <1053>   DW_AT_data_member_location: 80
 <2><1054>: Abbrev Number: 7 (DW_TAG_member)
    <1055>   DW_AT_name        : (indirect string, offset: 0xc9c3f): RESERVED3
    <1059>   DW_AT_decl_file   : 4
    <105a>   DW_AT_decl_line   : 613
    <105c>   DW_AT_decl_column : 17
    <105d>   DW_AT_type        : <0xe5b>
    <1061>   DW_AT_data_member_location: 84
 <2><1062>: Abbrev Number: 7 (DW_TAG_member)
    <1063>   DW_AT_name        : (indirect string, offset: 0xc9a66): APB1ENR1
    <1067>   DW_AT_decl_file   : 4
    <1068>   DW_AT_decl_line   : 614
    <106a>   DW_AT_decl_column : 17
    <106b>   DW_AT_type        : <0xe67>
    <106f>   DW_AT_data_member_location: 88
 <2><1070>: Abbrev Number: 7 (DW_TAG_member)
    <1071>   DW_AT_name        : (indirect string, offset: 0xc9a6f): APB1ENR2
    <1075>   DW_AT_decl_file   : 4
    <1076>   DW_AT_decl_line   : 615
    <1078>   DW_AT_decl_column : 17
    <1079>   DW_AT_type        : <0xe67>
    <107d>   DW_AT_data_member_location: 92
 <2><107e>: Abbrev Number: 7 (DW_TAG_member)
    <107f>   DW_AT_name        : (indirect string, offset: 0xc9b62): APB2ENR
    <1083>   DW_AT_decl_file   : 4
    <1084>   DW_AT_decl_line   : 616
    <1086>   DW_AT_decl_column : 17
    <1087>   DW_AT_type        : <0xe67>
    <108b>   DW_AT_data_member_location: 96
 <2><108c>: Abbrev Number: 7 (DW_TAG_member)
    <108d>   DW_AT_name        : (indirect string, offset: 0xc9b75): RESERVED4
    <1091>   DW_AT_decl_file   : 4
    <1092>   DW_AT_decl_line   : 617
    <1094>   DW_AT_decl_column : 17
    <1095>   DW_AT_type        : <0xe5b>
    <1099>   DW_AT_data_member_location: 100
 <2><109a>: Abbrev Number: 7 (DW_TAG_member)
    <109b>   DW_AT_name        : (indirect string, offset: 0xc9b4c): AHB1SMENR
    <109f>   DW_AT_decl_file   : 4
    <10a0>   DW_AT_decl_line   : 618
    <10a2>   DW_AT_decl_column : 17
    <10a3>   DW_AT_type        : <0xe67>
    <10a7>   DW_AT_data_member_location: 104
 <2><10a8>: Abbrev Number: 7 (DW_TAG_member)
    <10a9>   DW_AT_name        : (indirect string, offset: 0xc9c0b): AHB2SMENR
    <10ad>   DW_AT_decl_file   : 4
    <10ae>   DW_AT_decl_line   : 619
    <10b0>   DW_AT_decl_column : 17
    <10b1>   DW_AT_type        : <0xe67>
    <10b5>   DW_AT_data_member_location: 108
 <2><10b6>: Abbrev Number: 7 (DW_TAG_member)
    <10b7>   DW_AT_name        : (indirect string, offset: 0xc9b1e): AHB3SMENR
    <10bb>   DW_AT_decl_file   : 4
    <10bc>   DW_AT_decl_line   : 620
    <10be>   DW_AT_decl_column : 17
    <10bf>   DW_AT_type        : <0xe67>
    <10c3>   DW_AT_data_member_location: 112
