Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xbbb (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xc57c1): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x8a888): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xd564): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/RTOS_Tutorial_Part4/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x8ca7): size_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 209
    <37>   DW_AT_decl_column : 23
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 4 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 4
    <3e>   DW_AT_encoding    : 7	(unsigned)

 <1><43>: Abbrev Number: 4 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 8
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x5cffe): long long int
 <1><4a>: Abbrev Number: 4 (DW_TAG_base_type)
    <4b>   DW_AT_byte_size   : 8
    <4c>   DW_AT_encoding    : 4	(float)
    <4d>   DW_AT_name        : (indirect string, offset: 0x12da1): long double
 <1><51>: Abbrev Number: 4 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 1
    <53>   DW_AT_encoding    : 6	(signed char)
    <54>   DW_AT_name        : (indirect string, offset: 0x66456): signed char
 <1><58>: Abbrev Number: 3 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x3aa94): __uint8_t
    <5d>   DW_AT_decl_file   : 3
    <5e>   DW_AT_decl_line   : 43
    <5f>   DW_AT_decl_column : 24
    <60>   DW_AT_type        : <0x64>
 <1><64>: Abbrev Number: 4 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 1
    <66>   DW_AT_encoding    : 8	(unsigned char)
    <67>   DW_AT_name        : (indirect string, offset: 0xc43d3): unsigned char
 <1><6b>: Abbrev Number: 4 (DW_TAG_base_type)
    <6c>   DW_AT_byte_size   : 2
    <6d>   DW_AT_encoding    : 5	(signed)
    <6e>   DW_AT_name        : (indirect string, offset: 0x97259): short int
 <1><72>: Abbrev Number: 3 (DW_TAG_typedef)
    <73>   DW_AT_name        : (indirect string, offset: 0xa5de7): __uint16_t
    <77>   DW_AT_decl_file   : 3
    <78>   DW_AT_decl_line   : 57
    <79>   DW_AT_decl_column : 25
    <7a>   DW_AT_type        : <0x7e>
 <1><7e>: Abbrev Number: 4 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 2
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0xc2b30): short unsigned int
 <1><85>: Abbrev Number: 4 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : (indirect string, offset: 0x115f2): long int
 <1><8c>: Abbrev Number: 3 (DW_TAG_typedef)
    <8d>   DW_AT_name        : (indirect string, offset: 0x81e83): __uint32_t
    <91>   DW_AT_decl_file   : 3
    <92>   DW_AT_decl_line   : 79
    <93>   DW_AT_decl_column : 25
    <94>   DW_AT_type        : <0x98>
 <1><98>: Abbrev Number: 4 (DW_TAG_base_type)
    <99>   DW_AT_byte_size   : 4
    <9a>   DW_AT_encoding    : 7	(unsigned)
    <9b>   DW_AT_name        : (indirect string, offset: 0x4de4f): long unsigned int
 <1><9f>: Abbrev Number: 4 (DW_TAG_base_type)
    <a0>   DW_AT_byte_size   : 8
    <a1>   DW_AT_encoding    : 7	(unsigned)
    <a2>   DW_AT_name        : (indirect string, offset: 0x2a1f9): long long unsigned int
 <1><a6>: Abbrev Number: 3 (DW_TAG_typedef)
    <a7>   DW_AT_name        : (indirect string, offset: 0x3aa96): uint8_t
    <ab>   DW_AT_decl_file   : 4
    <ac>   DW_AT_decl_line   : 24
    <ad>   DW_AT_decl_column : 19
    <ae>   DW_AT_type        : <0x58>
 <1><b2>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b3>   DW_AT_type        : <0xa6>
 <1><b7>: Abbrev Number: 6 (DW_TAG_const_type)
    <b8>   DW_AT_type        : <0xa6>
 <1><bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <bd>   DW_AT_name        : (indirect string, offset: 0x9443e): uint16_t
    <c1>   DW_AT_decl_file   : 4
    <c2>   DW_AT_decl_line   : 36
    <c3>   DW_AT_decl_column : 20
    <c4>   DW_AT_type        : <0x72>
 <1><c8>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c9>   DW_AT_type        : <0xbc>
 <1><cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x939ed): uint32_t
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 48
    <d4>   DW_AT_decl_column : 20
    <d5>   DW_AT_type        : <0x8c>
 <1><d9>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <da>   DW_AT_type        : <0xcd>
 <1><de>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <df>   DW_AT_byte_size   : 4
    <e0>   DW_AT_type        : <0xe4>
 <1><e4>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e5>   DW_AT_prototyped  : 1
    <e5>   DW_AT_sibling     : <0xef>
 <2><e9>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ea>   DW_AT_type        : <0xef>
 <2><ee>: Abbrev Number: 0
 <1><ef>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <f0>   DW_AT_byte_size   : 4
 <1><f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f2>   DW_AT_byte_size   : 4
    <f3>   DW_AT_type        : <0xa6>
 <1><f7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f8>   DW_AT_byte_size   : 4
    <f9>   DW_AT_type        : <0xfd>
 <1><fd>: Abbrev Number: 4 (DW_TAG_base_type)
    <fe>   DW_AT_byte_size   : 1
    <ff>   DW_AT_encoding    : 8	(unsigned char)
    <100>   DW_AT_name        : (indirect string, offset: 0x412d5): char
 <1><104>: Abbrev Number: 6 (DW_TAG_const_type)
    <105>   DW_AT_type        : <0xfd>
 <1><109>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <10a>   DW_AT_byte_size   : 4
    <10b>   DW_AT_type        : <0x104>
 <1><10f>: Abbrev Number: 3 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0xb0b35): TaskHandle_t
    <114>   DW_AT_decl_file   : 5
    <115>   DW_AT_decl_line   : 70
    <116>   DW_AT_decl_column : 37
    <117>   DW_AT_type        : <0x11b>
 <1><11b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <11c>   DW_AT_byte_size   : 4
    <11d>   DW_AT_type        : <0x121>
 <1><121>: Abbrev Number: 11 (DW_TAG_structure_type)
    <122>   DW_AT_name        : (indirect string, offset: 0xacd25): tskTaskControlBlock
    <126>   DW_AT_declaration : 1
 <1><126>: Abbrev Number: 12 (DW_TAG_structure_type)
    <127>   DW_AT_byte_size   : 16
    <128>   DW_AT_decl_file   : 6
    <129>   DW_AT_decl_line   : 360
    <12b>   DW_AT_decl_column : 9
    <12c>   DW_AT_sibling     : <0x169>
 <2><130>: Abbrev Number: 13 (DW_TAG_member)
    <131>   DW_AT_name        : CCR
    <135>   DW_AT_decl_file   : 6
    <136>   DW_AT_decl_line   : 362
    <138>   DW_AT_decl_column : 17
    <139>   DW_AT_type        : <0xd9>
    <13d>   DW_AT_data_member_location: 0
 <2><13e>: Abbrev Number: 14 (DW_TAG_member)
    <13f>   DW_AT_name        : (indirect string, offset: 0x852ce): CNDTR
    <143>   DW_AT_decl_file   : 6
    <144>   DW_AT_decl_line   : 363
    <146>   DW_AT_decl_column : 17
    <147>   DW_AT_type        : <0xd9>
    <14b>   DW_AT_data_member_location: 4
 <2><14c>: Abbrev Number: 14 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0xc45b5): CPAR
    <151>   DW_AT_decl_file   : 6
    <152>   DW_AT_decl_line   : 364
    <154>   DW_AT_decl_column : 17
    <155>   DW_AT_type        : <0xd9>
    <159>   DW_AT_data_member_location: 8
 <2><15a>: Abbrev Number: 14 (DW_TAG_member)
    <15b>   DW_AT_name        : (indirect string, offset: 0x70f14): CMAR
    <15f>   DW_AT_decl_file   : 6
    <160>   DW_AT_decl_line   : 365
    <162>   DW_AT_decl_column : 17
    <163>   DW_AT_type        : <0xd9>
    <167>   DW_AT_data_member_location: 12
 <2><168>: Abbrev Number: 0
 <1><169>: Abbrev Number: 15 (DW_TAG_typedef)
    <16a>   DW_AT_name        : (indirect string, offset: 0xbf7c2): DMA_Channel_TypeDef
    <16e>   DW_AT_decl_file   : 6
    <16f>   DW_AT_decl_line   : 366
    <171>   DW_AT_decl_column : 3
    <172>   DW_AT_type        : <0x126>
 <1><176>: Abbrev Number: 12 (DW_TAG_structure_type)
    <177>   DW_AT_byte_size   : 8
    <178>   DW_AT_decl_file   : 6
    <179>   DW_AT_decl_line   : 368
    <17b>   DW_AT_decl_column : 9
    <17c>   DW_AT_sibling     : <0x19d>
 <2><180>: Abbrev Number: 13 (DW_TAG_member)
    <181>   DW_AT_name        : ISR
    <185>   DW_AT_decl_file   : 6
    <186>   DW_AT_decl_line   : 370
    <188>   DW_AT_decl_column : 17
    <189>   DW_AT_type        : <0xd9>
    <18d>   DW_AT_data_member_location: 0
 <2><18e>: Abbrev Number: 14 (DW_TAG_member)
    <18f>   DW_AT_name        : (indirect string, offset: 0x8e91a): IFCR
    <193>   DW_AT_decl_file   : 6
    <194>   DW_AT_decl_line   : 371
    <196>   DW_AT_decl_column : 17
    <197>   DW_AT_type        : <0xd9>
    <19b>   DW_AT_data_member_location: 4
 <2><19c>: Abbrev Number: 0
 <1><19d>: Abbrev Number: 15 (DW_TAG_typedef)
    <19e>   DW_AT_name        : (indirect string, offset: 0x49f04): DMA_TypeDef
    <1a2>   DW_AT_decl_file   : 6
    <1a3>   DW_AT_decl_line   : 372
    <1a5>   DW_AT_decl_column : 3
    <1a6>   DW_AT_type        : <0x176>
 <1><1aa>: Abbrev Number: 12 (DW_TAG_structure_type)
    <1ab>   DW_AT_byte_size   : 44
    <1ac>   DW_AT_decl_file   : 6
    <1ad>   DW_AT_decl_line   : 827
    <1af>   DW_AT_decl_column : 9
    <1b0>   DW_AT_sibling     : <0x287>
 <2><1b4>: Abbrev Number: 13 (DW_TAG_member)
    <1b5>   DW_AT_name        : CR1
    <1b9>   DW_AT_decl_file   : 6
    <1ba>   DW_AT_decl_line   : 829
    <1bc>   DW_AT_decl_column : 17
    <1bd>   DW_AT_type        : <0xd9>
    <1c1>   DW_AT_data_member_location: 0
 <2><1c2>: Abbrev Number: 13 (DW_TAG_member)
    <1c3>   DW_AT_name        : CR2
    <1c7>   DW_AT_decl_file   : 6
    <1c8>   DW_AT_decl_line   : 830
    <1ca>   DW_AT_decl_column : 17
    <1cb>   DW_AT_type        : <0xd9>
    <1cf>   DW_AT_data_member_location: 4
 <2><1d0>: Abbrev Number: 13 (DW_TAG_member)
    <1d1>   DW_AT_name        : CR3
    <1d5>   DW_AT_decl_file   : 6
    <1d6>   DW_AT_decl_line   : 831
    <1d8>   DW_AT_decl_column : 17
    <1d9>   DW_AT_type        : <0xd9>
    <1dd>   DW_AT_data_member_location: 8
 <2><1de>: Abbrev Number: 13 (DW_TAG_member)
    <1df>   DW_AT_name        : BRR
    <1e3>   DW_AT_decl_file   : 6
    <1e4>   DW_AT_decl_line   : 832
    <1e6>   DW_AT_decl_column : 17
    <1e7>   DW_AT_type        : <0xd9>
    <1eb>   DW_AT_data_member_location: 12
 <2><1ec>: Abbrev Number: 14 (DW_TAG_member)
    <1ed>   DW_AT_name        : (indirect string, offset: 0x38206): GTPR
    <1f1>   DW_AT_decl_file   : 6
    <1f2>   DW_AT_decl_line   : 833
    <1f4>   DW_AT_decl_column : 17
    <1f5>   DW_AT_type        : <0xc8>
    <1f9>   DW_AT_data_member_location: 16
 <2><1fa>: Abbrev Number: 14 (DW_TAG_member)
    <1fb>   DW_AT_name        : (indirect string, offset: 0xbf6ed): RESERVED2
    <1ff>   DW_AT_decl_file   : 6
    <200>   DW_AT_decl_line   : 834
    <202>   DW_AT_decl_column : 13
    <203>   DW_AT_type        : <0xbc>
    <207>   DW_AT_data_member_location: 18
 <2><208>: Abbrev Number: 14 (DW_TAG_member)
    <209>   DW_AT_name        : (indirect string, offset: 0x77f60): RTOR
    <20d>   DW_AT_decl_file   : 6
    <20e>   DW_AT_decl_line   : 835
    <210>   DW_AT_decl_column : 17
    <211>   DW_AT_type        : <0xd9>
    <215>   DW_AT_data_member_location: 20
 <2><216>: Abbrev Number: 13 (DW_TAG_member)
    <217>   DW_AT_name        : RQR
    <21b>   DW_AT_decl_file   : 6
    <21c>   DW_AT_decl_line   : 836
    <21e>   DW_AT_decl_column : 17
    <21f>   DW_AT_type        : <0xc8>
    <223>   DW_AT_data_member_location: 24
 <2><224>: Abbrev Number: 14 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0xbf6f7): RESERVED3
    <229>   DW_AT_decl_file   : 6
    <22a>   DW_AT_decl_line   : 837
    <22c>   DW_AT_decl_column : 13
    <22d>   DW_AT_type        : <0xbc>
    <231>   DW_AT_data_member_location: 26
 <2><232>: Abbrev Number: 13 (DW_TAG_member)
    <233>   DW_AT_name        : ISR
    <237>   DW_AT_decl_file   : 6
    <238>   DW_AT_decl_line   : 838
    <23a>   DW_AT_decl_column : 17
    <23b>   DW_AT_type        : <0xd9>
    <23f>   DW_AT_data_member_location: 28
 <2><240>: Abbrev Number: 13 (DW_TAG_member)
    <241>   DW_AT_name        : ICR
    <245>   DW_AT_decl_file   : 6
    <246>   DW_AT_decl_line   : 839
    <248>   DW_AT_decl_column : 17
    <249>   DW_AT_type        : <0xd9>
    <24d>   DW_AT_data_member_location: 32
 <2><24e>: Abbrev Number: 13 (DW_TAG_member)
    <24f>   DW_AT_name        : RDR
    <253>   DW_AT_decl_file   : 6
    <254>   DW_AT_decl_line   : 840
    <256>   DW_AT_decl_column : 17
    <257>   DW_AT_type        : <0xc8>
    <25b>   DW_AT_data_member_location: 36
 <2><25c>: Abbrev Number: 14 (DW_TAG_member)
    <25d>   DW_AT_name        : (indirect string, offset: 0x7904d): RESERVED4
    <261>   DW_AT_decl_file   : 6
    <262>   DW_AT_decl_line   : 841
    <264>   DW_AT_decl_column : 13
    <265>   DW_AT_type        : <0xbc>
    <269>   DW_AT_data_member_location: 38
 <2><26a>: Abbrev Number: 13 (DW_TAG_member)
    <26b>   DW_AT_name        : TDR
    <26f>   DW_AT_decl_file   : 6
    <270>   DW_AT_decl_line   : 842
    <272>   DW_AT_decl_column : 17
    <273>   DW_AT_type        : <0xc8>
    <277>   DW_AT_data_member_location: 40
 <2><278>: Abbrev Number: 14 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0xbf725): RESERVED5
    <27d>   DW_AT_decl_file   : 6
    <27e>   DW_AT_decl_line   : 843
    <280>   DW_AT_decl_column : 13
    <281>   DW_AT_type        : <0xbc>
    <285>   DW_AT_data_member_location: 42
 <2><286>: Abbrev Number: 0
 <1><287>: Abbrev Number: 15 (DW_TAG_typedef)
    <288>   DW_AT_name        : (indirect string, offset: 0xc9870): USART_TypeDef
    <28c>   DW_AT_decl_file   : 6
    <28d>   DW_AT_decl_line   : 844
    <28f>   DW_AT_decl_column : 3
    <290>   DW_AT_type        : <0x1aa>
 <1><294>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <295>   DW_AT_encoding    : 7	(unsigned)
    <296>   DW_AT_byte_size   : 1
    <297>   DW_AT_type        : <0x64>
    <29b>   DW_AT_decl_file   : 7
    <29c>   DW_AT_decl_line   : 39
    <29d>   DW_AT_decl_column : 1
    <29e>   DW_AT_sibling     : <0x2bb>
 <2><2a2>: Abbrev Number: 17 (DW_TAG_enumerator)
    <2a3>   DW_AT_name        : (indirect string, offset: 0x442e3): HAL_OK
    <2a7>   DW_AT_const_value : 0
 <2><2a8>: Abbrev Number: 17 (DW_TAG_enumerator)
    <2a9>   DW_AT_name        : (indirect string, offset: 0x7f6f9): HAL_ERROR
    <2ad>   DW_AT_const_value : 1
 <2><2ae>: Abbrev Number: 17 (DW_TAG_enumerator)
    <2af>   DW_AT_name        : (indirect string, offset: 0x2373f): HAL_BUSY
    <2b3>   DW_AT_const_value : 2
 <2><2b4>: Abbrev Number: 17 (DW_TAG_enumerator)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x3b080): HAL_TIMEOUT
    <2b9>   DW_AT_const_value : 3
 <2><2ba>: Abbrev Number: 0
 <1><2bb>: Abbrev Number: 3 (DW_TAG_typedef)
    <2bc>   DW_AT_name        : (indirect string, offset: 0x2488): HAL_StatusTypeDef
    <2c0>   DW_AT_decl_file   : 7
    <2c1>   DW_AT_decl_line   : 44
    <2c2>   DW_AT_decl_column : 3
    <2c3>   DW_AT_type        : <0x294>
 <1><2c7>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <2c8>   DW_AT_encoding    : 7	(unsigned)
    <2c9>   DW_AT_byte_size   : 1
    <2ca>   DW_AT_type        : <0x64>
    <2ce>   DW_AT_decl_file   : 7
    <2cf>   DW_AT_decl_line   : 50
    <2d0>   DW_AT_decl_column : 1
    <2d1>   DW_AT_sibling     : <0x2e2>
 <2><2d5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x9635c): HAL_UNLOCKED
    <2da>   DW_AT_const_value : 0
 <2><2db>: Abbrev Number: 17 (DW_TAG_enumerator)
    <2dc>   DW_AT_name        : (indirect string, offset: 0xcb27b): HAL_LOCKED
    <2e0>   DW_AT_const_value : 1
 <2><2e1>: Abbrev Number: 0
 <1><2e2>: Abbrev Number: 3 (DW_TAG_typedef)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x77edd): HAL_LockTypeDef
    <2e7>   DW_AT_decl_file   : 7
    <2e8>   DW_AT_decl_line   : 53
    <2e9>   DW_AT_decl_column : 3
    <2ea>   DW_AT_type        : <0x2c7>
 <1><2ee>: Abbrev Number: 18 (DW_TAG_structure_type)
    <2ef>   DW_AT_byte_size   : 32
    <2f0>   DW_AT_decl_file   : 8
    <2f1>   DW_AT_decl_line   : 46
    <2f2>   DW_AT_decl_column : 9
    <2f3>   DW_AT_sibling     : <0x360>
 <2><2f7>: Abbrev Number: 19 (DW_TAG_member)
    <2f8>   DW_AT_name        : (indirect string, offset: 0xb62a1): Request
    <2fc>   DW_AT_decl_file   : 8
    <2fd>   DW_AT_decl_line   : 48
    <2fe>   DW_AT_decl_column : 12
    <2ff>   DW_AT_type        : <0xcd>
    <303>   DW_AT_data_member_location: 0
 <2><304>: Abbrev Number: 19 (DW_TAG_member)
    <305>   DW_AT_name        : (indirect string, offset: 0xce788): Direction
    <309>   DW_AT_decl_file   : 8
    <30a>   DW_AT_decl_line   : 51
    <30b>   DW_AT_decl_column : 12
    <30c>   DW_AT_type        : <0xcd>
    <310>   DW_AT_data_member_location: 4
 <2><311>: Abbrev Number: 19 (DW_TAG_member)
    <312>   DW_AT_name        : (indirect string, offset: 0xdcf9): PeriphInc
    <316>   DW_AT_decl_file   : 8
    <317>   DW_AT_decl_line   : 55
    <318>   DW_AT_decl_column : 12
    <319>   DW_AT_type        : <0xcd>
    <31d>   DW_AT_data_member_location: 8
 <2><31e>: Abbrev Number: 19 (DW_TAG_member)
    <31f>   DW_AT_name        : (indirect string, offset: 0x1f8c4): MemInc
    <323>   DW_AT_decl_file   : 8
    <324>   DW_AT_decl_line   : 58
    <325>   DW_AT_decl_column : 12
    <326>   DW_AT_type        : <0xcd>
    <32a>   DW_AT_data_member_location: 12
 <2><32b>: Abbrev Number: 19 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0x65947): PeriphDataAlignment
    <330>   DW_AT_decl_file   : 8
    <331>   DW_AT_decl_line   : 61
    <332>   DW_AT_decl_column : 12
    <333>   DW_AT_type        : <0xcd>
    <337>   DW_AT_data_member_location: 16
 <2><338>: Abbrev Number: 19 (DW_TAG_member)
    <339>   DW_AT_name        : (indirect string, offset: 0xb7762): MemDataAlignment
    <33d>   DW_AT_decl_file   : 8
    <33e>   DW_AT_decl_line   : 64
    <33f>   DW_AT_decl_column : 12
    <340>   DW_AT_type        : <0xcd>
    <344>   DW_AT_data_member_location: 20
 <2><345>: Abbrev Number: 19 (DW_TAG_member)
    <346>   DW_AT_name        : (indirect string, offset: 0xcdaef): Mode
    <34a>   DW_AT_decl_file   : 8
    <34b>   DW_AT_decl_line   : 67
    <34c>   DW_AT_decl_column : 12
    <34d>   DW_AT_type        : <0xcd>
    <351>   DW_AT_data_member_location: 24
 <2><352>: Abbrev Number: 19 (DW_TAG_member)
    <353>   DW_AT_name        : (indirect string, offset: 0xcd5b1): Priority
    <357>   DW_AT_decl_file   : 8
    <358>   DW_AT_decl_line   : 72
    <359>   DW_AT_decl_column : 12
    <35a>   DW_AT_type        : <0xcd>
    <35e>   DW_AT_data_member_location: 28
 <2><35f>: Abbrev Number: 0
 <1><360>: Abbrev Number: 3 (DW_TAG_typedef)
    <361>   DW_AT_name        : (indirect string, offset: 0x36804): DMA_InitTypeDef
    <365>   DW_AT_decl_file   : 8
    <366>   DW_AT_decl_line   : 74
    <367>   DW_AT_decl_column : 3
    <368>   DW_AT_type        : <0x2ee>
 <1><36c>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <36d>   DW_AT_encoding    : 7	(unsigned)
    <36e>   DW_AT_byte_size   : 1
    <36f>   DW_AT_type        : <0x64>
    <373>   DW_AT_decl_file   : 8
    <374>   DW_AT_decl_line   : 80
    <375>   DW_AT_decl_column : 1
    <376>   DW_AT_sibling     : <0x393>
 <2><37a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <37b>   DW_AT_name        : (indirect string, offset: 0x975a0): HAL_DMA_STATE_RESET
    <37f>   DW_AT_const_value : 0
 <2><380>: Abbrev Number: 17 (DW_TAG_enumerator)
    <381>   DW_AT_name        : (indirect string, offset: 0x37a89): HAL_DMA_STATE_READY
    <385>   DW_AT_const_value : 1
 <2><386>: Abbrev Number: 17 (DW_TAG_enumerator)
    <387>   DW_AT_name        : (indirect string, offset: 0x8d262): HAL_DMA_STATE_BUSY
    <38b>   DW_AT_const_value : 2
 <2><38c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <38d>   DW_AT_name        : (indirect string, offset: 0xc8232): HAL_DMA_STATE_TIMEOUT
    <391>   DW_AT_const_value : 3
 <2><392>: Abbrev Number: 0
 <1><393>: Abbrev Number: 3 (DW_TAG_typedef)
    <394>   DW_AT_name        : (indirect string, offset: 0x70795): HAL_DMA_StateTypeDef
    <398>   DW_AT_decl_file   : 8
    <399>   DW_AT_decl_line   : 85
    <39a>   DW_AT_decl_column : 2
    <39b>   DW_AT_type        : <0x36c>
 <1><39f>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <3a0>   DW_AT_type        : <0x393>
 <1><3a4>: Abbrev Number: 20 (DW_TAG_structure_type)
    <3a5>   DW_AT_name        : (indirect string, offset: 0xacfc2): __DMA_HandleTypeDef
    <3a9>   DW_AT_byte_size   : 72
    <3aa>   DW_AT_decl_file   : 8
    <3ab>   DW_AT_decl_line   : 112
    <3ac>   DW_AT_decl_column : 16
    <3ad>   DW_AT_sibling     : <0x44e>
 <2><3b1>: Abbrev Number: 19 (DW_TAG_member)
    <3b2>   DW_AT_name        : (indirect string, offset: 0xa5b4a): Instance
    <3b6>   DW_AT_decl_file   : 8
    <3b7>   DW_AT_decl_line   : 114
    <3b8>   DW_AT_decl_column : 27
    <3b9>   DW_AT_type        : <0x44e>
    <3bd>   DW_AT_data_member_location: 0
 <2><3be>: Abbrev Number: 19 (DW_TAG_member)
    <3bf>   DW_AT_name        : (indirect string, offset: 0xce77a): Init
    <3c3>   DW_AT_decl_file   : 8
    <3c4>   DW_AT_decl_line   : 116
    <3c5>   DW_AT_decl_column : 25
    <3c6>   DW_AT_type        : <0x360>
    <3ca>   DW_AT_data_member_location: 4
 <2><3cb>: Abbrev Number: 19 (DW_TAG_member)
    <3cc>   DW_AT_name        : (indirect string, offset: 0x90ed9): Lock
    <3d0>   DW_AT_decl_file   : 8
    <3d1>   DW_AT_decl_line   : 118
    <3d2>   DW_AT_decl_column : 25
    <3d3>   DW_AT_type        : <0x2e2>
    <3d7>   DW_AT_data_member_location: 36
 <2><3d8>: Abbrev Number: 19 (DW_TAG_member)
    <3d9>   DW_AT_name        : (indirect string, offset: 0xcf805): State
    <3dd>   DW_AT_decl_file   : 8
    <3de>   DW_AT_decl_line   : 120
    <3df>   DW_AT_decl_column : 30
    <3e0>   DW_AT_type        : <0x39f>
    <3e4>   DW_AT_data_member_location: 37
 <2><3e5>: Abbrev Number: 19 (DW_TAG_member)
    <3e6>   DW_AT_name        : (indirect string, offset: 0xc13b5): Parent
    <3ea>   DW_AT_decl_file   : 8
    <3eb>   DW_AT_decl_line   : 122
    <3ec>   DW_AT_decl_column : 26
    <3ed>   DW_AT_type        : <0xef>
    <3f1>   DW_AT_data_member_location: 40
 <2><3f2>: Abbrev Number: 19 (DW_TAG_member)
    <3f3>   DW_AT_name        : (indirect string, offset: 0xca425): XferCpltCallback
    <3f7>   DW_AT_decl_file   : 8
    <3f8>   DW_AT_decl_line   : 124
    <3f9>   DW_AT_decl_column : 28
    <3fa>   DW_AT_type        : <0x465>
    <3fe>   DW_AT_data_member_location: 44
 <2><3ff>: Abbrev Number: 19 (DW_TAG_member)
    <400>   DW_AT_name        : (indirect string, offset: 0x9de5a): XferHalfCpltCallback
    <404>   DW_AT_decl_file   : 8
    <405>   DW_AT_decl_line   : 126
    <406>   DW_AT_decl_column : 28
    <407>   DW_AT_type        : <0x465>
    <40b>   DW_AT_data_member_location: 48
 <2><40c>: Abbrev Number: 19 (DW_TAG_member)
    <40d>   DW_AT_name        : (indirect string, offset: 0x1cfdb): XferErrorCallback
    <411>   DW_AT_decl_file   : 8
    <412>   DW_AT_decl_line   : 128
    <413>   DW_AT_decl_column : 28
    <414>   DW_AT_type        : <0x465>
    <418>   DW_AT_data_member_location: 52
 <2><419>: Abbrev Number: 19 (DW_TAG_member)
    <41a>   DW_AT_name        : (indirect string, offset: 0xbd845): XferAbortCallback
    <41e>   DW_AT_decl_file   : 8
    <41f>   DW_AT_decl_line   : 130
    <420>   DW_AT_decl_column : 28
    <421>   DW_AT_type        : <0x465>
    <425>   DW_AT_data_member_location: 56
 <2><426>: Abbrev Number: 19 (DW_TAG_member)
    <427>   DW_AT_name        : (indirect string, offset: 0xc6d27): ErrorCode
    <42b>   DW_AT_decl_file   : 8
    <42c>   DW_AT_decl_line   : 132
    <42d>   DW_AT_decl_column : 25
    <42e>   DW_AT_type        : <0xd9>
    <432>   DW_AT_data_member_location: 60
 <2><433>: Abbrev Number: 19 (DW_TAG_member)
    <434>   DW_AT_name        : (indirect string, offset: 0x527dd): DmaBaseAddress
    <438>   DW_AT_decl_file   : 8
    <439>   DW_AT_decl_line   : 134
    <43a>   DW_AT_decl_column : 26
    <43b>   DW_AT_type        : <0x46b>
    <43f>   DW_AT_data_member_location: 64
 <2><440>: Abbrev Number: 19 (DW_TAG_member)
    <441>   DW_AT_name        : (indirect string, offset: 0xbc643): ChannelIndex
    <445>   DW_AT_decl_file   : 8
    <446>   DW_AT_decl_line   : 136
    <447>   DW_AT_decl_column : 25
    <448>   DW_AT_type        : <0xcd>
    <44c>   DW_AT_data_member_location: 68
 <2><44d>: Abbrev Number: 0
 <1><44e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <44f>   DW_AT_byte_size   : 4
    <450>   DW_AT_type        : <0x169>
 <1><454>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <455>   DW_AT_prototyped  : 1
    <455>   DW_AT_sibling     : <0x45f>
 <2><459>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <45a>   DW_AT_type        : <0x45f>
 <2><45e>: Abbrev Number: 0
 <1><45f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <460>   DW_AT_byte_size   : 4
    <461>   DW_AT_type        : <0x3a4>
 <1><465>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <466>   DW_AT_byte_size   : 4
    <467>   DW_AT_type        : <0x454>
 <1><46b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <46c>   DW_AT_byte_size   : 4
    <46d>   DW_AT_type        : <0x19d>
 <1><471>: Abbrev Number: 3 (DW_TAG_typedef)
    <472>   DW_AT_name        : (indirect string, offset: 0xacfc4): DMA_HandleTypeDef
    <476>   DW_AT_decl_file   : 8
    <477>   DW_AT_decl_line   : 153
    <478>   DW_AT_decl_column : 2
    <479>   DW_AT_type        : <0x3a4>
 <1><47d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <47e>   DW_AT_byte_size   : 4
    <47f>   DW_AT_type        : <0x471>
 <1><483>: Abbrev Number: 18 (DW_TAG_structure_type)
    <484>   DW_AT_byte_size   : 32
    <485>   DW_AT_decl_file   : 9
    <486>   DW_AT_decl_line   : 46
    <487>   DW_AT_decl_column : 9
    <488>   DW_AT_sibling     : <0x4f5>
 <2><48c>: Abbrev Number: 19 (DW_TAG_member)
    <48d>   DW_AT_name        : (indirect string, offset: 0xb9c25): BaudRate
    <491>   DW_AT_decl_file   : 9
    <492>   DW_AT_decl_line   : 48
    <493>   DW_AT_decl_column : 12
    <494>   DW_AT_type        : <0xcd>
    <498>   DW_AT_data_member_location: 0
 <2><499>: Abbrev Number: 19 (DW_TAG_member)
    <49a>   DW_AT_name        : (indirect string, offset: 0x5fb3): WordLength
    <49e>   DW_AT_decl_file   : 9
    <49f>   DW_AT_decl_line   : 68
    <4a0>   DW_AT_decl_column : 12
    <4a1>   DW_AT_type        : <0xcd>
    <4a5>   DW_AT_data_member_location: 4
 <2><4a6>: Abbrev Number: 19 (DW_TAG_member)
    <4a7>   DW_AT_name        : (indirect string, offset: 0xb9f40): StopBits
    <4ab>   DW_AT_decl_file   : 9
    <4ac>   DW_AT_decl_line   : 71
    <4ad>   DW_AT_decl_column : 12
    <4ae>   DW_AT_type        : <0xcd>
    <4b2>   DW_AT_data_member_location: 8
 <2><4b3>: Abbrev Number: 19 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x39b0b): Parity
    <4b8>   DW_AT_decl_file   : 9
    <4b9>   DW_AT_decl_line   : 74
    <4ba>   DW_AT_decl_column : 12
    <4bb>   DW_AT_type        : <0xcd>
    <4bf>   DW_AT_data_member_location: 12
 <2><4c0>: Abbrev Number: 19 (DW_TAG_member)
    <4c1>   DW_AT_name        : (indirect string, offset: 0xcdaef): Mode
    <4c5>   DW_AT_decl_file   : 9
    <4c6>   DW_AT_decl_line   : 81
    <4c7>   DW_AT_decl_column : 12
    <4c8>   DW_AT_type        : <0xcd>
    <4cc>   DW_AT_data_member_location: 16
 <2><4cd>: Abbrev Number: 19 (DW_TAG_member)
    <4ce>   DW_AT_name        : (indirect string, offset: 0x6dc0c): HwFlowCtl
    <4d2>   DW_AT_decl_file   : 9
    <4d3>   DW_AT_decl_line   : 84
    <4d4>   DW_AT_decl_column : 12
    <4d5>   DW_AT_type        : <0xcd>
    <4d9>   DW_AT_data_member_location: 20
 <2><4da>: Abbrev Number: 19 (DW_TAG_member)
    <4db>   DW_AT_name        : (indirect string, offset: 0xaa5df): OverSampling
    <4df>   DW_AT_decl_file   : 9
    <4e0>   DW_AT_decl_line   : 88
    <4e1>   DW_AT_decl_column : 12
    <4e2>   DW_AT_type        : <0xcd>
    <4e6>   DW_AT_data_member_location: 24
 <2><4e7>: Abbrev Number: 19 (DW_TAG_member)
    <4e8>   DW_AT_name        : (indirect string, offset: 0x2908a): OneBitSampling
    <4ec>   DW_AT_decl_file   : 9
    <4ed>   DW_AT_decl_line   : 92
    <4ee>   DW_AT_decl_column : 12
    <4ef>   DW_AT_type        : <0xcd>
    <4f3>   DW_AT_data_member_location: 28
 <2><4f4>: Abbrev Number: 0
 <1><4f5>: Abbrev Number: 3 (DW_TAG_typedef)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x6b292): UART_InitTypeDef
    <4fa>   DW_AT_decl_file   : 9
    <4fb>   DW_AT_decl_line   : 101
    <4fc>   DW_AT_decl_column : 3
    <4fd>   DW_AT_type        : <0x483>
 <1><501>: Abbrev Number: 18 (DW_TAG_structure_type)
    <502>   DW_AT_byte_size   : 40
    <503>   DW_AT_decl_file   : 9
    <504>   DW_AT_decl_line   : 106
    <505>   DW_AT_decl_column : 9
    <506>   DW_AT_sibling     : <0x58d>
 <2><50a>: Abbrev Number: 19 (DW_TAG_member)
    <50b>   DW_AT_name        : (indirect string, offset: 0x2796b): AdvFeatureInit
    <50f>   DW_AT_decl_file   : 9
    <510>   DW_AT_decl_line   : 108
    <511>   DW_AT_decl_column : 12
    <512>   DW_AT_type        : <0xcd>
    <516>   DW_AT_data_member_location: 0
 <2><517>: Abbrev Number: 19 (DW_TAG_member)
    <518>   DW_AT_name        : (indirect string, offset: 0xbd271): TxPinLevelInvert
    <51c>   DW_AT_decl_file   : 9
    <51d>   DW_AT_decl_line   : 113
    <51e>   DW_AT_decl_column : 12
    <51f>   DW_AT_type        : <0xcd>
    <523>   DW_AT_data_member_location: 4
 <2><524>: Abbrev Number: 19 (DW_TAG_member)
    <525>   DW_AT_name        : (indirect string, offset: 0xaa8bb): RxPinLevelInvert
    <529>   DW_AT_decl_file   : 9
    <52a>   DW_AT_decl_line   : 116
    <52b>   DW_AT_decl_column : 12
    <52c>   DW_AT_type        : <0xcd>
    <530>   DW_AT_data_member_location: 8
 <2><531>: Abbrev Number: 19 (DW_TAG_member)
    <532>   DW_AT_name        : (indirect string, offset: 0x89392): DataInvert
    <536>   DW_AT_decl_file   : 9
    <537>   DW_AT_decl_line   : 119
    <538>   DW_AT_decl_column : 12
    <539>   DW_AT_type        : <0xcd>
    <53d>   DW_AT_data_member_location: 12
 <2><53e>: Abbrev Number: 19 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0x403ee): Swap
    <543>   DW_AT_decl_file   : 9
    <544>   DW_AT_decl_line   : 123
    <545>   DW_AT_decl_column : 12
    <546>   DW_AT_type        : <0xcd>
    <54a>   DW_AT_data_member_location: 16
 <2><54b>: Abbrev Number: 19 (DW_TAG_member)
    <54c>   DW_AT_name        : (indirect string, offset: 0x27c0f): OverrunDisable
    <550>   DW_AT_decl_file   : 9
    <551>   DW_AT_decl_line   : 126
    <552>   DW_AT_decl_column : 12
    <553>   DW_AT_type        : <0xcd>
    <557>   DW_AT_data_member_location: 20
 <2><558>: Abbrev Number: 19 (DW_TAG_member)
    <559>   DW_AT_name        : (indirect string, offset: 0x75bd): DMADisableonRxError
    <55d>   DW_AT_decl_file   : 9
    <55e>   DW_AT_decl_line   : 129
    <55f>   DW_AT_decl_column : 12
    <560>   DW_AT_type        : <0xcd>
    <564>   DW_AT_data_member_location: 24
 <2><565>: Abbrev Number: 19 (DW_TAG_member)
    <566>   DW_AT_name        : (indirect string, offset: 0xb7d73): AutoBaudRateEnable
    <56a>   DW_AT_decl_file   : 9
    <56b>   DW_AT_decl_line   : 132
    <56c>   DW_AT_decl_column : 12
    <56d>   DW_AT_type        : <0xcd>
    <571>   DW_AT_data_member_location: 28
 <2><572>: Abbrev Number: 19 (DW_TAG_member)
    <573>   DW_AT_name        : (indirect string, offset: 0x27499): AutoBaudRateMode
    <577>   DW_AT_decl_file   : 9
    <578>   DW_AT_decl_line   : 135
    <579>   DW_AT_decl_column : 12
    <57a>   DW_AT_type        : <0xcd>
    <57e>   DW_AT_data_member_location: 32
 <2><57f>: Abbrev Number: 19 (DW_TAG_member)
    <580>   DW_AT_name        : (indirect string, offset: 0x5a158): MSBFirst
    <584>   DW_AT_decl_file   : 9
    <585>   DW_AT_decl_line   : 139
    <586>   DW_AT_decl_column : 12
    <587>   DW_AT_type        : <0xcd>
    <58b>   DW_AT_data_member_location: 36
 <2><58c>: Abbrev Number: 0
 <1><58d>: Abbrev Number: 3 (DW_TAG_typedef)
    <58e>   DW_AT_name        : (indirect string, offset: 0x973b8): UART_AdvFeatureInitTypeDef
    <592>   DW_AT_decl_file   : 9
    <593>   DW_AT_decl_line   : 141
    <594>   DW_AT_decl_column : 3
    <595>   DW_AT_type        : <0x501>
 <1><599>: Abbrev Number: 3 (DW_TAG_typedef)
    <59a>   DW_AT_name        : (indirect string, offset: 0x3d83f): HAL_UART_StateTypeDef
    <59e>   DW_AT_decl_file   : 9
    <59f>   DW_AT_decl_line   : 183
    <5a0>   DW_AT_decl_column : 18
    <5a1>   DW_AT_type        : <0xcd>
 <1><5a5>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <5a6>   DW_AT_type        : <0x599>
 <1><5aa>: Abbrev Number: 3 (DW_TAG_typedef)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x533bb): HAL_UART_RxTypeTypeDef
    <5af>   DW_AT_decl_file   : 9
    <5b0>   DW_AT_decl_line   : 207
    <5b1>   DW_AT_decl_column : 18
    <5b2>   DW_AT_type        : <0xcd>
 <1><5b6>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <5b7>   DW_AT_type        : <0x5aa>
 <1><5bb>: Abbrev Number: 20 (DW_TAG_structure_type)
    <5bc>   DW_AT_name        : (indirect string, offset: 0x7603f): __UART_HandleTypeDef
    <5c0>   DW_AT_byte_size   : 132
    <5c1>   DW_AT_decl_file   : 9
    <5c2>   DW_AT_decl_line   : 212
    <5c3>   DW_AT_decl_column : 16
    <5c4>   DW_AT_sibling     : <0x6c2>
 <2><5c8>: Abbrev Number: 19 (DW_TAG_member)
    <5c9>   DW_AT_name        : (indirect string, offset: 0xa5b4a): Instance
    <5cd>   DW_AT_decl_file   : 9
    <5ce>   DW_AT_decl_line   : 214
    <5cf>   DW_AT_decl_column : 29
    <5d0>   DW_AT_type        : <0x6c2>
    <5d4>   DW_AT_data_member_location: 0
 <2><5d5>: Abbrev Number: 19 (DW_TAG_member)
    <5d6>   DW_AT_name        : (indirect string, offset: 0xce77a): Init
    <5da>   DW_AT_decl_file   : 9
    <5db>   DW_AT_decl_line   : 216
    <5dc>   DW_AT_decl_column : 28
    <5dd>   DW_AT_type        : <0x4f5>
    <5e1>   DW_AT_data_member_location: 4
 <2><5e2>: Abbrev Number: 19 (DW_TAG_member)
    <5e3>   DW_AT_name        : (indirect string, offset: 0x9eb7e): AdvancedInit
    <5e7>   DW_AT_decl_file   : 9
    <5e8>   DW_AT_decl_line   : 218
    <5e9>   DW_AT_decl_column : 30
    <5ea>   DW_AT_type        : <0x58d>
    <5ee>   DW_AT_data_member_location: 36
 <2><5ef>: Abbrev Number: 19 (DW_TAG_member)
    <5f0>   DW_AT_name        : (indirect string, offset: 0x6193d): pTxBuffPtr
    <5f4>   DW_AT_decl_file   : 9
    <5f5>   DW_AT_decl_line   : 220
    <5f6>   DW_AT_decl_column : 29
    <5f7>   DW_AT_type        : <0x6c8>
    <5fb>   DW_AT_data_member_location: 76
 <2><5fc>: Abbrev Number: 19 (DW_TAG_member)
    <5fd>   DW_AT_name        : (indirect string, offset: 0x55b13): TxXferSize
    <601>   DW_AT_decl_file   : 9
    <602>   DW_AT_decl_line   : 222
    <603>   DW_AT_decl_column : 28
    <604>   DW_AT_type        : <0xbc>
    <608>   DW_AT_data_member_location: 80
 <2><609>: Abbrev Number: 19 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0x6fb17): TxXferCount
    <60e>   DW_AT_decl_file   : 9
    <60f>   DW_AT_decl_line   : 224
    <610>   DW_AT_decl_column : 28
    <611>   DW_AT_type        : <0xc8>
    <615>   DW_AT_data_member_location: 82
 <2><616>: Abbrev Number: 19 (DW_TAG_member)
    <617>   DW_AT_name        : (indirect string, offset: 0xbca67): pRxBuffPtr
    <61b>   DW_AT_decl_file   : 9
    <61c>   DW_AT_decl_line   : 226
    <61d>   DW_AT_decl_column : 29
    <61e>   DW_AT_type        : <0xf1>
    <622>   DW_AT_data_member_location: 84
 <2><623>: Abbrev Number: 19 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0x659c6): RxXferSize
    <628>   DW_AT_decl_file   : 9
    <629>   DW_AT_decl_line   : 228
    <62a>   DW_AT_decl_column : 28
    <62b>   DW_AT_type        : <0xbc>
    <62f>   DW_AT_data_member_location: 88
 <2><630>: Abbrev Number: 19 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0x7a590): RxXferCount
    <635>   DW_AT_decl_file   : 9
    <636>   DW_AT_decl_line   : 230
    <637>   DW_AT_decl_column : 28
    <638>   DW_AT_type        : <0xc8>
    <63c>   DW_AT_data_member_location: 90
 <2><63d>: Abbrev Number: 19 (DW_TAG_member)
    <63e>   DW_AT_name        : (indirect string, offset: 0xcfd2b): Mask
    <642>   DW_AT_decl_file   : 9
    <643>   DW_AT_decl_line   : 232
    <644>   DW_AT_decl_column : 28
    <645>   DW_AT_type        : <0xbc>
    <649>   DW_AT_data_member_location: 92
 <2><64a>: Abbrev Number: 19 (DW_TAG_member)
    <64b>   DW_AT_name        : (indirect string, offset: 0xa99b2): ReceptionType
    <64f>   DW_AT_decl_file   : 9
    <650>   DW_AT_decl_line   : 243
    <651>   DW_AT_decl_column : 31
    <652>   DW_AT_type        : <0x5b6>
    <656>   DW_AT_data_member_location: 96
 <2><657>: Abbrev Number: 19 (DW_TAG_member)
    <658>   DW_AT_name        : (indirect string, offset: 0xaf090): RxISR
    <65c>   DW_AT_decl_file   : 9
    <65d>   DW_AT_decl_line   : 245
    <65e>   DW_AT_decl_column : 10
    <65f>   DW_AT_type        : <0x6df>
    <663>   DW_AT_data_member_location: 100
 <2><664>: Abbrev Number: 19 (DW_TAG_member)
    <665>   DW_AT_name        : (indirect string, offset: 0x66442): TxISR
    <669>   DW_AT_decl_file   : 9
    <66a>   DW_AT_decl_line   : 247
    <66b>   DW_AT_decl_column : 10
    <66c>   DW_AT_type        : <0x6df>
    <670>   DW_AT_data_member_location: 104
 <2><671>: Abbrev Number: 19 (DW_TAG_member)
    <672>   DW_AT_name        : (indirect string, offset: 0xa694a): hdmatx
    <676>   DW_AT_decl_file   : 9
    <677>   DW_AT_decl_line   : 249
    <678>   DW_AT_decl_column : 29
    <679>   DW_AT_type        : <0x47d>
    <67d>   DW_AT_data_member_location: 108
 <2><67e>: Abbrev Number: 19 (DW_TAG_member)
    <67f>   DW_AT_name        : (indirect string, offset: 0xc53c6): hdmarx
    <683>   DW_AT_decl_file   : 9
    <684>   DW_AT_decl_line   : 251
    <685>   DW_AT_decl_column : 29
    <686>   DW_AT_type        : <0x47d>
    <68a>   DW_AT_data_member_location: 112
 <2><68b>: Abbrev Number: 19 (DW_TAG_member)
    <68c>   DW_AT_name        : (indirect string, offset: 0x90ed9): Lock
    <690>   DW_AT_decl_file   : 9
    <691>   DW_AT_decl_line   : 253
    <692>   DW_AT_decl_column : 29
    <693>   DW_AT_type        : <0x2e2>
    <697>   DW_AT_data_member_location: 116
 <2><698>: Abbrev Number: 19 (DW_TAG_member)
    <699>   DW_AT_name        : (indirect string, offset: 0x52abe): gState
    <69d>   DW_AT_decl_file   : 9
    <69e>   DW_AT_decl_line   : 255
    <69f>   DW_AT_decl_column : 33
    <6a0>   DW_AT_type        : <0x5a5>
    <6a4>   DW_AT_data_member_location: 120
 <2><6a5>: Abbrev Number: 14 (DW_TAG_member)
    <6a6>   DW_AT_name        : (indirect string, offset: 0xb7028): RxState
    <6aa>   DW_AT_decl_file   : 9
    <6ab>   DW_AT_decl_line   : 259
    <6ad>   DW_AT_decl_column : 33
    <6ae>   DW_AT_type        : <0x5a5>
    <6b2>   DW_AT_data_member_location: 124
 <2><6b3>: Abbrev Number: 14 (DW_TAG_member)
    <6b4>   DW_AT_name        : (indirect string, offset: 0xc6d27): ErrorCode
    <6b8>   DW_AT_decl_file   : 9
    <6b9>   DW_AT_decl_line   : 262
    <6bb>   DW_AT_decl_column : 33
    <6bc>   DW_AT_type        : <0xd9>
    <6c0>   DW_AT_data_member_location: 128
 <2><6c1>: Abbrev Number: 0
 <1><6c2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6c3>   DW_AT_byte_size   : 4
    <6c4>   DW_AT_type        : <0x287>
 <1><6c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6c9>   DW_AT_byte_size   : 4
    <6ca>   DW_AT_type        : <0xb7>
 <1><6ce>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <6cf>   DW_AT_prototyped  : 1
    <6cf>   DW_AT_sibling     : <0x6d9>
 <2><6d3>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <6d4>   DW_AT_type        : <0x6d9>
 <2><6d8>: Abbrev Number: 0
 <1><6d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6da>   DW_AT_byte_size   : 4
    <6db>   DW_AT_type        : <0x5bb>
 <1><6df>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6e0>   DW_AT_byte_size   : 4
    <6e1>   DW_AT_type        : <0x6ce>
 <1><6e5>: Abbrev Number: 15 (DW_TAG_typedef)
    <6e6>   DW_AT_name        : (indirect string, offset: 0x76041): UART_HandleTypeDef
    <6ea>   DW_AT_decl_file   : 9
    <6eb>   DW_AT_decl_line   : 284
    <6ed>   DW_AT_decl_column : 3
    <6ee>   DW_AT_type        : <0x5bb>
 <1><6f2>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <6f3>   DW_AT_encoding    : 5	(signed)
    <6f4>   DW_AT_byte_size   : 4
    <6f5>   DW_AT_type        : <0x29>
    <6f9>   DW_AT_decl_file   : 10
    <6fa>   DW_AT_decl_line   : 82
    <6fb>   DW_AT_decl_column : 14
    <6fc>   DW_AT_sibling     : <0x842>
 <2><700>: Abbrev Number: 17 (DW_TAG_enumerator)
    <701>   DW_AT_name        : (indirect string, offset: 0x3bf80): osPriorityNone
    <705>   DW_AT_const_value : 0
 <2><706>: Abbrev Number: 17 (DW_TAG_enumerator)
    <707>   DW_AT_name        : (indirect string, offset: 0xb05d2): osPriorityIdle
    <70b>   DW_AT_const_value : 1
 <2><70c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <70d>   DW_AT_name        : (indirect string, offset: 0xbb34d): osPriorityLow
    <711>   DW_AT_const_value : 8
 <2><712>: Abbrev Number: 17 (DW_TAG_enumerator)
    <713>   DW_AT_name        : (indirect string, offset: 0xa25f1): osPriorityLow1
    <717>   DW_AT_const_value : 9
 <2><718>: Abbrev Number: 17 (DW_TAG_enumerator)
    <719>   DW_AT_name        : (indirect string, offset: 0xc0d3a): osPriorityLow2
    <71d>   DW_AT_const_value : 10
 <2><71e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <71f>   DW_AT_name        : (indirect string, offset: 0xc0d49): osPriorityLow3
    <723>   DW_AT_const_value : 11
 <2><724>: Abbrev Number: 17 (DW_TAG_enumerator)
    <725>   DW_AT_name        : (indirect string, offset: 0xc0d58): osPriorityLow4
    <729>   DW_AT_const_value : 12
 <2><72a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <72b>   DW_AT_name        : (indirect string, offset: 0xc0d67): osPriorityLow5
    <72f>   DW_AT_const_value : 13
 <2><730>: Abbrev Number: 17 (DW_TAG_enumerator)
    <731>   DW_AT_name        : (indirect string, offset: 0xc0d76): osPriorityLow6
    <735>   DW_AT_const_value : 14
 <2><736>: Abbrev Number: 17 (DW_TAG_enumerator)
    <737>   DW_AT_name        : (indirect string, offset: 0x4bb3b): osPriorityLow7
    <73b>   DW_AT_const_value : 15
 <2><73c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <73d>   DW_AT_name        : (indirect string, offset: 0xc33aa): osPriorityBelowNormal
    <741>   DW_AT_const_value : 16
 <2><742>: Abbrev Number: 17 (DW_TAG_enumerator)
    <743>   DW_AT_name        : (indirect string, offset: 0x7a1c4): osPriorityBelowNormal1
    <747>   DW_AT_const_value : 17
 <2><748>: Abbrev Number: 17 (DW_TAG_enumerator)
    <749>   DW_AT_name        : (indirect string, offset: 0xac593): osPriorityBelowNormal2
    <74d>   DW_AT_const_value : 18
 <2><74e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <74f>   DW_AT_name        : (indirect string, offset: 0x8adac): osPriorityBelowNormal3
    <753>   DW_AT_const_value : 19
 <2><754>: Abbrev Number: 17 (DW_TAG_enumerator)
    <755>   DW_AT_name        : (indirect string, offset: 0xac5c2): osPriorityBelowNormal4
    <759>   DW_AT_const_value : 20
 <2><75a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <75b>   DW_AT_name        : (indirect string, offset: 0xac5d9): osPriorityBelowNormal5
    <75f>   DW_AT_const_value : 21
 <2><760>: Abbrev Number: 17 (DW_TAG_enumerator)
    <761>   DW_AT_name        : (indirect string, offset: 0xac5f0): osPriorityBelowNormal6
    <765>   DW_AT_const_value : 22
 <2><766>: Abbrev Number: 17 (DW_TAG_enumerator)
    <767>   DW_AT_name        : (indirect string, offset: 0x9b8c4): osPriorityBelowNormal7
    <76b>   DW_AT_const_value : 23
 <2><76c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <76d>   DW_AT_name        : (indirect string, offset: 0xa566d): osPriorityNormal
    <771>   DW_AT_const_value : 24
 <2><772>: Abbrev Number: 17 (DW_TAG_enumerator)
    <773>   DW_AT_name        : (indirect string, offset: 0x20196): osPriorityNormal1
    <777>   DW_AT_const_value : 25
 <2><778>: Abbrev Number: 17 (DW_TAG_enumerator)
    <779>   DW_AT_name        : (indirect string, offset: 0x201a8): osPriorityNormal2
    <77d>   DW_AT_const_value : 26
 <2><77e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <77f>   DW_AT_name        : (indirect string, offset: 0x201ba): osPriorityNormal3
    <783>   DW_AT_const_value : 27
 <2><784>: Abbrev Number: 17 (DW_TAG_enumerator)
    <785>   DW_AT_name        : (indirect string, offset: 0x201cc): osPriorityNormal4
    <789>   DW_AT_const_value : 28
 <2><78a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <78b>   DW_AT_name        : (indirect string, offset: 0x99d9f): osPriorityNormal5
    <78f>   DW_AT_const_value : 29
 <2><790>: Abbrev Number: 17 (DW_TAG_enumerator)
    <791>   DW_AT_name        : (indirect string, offset: 0x20204): osPriorityNormal6
    <795>   DW_AT_const_value : 30
 <2><796>: Abbrev Number: 17 (DW_TAG_enumerator)
    <797>   DW_AT_name        : (indirect string, offset: 0x20216): osPriorityNormal7
    <79b>   DW_AT_const_value : 31
 <2><79c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <79d>   DW_AT_name        : (indirect string, offset: 0x82d6c): osPriorityAboveNormal
    <7a1>   DW_AT_const_value : 32
 <2><7a2>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7a3>   DW_AT_name        : (indirect string, offset: 0xcacfc): osPriorityAboveNormal1
    <7a7>   DW_AT_const_value : 33
 <2><7a8>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7a9>   DW_AT_name        : (indirect string, offset: 0xcad13): osPriorityAboveNormal2
    <7ad>   DW_AT_const_value : 34
 <2><7ae>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7af>   DW_AT_name        : (indirect string, offset: 0xcad2a): osPriorityAboveNormal3
    <7b3>   DW_AT_const_value : 35
 <2><7b4>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7b5>   DW_AT_name        : (indirect string, offset: 0xcad41): osPriorityAboveNormal4
    <7b9>   DW_AT_const_value : 36
 <2><7ba>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7bb>   DW_AT_name        : (indirect string, offset: 0xb3945): osPriorityAboveNormal5
    <7bf>   DW_AT_const_value : 37
 <2><7c0>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7c1>   DW_AT_name        : (indirect string, offset: 0xcad6e): osPriorityAboveNormal6
    <7c5>   DW_AT_const_value : 38
 <2><7c6>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7c7>   DW_AT_name        : (indirect string, offset: 0xcad85): osPriorityAboveNormal7
    <7cb>   DW_AT_const_value : 39
 <2><7cc>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7cd>   DW_AT_name        : (indirect string, offset: 0x48520): osPriorityHigh
    <7d1>   DW_AT_const_value : 40
 <2><7d2>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7d3>   DW_AT_name        : (indirect string, offset: 0x872fe): osPriorityHigh1
    <7d7>   DW_AT_const_value : 41
 <2><7d8>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7d9>   DW_AT_name        : (indirect string, offset: 0x8730e): osPriorityHigh2
    <7dd>   DW_AT_const_value : 42
 <2><7de>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7df>   DW_AT_name        : (indirect string, offset: 0x8731e): osPriorityHigh3
    <7e3>   DW_AT_const_value : 43
 <2><7e4>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7e5>   DW_AT_name        : (indirect string, offset: 0x8732e): osPriorityHigh4
    <7e9>   DW_AT_const_value : 44
 <2><7ea>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7eb>   DW_AT_name        : (indirect string, offset: 0x42fe): osPriorityHigh5
    <7ef>   DW_AT_const_value : 45
 <2><7f0>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7f1>   DW_AT_name        : (indirect string, offset: 0x8736a): osPriorityHigh6
    <7f5>   DW_AT_const_value : 46
 <2><7f6>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7f7>   DW_AT_name        : (indirect string, offset: 0x8737a): osPriorityHigh7
    <7fb>   DW_AT_const_value : 47
 <2><7fc>: Abbrev Number: 17 (DW_TAG_enumerator)
    <7fd>   DW_AT_name        : (indirect string, offset: 0xb7f75): osPriorityRealtime
    <801>   DW_AT_const_value : 48
 <2><802>: Abbrev Number: 17 (DW_TAG_enumerator)
    <803>   DW_AT_name        : (indirect string, offset: 0x7ff7d): osPriorityRealtime1
    <807>   DW_AT_const_value : 49
 <2><808>: Abbrev Number: 17 (DW_TAG_enumerator)
    <809>   DW_AT_name        : (indirect string, offset: 0x7ff91): osPriorityRealtime2
    <80d>   DW_AT_const_value : 50
 <2><80e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <80f>   DW_AT_name        : (indirect string, offset: 0x7ffa5): osPriorityRealtime3
    <813>   DW_AT_const_value : 51
 <2><814>: Abbrev Number: 17 (DW_TAG_enumerator)
    <815>   DW_AT_name        : (indirect string, offset: 0x7ffb9): osPriorityRealtime4
    <819>   DW_AT_const_value : 52
 <2><81a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <81b>   DW_AT_name        : (indirect string, offset: 0x7ffcd): osPriorityRealtime5
    <81f>   DW_AT_const_value : 53
 <2><820>: Abbrev Number: 17 (DW_TAG_enumerator)
    <821>   DW_AT_name        : (indirect string, offset: 0x7ffe1): osPriorityRealtime6
    <825>   DW_AT_const_value : 54
 <2><826>: Abbrev Number: 17 (DW_TAG_enumerator)
    <827>   DW_AT_name        : (indirect string, offset: 0x7fff5): osPriorityRealtime7
    <82b>   DW_AT_const_value : 55
 <2><82c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <82d>   DW_AT_name        : (indirect string, offset: 0xd14): osPriorityISR
    <831>   DW_AT_const_value : 56
 <2><832>: Abbrev Number: 21 (DW_TAG_enumerator)
    <833>   DW_AT_name        : (indirect string, offset: 0xb3475): osPriorityError
    <837>   DW_AT_const_value : -1
 <2><838>: Abbrev Number: 22 (DW_TAG_enumerator)
    <839>   DW_AT_name        : (indirect string, offset: 0xc134d): osPriorityReserved
    <83d>   DW_AT_const_value : 0x7fffffff
 <2><841>: Abbrev Number: 0
 <1><842>: Abbrev Number: 3 (DW_TAG_typedef)
    <843>   DW_AT_name        : (indirect string, offset: 0x95bec): osPriority_t
    <847>   DW_AT_decl_file   : 10
    <848>   DW_AT_decl_line   : 136
    <849>   DW_AT_decl_column : 3
    <84a>   DW_AT_type        : <0x6f2>
 <1><84e>: Abbrev Number: 3 (DW_TAG_typedef)
    <84f>   DW_AT_name        : (indirect string, offset: 0x6e7a4): osThreadFunc_t
    <853>   DW_AT_decl_file   : 10
    <854>   DW_AT_decl_line   : 139
    <855>   DW_AT_decl_column : 16
    <856>   DW_AT_type        : <0xde>
 <1><85a>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <85b>   DW_AT_encoding    : 5	(signed)
    <85c>   DW_AT_byte_size   : 4
    <85d>   DW_AT_type        : <0x29>
    <861>   DW_AT_decl_file   : 10
    <862>   DW_AT_decl_line   : 176
    <863>   DW_AT_decl_column : 14
    <864>   DW_AT_sibling     : <0x89c>
 <2><868>: Abbrev Number: 17 (DW_TAG_enumerator)
    <869>   DW_AT_name        : (indirect string, offset: 0x9c6dc): osOK
    <86d>   DW_AT_const_value : 0
 <2><86e>: Abbrev Number: 21 (DW_TAG_enumerator)
    <86f>   DW_AT_name        : (indirect string, offset: 0x5e36c): osError
    <873>   DW_AT_const_value : -1
 <2><874>: Abbrev Number: 21 (DW_TAG_enumerator)
    <875>   DW_AT_name        : (indirect string, offset: 0x22a66): osErrorTimeout
    <879>   DW_AT_const_value : -2
 <2><87a>: Abbrev Number: 21 (DW_TAG_enumerator)
    <87b>   DW_AT_name        : (indirect string, offset: 0x856f0): osErrorResource
    <87f>   DW_AT_const_value : -3
 <2><880>: Abbrev Number: 21 (DW_TAG_enumerator)
    <881>   DW_AT_name        : (indirect string, offset: 0x34b1a): osErrorParameter
    <885>   DW_AT_const_value : -4
 <2><886>: Abbrev Number: 21 (DW_TAG_enumerator)
    <887>   DW_AT_name        : (indirect string, offset: 0x2315a): osErrorNoMemory
    <88b>   DW_AT_const_value : -5
 <2><88c>: Abbrev Number: 21 (DW_TAG_enumerator)
    <88d>   DW_AT_name        : (indirect string, offset: 0x36c0f): osErrorISR
    <891>   DW_AT_const_value : -6
 <2><892>: Abbrev Number: 22 (DW_TAG_enumerator)
    <893>   DW_AT_name        : (indirect string, offset: 0x66fd7): osStatusReserved
    <897>   DW_AT_const_value : 0x7fffffff
 <2><89b>: Abbrev Number: 0
 <1><89c>: Abbrev Number: 3 (DW_TAG_typedef)
    <89d>   DW_AT_name        : (indirect string, offset: 0x44e03): osStatus_t
    <8a1>   DW_AT_decl_file   : 10
    <8a2>   DW_AT_decl_line   : 185
    <8a3>   DW_AT_decl_column : 3
    <8a4>   DW_AT_type        : <0x85a>
 <1><8a8>: Abbrev Number: 3 (DW_TAG_typedef)
    <8a9>   DW_AT_name        : (indirect string, offset: 0x24f53): osThreadId_t
    <8ad>   DW_AT_decl_file   : 10
    <8ae>   DW_AT_decl_line   : 189
    <8af>   DW_AT_decl_column : 15
    <8b0>   DW_AT_type        : <0xef>
 <1><8b4>: Abbrev Number: 3 (DW_TAG_typedef)
    <8b5>   DW_AT_name        : (indirect string, offset: 0x88f4c): TZ_ModuleId_t
    <8b9>   DW_AT_decl_file   : 10
    <8ba>   DW_AT_decl_line   : 213
    <8bb>   DW_AT_decl_column : 18
    <8bc>   DW_AT_type        : <0xcd>
 <1><8c0>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8c1>   DW_AT_byte_size   : 36
    <8c2>   DW_AT_decl_file   : 10
    <8c3>   DW_AT_decl_line   : 218
    <8c4>   DW_AT_decl_column : 9
    <8c5>   DW_AT_sibling     : <0x93f>
 <2><8c9>: Abbrev Number: 19 (DW_TAG_member)
    <8ca>   DW_AT_name        : (indirect string, offset: 0x17cb3): name
    <8ce>   DW_AT_decl_file   : 10
    <8cf>   DW_AT_decl_line   : 219
    <8d0>   DW_AT_decl_column : 33
    <8d1>   DW_AT_type        : <0x109>
    <8d5>   DW_AT_data_member_location: 0
 <2><8d6>: Abbrev Number: 19 (DW_TAG_member)
    <8d7>   DW_AT_name        : (indirect string, offset: 0x85434): attr_bits
    <8db>   DW_AT_decl_file   : 10
    <8dc>   DW_AT_decl_line   : 220
    <8dd>   DW_AT_decl_column : 28
    <8de>   DW_AT_type        : <0xcd>
    <8e2>   DW_AT_data_member_location: 4
 <2><8e3>: Abbrev Number: 19 (DW_TAG_member)
    <8e4>   DW_AT_name        : (indirect string, offset: 0x27774): cb_mem
    <8e8>   DW_AT_decl_file   : 10
    <8e9>   DW_AT_decl_line   : 221
    <8ea>   DW_AT_decl_column : 30
    <8eb>   DW_AT_type        : <0xef>
    <8ef>   DW_AT_data_member_location: 8
 <2><8f0>: Abbrev Number: 19 (DW_TAG_member)
    <8f1>   DW_AT_name        : (indirect string, offset: 0xc054c): cb_size
    <8f5>   DW_AT_decl_file   : 10
    <8f6>   DW_AT_decl_line   : 222
    <8f7>   DW_AT_decl_column : 30
    <8f8>   DW_AT_type        : <0xcd>
    <8fc>   DW_AT_data_member_location: 12
 <2><8fd>: Abbrev Number: 19 (DW_TAG_member)
    <8fe>   DW_AT_name        : (indirect string, offset: 0xb8890): stack_mem
    <902>   DW_AT_decl_file   : 10
    <903>   DW_AT_decl_line   : 223
    <904>   DW_AT_decl_column : 27
    <905>   DW_AT_type        : <0xef>
    <909>   DW_AT_data_member_location: 16
 <2><90a>: Abbrev Number: 19 (DW_TAG_member)
    <90b>   DW_AT_name        : (indirect string, offset: 0x8005a): stack_size
    <90f>   DW_AT_decl_file   : 10
    <910>   DW_AT_decl_line   : 224
    <911>   DW_AT_decl_column : 27
    <912>   DW_AT_type        : <0xcd>
    <916>   DW_AT_data_member_location: 20
 <2><917>: Abbrev Number: 19 (DW_TAG_member)
    <918>   DW_AT_name        : (indirect string, offset: 0x50b92): priority
    <91c>   DW_AT_decl_file   : 10
    <91d>   DW_AT_decl_line   : 225
    <91e>   DW_AT_decl_column : 29
    <91f>   DW_AT_type        : <0x842>
    <923>   DW_AT_data_member_location: 24
 <2><924>: Abbrev Number: 19 (DW_TAG_member)
    <925>   DW_AT_name        : (indirect string, offset: 0x56c94): tz_module
    <929>   DW_AT_decl_file   : 10
    <92a>   DW_AT_decl_line   : 226
    <92b>   DW_AT_decl_column : 28
    <92c>   DW_AT_type        : <0x8b4>
    <930>   DW_AT_data_member_location: 28
 <2><931>: Abbrev Number: 19 (DW_TAG_member)
    <932>   DW_AT_name        : (indirect string, offset: 0xb65d2): reserved
    <936>   DW_AT_decl_file   : 10
    <937>   DW_AT_decl_line   : 227
    <938>   DW_AT_decl_column : 29
    <939>   DW_AT_type        : <0xcd>
    <93d>   DW_AT_data_member_location: 32
 <2><93e>: Abbrev Number: 0
 <1><93f>: Abbrev Number: 3 (DW_TAG_typedef)
    <940>   DW_AT_name        : (indirect string, offset: 0x1ffd0): osThreadAttr_t
    <944>   DW_AT_decl_file   : 10
    <945>   DW_AT_decl_line   : 228
    <946>   DW_AT_decl_column : 3
    <947>   DW_AT_type        : <0x8c0>
 <1><94b>: Abbrev Number: 6 (DW_TAG_const_type)
    <94c>   DW_AT_type        : <0x93f>
 <1><950>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <951>   DW_AT_byte_size   : 4
    <952>   DW_AT_type        : <0x956>
 <1><956>: Abbrev Number: 23 (DW_TAG_const_type)
 <1><957>: Abbrev Number: 24 (DW_TAG_variable)
    <958>   DW_AT_name        : (indirect string, offset: 0x6da64): huart2
    <95c>   DW_AT_decl_file   : 11
    <95d>   DW_AT_decl_line   : 35
    <95e>   DW_AT_decl_column : 27
    <95f>   DW_AT_type        : <0x6e5>
    <963>   DW_AT_external    : 1
    <963>   DW_AT_declaration : 1
 <1><963>: Abbrev Number: 25 (DW_TAG_variable)
    <964>   DW_AT_name        : (indirect string, offset: 0x7cd7e): msgBuffer
    <968>   DW_AT_decl_file   : 1
    <969>   DW_AT_decl_line   : 53
    <96a>   DW_AT_decl_column : 17
    <96b>   DW_AT_type        : <0xf1>
    <96f>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><975>: Abbrev Number: 25 (DW_TAG_variable)
    <976>   DW_AT_name        : (indirect string, offset: 0x77dc): msg_flag
    <97a>   DW_AT_decl_file   : 1
    <97b>   DW_AT_decl_line   : 54
    <97c>   DW_AT_decl_column : 25
    <97d>   DW_AT_type        : <0xb2>
    <981>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><987>: Abbrev Number: 26 (DW_TAG_variable)
    <988>   DW_AT_name        : (indirect string, offset: 0x13de5): readUART_taskHandle
    <98c>   DW_AT_decl_file   : 1
    <98d>   DW_AT_decl_line   : 58
    <98e>   DW_AT_decl_column : 14
    <98f>   DW_AT_type        : <0x8a8>
    <993>   DW_AT_external    : 1
    <993>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><999>: Abbrev Number: 26 (DW_TAG_variable)
    <99a>   DW_AT_name        : (indirect string, offset: 0x55580): readUART_task_attributes
    <99e>   DW_AT_decl_file   : 1
    <99f>   DW_AT_decl_line   : 59
    <9a0>   DW_AT_decl_column : 22
    <9a1>   DW_AT_type        : <0x94b>
    <9a5>   DW_AT_external    : 1
    <9a5>   DW_AT_location    : 5 byte block: 3 4 65 0 8 	(DW_OP_addr: 8006504)
 <1><9ab>: Abbrev Number: 26 (DW_TAG_variable)
    <9ac>   DW_AT_name        : (indirect string, offset: 0x958d8): writeUART_taskHandle
    <9b0>   DW_AT_decl_file   : 1
    <9b1>   DW_AT_decl_line   : 65
    <9b2>   DW_AT_decl_column : 14
    <9b3>   DW_AT_type        : <0x8a8>
    <9b7>   DW_AT_external    : 1
    <9b7>   DW_AT_location    : 5 byte block: 3 9c 0 0 20 	(DW_OP_addr: 2000009c)
 <1><9bd>: Abbrev Number: 26 (DW_TAG_variable)
    <9be>   DW_AT_name        : (indirect string, offset: 0x14e34): writeUART_task_attributes
    <9c2>   DW_AT_decl_file   : 1
    <9c3>   DW_AT_decl_line   : 66
    <9c4>   DW_AT_decl_column : 22
    <9c5>   DW_AT_type        : <0x94b>
    <9c9>   DW_AT_external    : 1
    <9c9>   DW_AT_location    : 5 byte block: 3 28 65 0 8 	(DW_OP_addr: 8006528)
 <1><9cf>: Abbrev Number: 27 (DW_TAG_subprogram)
    <9d0>   DW_AT_external    : 1
    <9d0>   DW_AT_name        : (indirect string, offset: 0xc936c): osDelay
    <9d4>   DW_AT_decl_file   : 10
    <9d5>   DW_AT_decl_line   : 459
    <9d7>   DW_AT_decl_column : 12
    <9d8>   DW_AT_prototyped  : 1
    <9d8>   DW_AT_type        : <0x89c>
    <9dc>   DW_AT_declaration : 1
    <9dc>   DW_AT_sibling     : <0x9e6>
 <2><9e0>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <9e1>   DW_AT_type        : <0xcd>
 <2><9e5>: Abbrev Number: 0
 <1><9e6>: Abbrev Number: 28 (DW_TAG_subprogram)
    <9e7>   DW_AT_external    : 1
    <9e7>   DW_AT_name        : (indirect string, offset: 0x35479): vPortFree
    <9eb>   DW_AT_decl_file   : 13
    <9ec>   DW_AT_decl_line   : 164
    <9ed>   DW_AT_decl_column : 6
    <9ee>   DW_AT_prototyped  : 1
    <9ee>   DW_AT_declaration : 1
    <9ee>   DW_AT_sibling     : <0x9f8>
 <2><9f2>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <9f3>   DW_AT_type        : <0xef>
 <2><9f7>: Abbrev Number: 0
 <1><9f8>: Abbrev Number: 29 (DW_TAG_subprogram)
    <9f9>   DW_AT_external    : 1
    <9f9>   DW_AT_name        : (indirect string, offset: 0x9e453): memcpy
    <9fd>   DW_AT_decl_file   : 12
    <9fe>   DW_AT_decl_line   : 31
    <9ff>   DW_AT_decl_column : 9
    <a00>   DW_AT_prototyped  : 1
    <a00>   DW_AT_type        : <0xef>
    <a04>   DW_AT_declaration : 1
    <a04>   DW_AT_sibling     : <0xa18>
 <2><a08>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a09>   DW_AT_type        : <0xef>
 <2><a0d>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a0e>   DW_AT_type        : <0x950>
 <2><a12>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a13>   DW_AT_type        : <0x30>
 <2><a17>: Abbrev Number: 0
 <1><a18>: Abbrev Number: 30 (DW_TAG_subprogram)
    <a19>   DW_AT_external    : 1
    <a19>   DW_AT_name        : (indirect string, offset: 0x573c7): vTaskResume
    <a1d>   DW_AT_decl_file   : 5
    <a1e>   DW_AT_decl_line   : 1118
    <a20>   DW_AT_decl_column : 6
    <a21>   DW_AT_prototyped  : 1
    <a21>   DW_AT_declaration : 1
    <a21>   DW_AT_sibling     : <0xa2b>
 <2><a25>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a26>   DW_AT_type        : <0x10f>
 <2><a2a>: Abbrev Number: 0
 <1><a2b>: Abbrev Number: 27 (DW_TAG_subprogram)
    <a2c>   DW_AT_external    : 1
    <a2c>   DW_AT_name        : (indirect string, offset: 0x42b20): HAL_UART_Transmit
    <a30>   DW_AT_decl_file   : 9
    <a31>   DW_AT_decl_line   : 1674
    <a33>   DW_AT_decl_column : 19
    <a34>   DW_AT_prototyped  : 1
    <a34>   DW_AT_type        : <0x2bb>
    <a38>   DW_AT_declaration : 1
    <a38>   DW_AT_sibling     : <0xa51>
 <2><a3c>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a3d>   DW_AT_type        : <0xa51>
 <2><a41>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a42>   DW_AT_type        : <0x6c8>
 <2><a46>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a47>   DW_AT_type        : <0xbc>
 <2><a4b>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a4c>   DW_AT_type        : <0xcd>
 <2><a50>: Abbrev Number: 0
 <1><a51>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a52>   DW_AT_byte_size   : 4
    <a53>   DW_AT_type        : <0x6e5>
 <1><a57>: Abbrev Number: 29 (DW_TAG_subprogram)
    <a58>   DW_AT_external    : 1
    <a58>   DW_AT_name        : (indirect string, offset: 0x44ea8): strlen
    <a5c>   DW_AT_decl_file   : 12
    <a5d>   DW_AT_decl_line   : 41
    <a5e>   DW_AT_decl_column : 9
    <a5f>   DW_AT_prototyped  : 1
    <a5f>   DW_AT_type        : <0x30>
    <a63>   DW_AT_declaration : 1
    <a63>   DW_AT_sibling     : <0xa6d>
 <2><a67>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a68>   DW_AT_type        : <0x109>
 <2><a6c>: Abbrev Number: 0
 <1><a6d>: Abbrev Number: 30 (DW_TAG_subprogram)
    <a6e>   DW_AT_external    : 1
    <a6e>   DW_AT_name        : (indirect string, offset: 0xbbda5): vTaskSuspend
    <a72>   DW_AT_decl_file   : 5
    <a73>   DW_AT_decl_line   : 1069
    <a75>   DW_AT_decl_column : 6
    <a76>   DW_AT_prototyped  : 1
    <a76>   DW_AT_declaration : 1
    <a76>   DW_AT_sibling     : <0xa80>
 <2><a7a>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a7b>   DW_AT_type        : <0x10f>
 <2><a7f>: Abbrev Number: 0
 <1><a80>: Abbrev Number: 29 (DW_TAG_subprogram)
    <a81>   DW_AT_external    : 1
    <a81>   DW_AT_name        : (indirect string, offset: 0xcbec4): pvPortMalloc
    <a85>   DW_AT_decl_file   : 13
    <a86>   DW_AT_decl_line   : 163
    <a87>   DW_AT_decl_column : 7
    <a88>   DW_AT_prototyped  : 1
    <a88>   DW_AT_type        : <0xef>
    <a8c>   DW_AT_declaration : 1
    <a8c>   DW_AT_sibling     : <0xa96>
 <2><a90>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a91>   DW_AT_type        : <0x30>
 <2><a95>: Abbrev Number: 0
 <1><a96>: Abbrev Number: 27 (DW_TAG_subprogram)
    <a97>   DW_AT_external    : 1
    <a97>   DW_AT_name        : (indirect string, offset: 0x5ba04): HAL_UART_Receive
    <a9b>   DW_AT_decl_file   : 9
    <a9c>   DW_AT_decl_line   : 1675
    <a9e>   DW_AT_decl_column : 19
    <a9f>   DW_AT_prototyped  : 1
    <a9f>   DW_AT_type        : <0x2bb>
    <aa3>   DW_AT_declaration : 1
    <aa3>   DW_AT_sibling     : <0xabc>
 <2><aa7>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <aa8>   DW_AT_type        : <0xa51>
 <2><aac>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <aad>   DW_AT_type        : <0xf1>
 <2><ab1>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ab2>   DW_AT_type        : <0xbc>
 <2><ab6>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ab7>   DW_AT_type        : <0xcd>
 <2><abb>: Abbrev Number: 0
 <1><abc>: Abbrev Number: 29 (DW_TAG_subprogram)
    <abd>   DW_AT_external    : 1
    <abd>   DW_AT_name        : (indirect string, offset: 0xc13dc): memset
    <ac1>   DW_AT_decl_file   : 12
    <ac2>   DW_AT_decl_line   : 33
    <ac3>   DW_AT_decl_column : 9
    <ac4>   DW_AT_prototyped  : 1
    <ac4>   DW_AT_type        : <0xef>
    <ac8>   DW_AT_declaration : 1
    <ac8>   DW_AT_sibling     : <0xadc>
 <2><acc>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <acd>   DW_AT_type        : <0xef>
 <2><ad1>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ad2>   DW_AT_type        : <0x29>
 <2><ad6>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ad7>   DW_AT_type        : <0x30>
 <2><adb>: Abbrev Number: 0
 <1><adc>: Abbrev Number: 27 (DW_TAG_subprogram)
    <add>   DW_AT_external    : 1
    <add>   DW_AT_name        : (indirect string, offset: 0x715c7): osThreadNew
    <ae1>   DW_AT_decl_file   : 10
    <ae2>   DW_AT_decl_line   : 349
    <ae4>   DW_AT_decl_column : 14
    <ae5>   DW_AT_prototyped  : 1
    <ae5>   DW_AT_type        : <0x8a8>
    <ae9>   DW_AT_declaration : 1
    <ae9>   DW_AT_sibling     : <0xafd>
 <2><aed>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <aee>   DW_AT_type        : <0x84e>
 <2><af2>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <af3>   DW_AT_type        : <0xef>
 <2><af7>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <af8>   DW_AT_type        : <0xafd>
 <2><afc>: Abbrev Number: 0
 <1><afd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <afe>   DW_AT_byte_size   : 4
    <aff>   DW_AT_type        : <0x94b>
 <1><b03>: Abbrev Number: 31 (DW_TAG_subprogram)
    <b04>   DW_AT_external    : 1
    <b04>   DW_AT_name        : (indirect string, offset: 0x24a59): WriteUART
    <b08>   DW_AT_decl_file   : 1
    <b09>   DW_AT_decl_line   : 184
    <b0a>   DW_AT_decl_column : 6
    <b0b>   DW_AT_prototyped  : 1
    <b0b>   DW_AT_low_pc      : 0x80006cc
    <b0f>   DW_AT_high_pc     : 0x5c
    <b13>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b15>   DW_AT_GNU_all_tail_call_sites: 1
    <b15>   DW_AT_sibling     : <0xb29>
 <2><b19>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <b1a>   DW_AT_name        : (indirect string, offset: 0x2b472): argument
    <b1e>   DW_AT_decl_file   : 1
    <b1f>   DW_AT_decl_line   : 184
    <b20>   DW_AT_decl_column : 22
    <b21>   DW_AT_type        : <0xef>
    <b25>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b28>: Abbrev Number: 0
 <1><b29>: Abbrev Number: 31 (DW_TAG_subprogram)
    <b2a>   DW_AT_external    : 1
    <b2a>   DW_AT_name        : (indirect string, offset: 0x79f71): ReadUART
    <b2e>   DW_AT_decl_file   : 1
    <b2f>   DW_AT_decl_line   : 132
    <b30>   DW_AT_decl_column : 6
    <b31>   DW_AT_prototyped  : 1
    <b31>   DW_AT_low_pc      : 0x8000524
    <b35>   DW_AT_high_pc     : 0x1a8
    <b39>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b3b>   DW_AT_GNU_all_tail_call_sites: 1
    <b3b>   DW_AT_sibling     : <0xb9c>
 <2><b3f>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <b40>   DW_AT_name        : (indirect string, offset: 0x2b472): argument
    <b44>   DW_AT_decl_file   : 1
    <b45>   DW_AT_decl_line   : 132
    <b46>   DW_AT_decl_column : 21
    <b47>   DW_AT_type        : <0xef>
    <b4b>   DW_AT_location    : 3 byte block: 91 e4 7d 	(DW_OP_fbreg: -284)
 <2><b4f>: Abbrev Number: 25 (DW_TAG_variable)
    <b50>   DW_AT_name        : (indirect string, offset: 0x53a60): rxBuffer
    <b54>   DW_AT_decl_file   : 1
    <b55>   DW_AT_decl_line   : 136
    <b56>   DW_AT_decl_column : 10
    <b57>   DW_AT_type        : <0xb9c>
    <b5b>   DW_AT_location    : 3 byte block: 91 ec 7d 	(DW_OP_fbreg: -276)
 <2><b5f>: Abbrev Number: 25 (DW_TAG_variable)
    <b60>   DW_AT_name        : (indirect string, offset: 0x3641e): rxIndex
    <b64>   DW_AT_decl_file   : 1
    <b65>   DW_AT_decl_line   : 138
    <b66>   DW_AT_decl_column : 10
    <b67>   DW_AT_type        : <0xa6>
    <b6b>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><b6e>: Abbrev Number: 33 (DW_TAG_variable)
    <b6f>   DW_AT_name        : ret
    <b73>   DW_AT_decl_file   : 1
    <b74>   DW_AT_decl_line   : 139
    <b75>   DW_AT_decl_column : 20
    <b76>   DW_AT_type        : <0x2bb>
    <b7a>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><b7d>: Abbrev Number: 25 (DW_TAG_variable)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x8b308): rx_error_str
    <b82>   DW_AT_decl_file   : 1
    <b83>   DW_AT_decl_line   : 140
    <b84>   DW_AT_decl_column : 8
    <b85>   DW_AT_type        : <0xf7>
    <b89>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><b8c>: Abbrev Number: 25 (DW_TAG_variable)
    <b8d>   DW_AT_name        : (indirect string, offset: 0x735e7): mem_error_str
    <b91>   DW_AT_decl_file   : 1
    <b92>   DW_AT_decl_line   : 141
    <b93>   DW_AT_decl_column : 8
    <b94>   DW_AT_type        : <0xf7>
    <b98>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b9b>: Abbrev Number: 0
 <1><b9c>: Abbrev Number: 34 (DW_TAG_array_type)
    <b9d>   DW_AT_type        : <0xa6>
    <ba1>   DW_AT_sibling     : <0xbac>
 <2><ba5>: Abbrev Number: 35 (DW_TAG_subrange_type)
    <ba6>   DW_AT_type        : <0x3c>
    <baa>   DW_AT_upper_bound : 254
 <2><bab>: Abbrev Number: 0
 <1><bac>: Abbrev Number: 36 (DW_TAG_subprogram)
    <bad>   DW_AT_external    : 1
    <bad>   DW_AT_name        : (indirect string, offset: 0xa35fd): MX_FREERTOS_Init
    <bb1>   DW_AT_decl_file   : 1
    <bb2>   DW_AT_decl_line   : 87
    <bb3>   DW_AT_decl_column : 6
    <bb4>   DW_AT_prototyped  : 1
    <bb4>   DW_AT_low_pc      : 0x80004e4
    <bb8>   DW_AT_high_pc     : 0x40
    <bbc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bbe>   DW_AT_GNU_all_tail_call_sites: 1
 <1><bbe>: Abbrev Number: 0
  Compilation Unit @ offset 0xbbf:
   Length:        0x4ce (32-bit)
   Version:       4
   Abbrev Offset: 0x210
   Pointer Size:  4
 <0><bca>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <bcb>   DW_AT_producer    : (indirect string, offset: 0xc57c1): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <bcf>   DW_AT_language    : 12	(ANSI C99)
    <bd0>   DW_AT_name        : (indirect string, offset: 0xcbfd8): ../Core/Src/gpio.c
    <bd4>   DW_AT_comp_dir    : (indirect string, offset: 0xd564): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/RTOS_Tutorial_Part4/Debug
    <bd8>   DW_AT_ranges      : 0x20
    <bdc>   DW_AT_low_pc      : 0x0
    <be0>   DW_AT_stmt_list   : 0xb87
    <be4>   DW_AT_GNU_macros  : 0x2024b
 <1><be8>: Abbrev Number: 2 (DW_TAG_base_type)
    <be9>   DW_AT_byte_size   : 1
    <bea>   DW_AT_encoding    : 6	(signed char)
    <beb>   DW_AT_name        : (indirect string, offset: 0x66456): signed char
 <1><bef>: Abbrev Number: 2 (DW_TAG_base_type)
    <bf0>   DW_AT_byte_size   : 1
    <bf1>   DW_AT_encoding    : 8	(unsigned char)
    <bf2>   DW_AT_name        : (indirect string, offset: 0xc43d3): unsigned char
 <1><bf6>: Abbrev Number: 2 (DW_TAG_base_type)
    <bf7>   DW_AT_byte_size   : 2
    <bf8>   DW_AT_encoding    : 5	(signed)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x97259): short int
 <1><bfd>: Abbrev Number: 3 (DW_TAG_typedef)
    <bfe>   DW_AT_name        : (indirect string, offset: 0xa5de7): __uint16_t
    <c02>   DW_AT_decl_file   : 2
    <c03>   DW_AT_decl_line   : 57
    <c04>   DW_AT_decl_column : 25
    <c05>   DW_AT_type        : <0xc09>
 <1><c09>: Abbrev Number: 2 (DW_TAG_base_type)
    <c0a>   DW_AT_byte_size   : 2
    <c0b>   DW_AT_encoding    : 7	(unsigned)
    <c0c>   DW_AT_name        : (indirect string, offset: 0xc2b30): short unsigned int
 <1><c10>: Abbrev Number: 2 (DW_TAG_base_type)
    <c11>   DW_AT_byte_size   : 4
    <c12>   DW_AT_encoding    : 5	(signed)
    <c13>   DW_AT_name        : (indirect string, offset: 0x115f2): long int
 <1><c17>: Abbrev Number: 3 (DW_TAG_typedef)
    <c18>   DW_AT_name        : (indirect string, offset: 0x81e83): __uint32_t
    <c1c>   DW_AT_decl_file   : 2
    <c1d>   DW_AT_decl_line   : 79
    <c1e>   DW_AT_decl_column : 25
    <c1f>   DW_AT_type        : <0xc23>
 <1><c23>: Abbrev Number: 2 (DW_TAG_base_type)
    <c24>   DW_AT_byte_size   : 4
    <c25>   DW_AT_encoding    : 7	(unsigned)
    <c26>   DW_AT_name        : (indirect string, offset: 0x4de4f): long unsigned int
 <1><c2a>: Abbrev Number: 2 (DW_TAG_base_type)
    <c2b>   DW_AT_byte_size   : 8
    <c2c>   DW_AT_encoding    : 5	(signed)
    <c2d>   DW_AT_name        : (indirect string, offset: 0x5cffe): long long int
 <1><c31>: Abbrev Number: 2 (DW_TAG_base_type)
    <c32>   DW_AT_byte_size   : 8
    <c33>   DW_AT_encoding    : 7	(unsigned)
    <c34>   DW_AT_name        : (indirect string, offset: 0x2a1f9): long long unsigned int
 <1><c38>: Abbrev Number: 4 (DW_TAG_base_type)
    <c39>   DW_AT_byte_size   : 4
    <c3a>   DW_AT_encoding    : 5	(signed)
    <c3b>   DW_AT_name        : int
 <1><c3f>: Abbrev Number: 2 (DW_TAG_base_type)
    <c40>   DW_AT_byte_size   : 4
    <c41>   DW_AT_encoding    : 7	(unsigned)
    <c42>   DW_AT_name        : (indirect string, offset: 0x10b8a): unsigned int
 <1><c46>: Abbrev Number: 3 (DW_TAG_typedef)
    <c47>   DW_AT_name        : (indirect string, offset: 0x9443e): uint16_t
    <c4b>   DW_AT_decl_file   : 3
    <c4c>   DW_AT_decl_line   : 36
    <c4d>   DW_AT_decl_column : 20
    <c4e>   DW_AT_type        : <0xbfd>
 <1><c52>: Abbrev Number: 3 (DW_TAG_typedef)
    <c53>   DW_AT_name        : (indirect string, offset: 0x939ed): uint32_t
    <c57>   DW_AT_decl_file   : 3
    <c58>   DW_AT_decl_line   : 48
    <c59>   DW_AT_decl_column : 20
    <c5a>   DW_AT_type        : <0xc17>
 <1><c5e>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c5f>   DW_AT_type        : <0xc52>
 <1><c63>: Abbrev Number: 6 (DW_TAG_structure_type)
    <c64>   DW_AT_byte_size   : 44
    <c65>   DW_AT_decl_file   : 4
    <c66>   DW_AT_decl_line   : 451
    <c68>   DW_AT_decl_column : 9
    <c69>   DW_AT_sibling     : <0xcfa>
 <2><c6d>: Abbrev Number: 7 (DW_TAG_member)
    <c6e>   DW_AT_name        : (indirect string, offset: 0xcbf64): MODER
    <c72>   DW_AT_decl_file   : 4
    <c73>   DW_AT_decl_line   : 453
    <c75>   DW_AT_decl_column : 17
    <c76>   DW_AT_type        : <0xc5e>
    <c7a>   DW_AT_data_member_location: 0
 <2><c7b>: Abbrev Number: 7 (DW_TAG_member)
    <c7c>   DW_AT_name        : (indirect string, offset: 0xcc0c8): OTYPER
    <c80>   DW_AT_decl_file   : 4
    <c81>   DW_AT_decl_line   : 454
    <c83>   DW_AT_decl_column : 17
    <c84>   DW_AT_type        : <0xc5e>
    <c88>   DW_AT_data_member_location: 4
 <2><c89>: Abbrev Number: 7 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0xcc108): OSPEEDR
    <c8e>   DW_AT_decl_file   : 4
    <c8f>   DW_AT_decl_line   : 455
    <c91>   DW_AT_decl_column : 17
    <c92>   DW_AT_type        : <0xc5e>
    <c96>   DW_AT_data_member_location: 8
 <2><c97>: Abbrev Number: 7 (DW_TAG_member)
    <c98>   DW_AT_name        : (indirect string, offset: 0xcc0a7): PUPDR
    <c9c>   DW_AT_decl_file   : 4
    <c9d>   DW_AT_decl_line   : 456
    <c9f>   DW_AT_decl_column : 17
    <ca0>   DW_AT_type        : <0xc5e>
    <ca4>   DW_AT_data_member_location: 12
 <2><ca5>: Abbrev Number: 8 (DW_TAG_member)
    <ca6>   DW_AT_name        : IDR
    <caa>   DW_AT_decl_file   : 4
    <cab>   DW_AT_decl_line   : 457
    <cad>   DW_AT_decl_column : 17
    <cae>   DW_AT_type        : <0xc5e>
    <cb2>   DW_AT_data_member_location: 16
 <2><cb3>: Abbrev Number: 8 (DW_TAG_member)
    <cb4>   DW_AT_name        : ODR
    <cb8>   DW_AT_decl_file   : 4
    <cb9>   DW_AT_decl_line   : 458
    <cbb>   DW_AT_decl_column : 17
    <cbc>   DW_AT_type        : <0xc5e>
    <cc0>   DW_AT_data_member_location: 20
 <2><cc1>: Abbrev Number: 7 (DW_TAG_member)
    <cc2>   DW_AT_name        : (indirect string, offset: 0xcc00e): BSRR
    <cc6>   DW_AT_decl_file   : 4
    <cc7>   DW_AT_decl_line   : 459
    <cc9>   DW_AT_decl_column : 17
    <cca>   DW_AT_type        : <0xc5e>
    <cce>   DW_AT_data_member_location: 24
 <2><ccf>: Abbrev Number: 7 (DW_TAG_member)
    <cd0>   DW_AT_name        : (indirect string, offset: 0xcc103): LCKR
    <cd4>   DW_AT_decl_file   : 4
    <cd5>   DW_AT_decl_line   : 460
    <cd7>   DW_AT_decl_column : 17
    <cd8>   DW_AT_type        : <0xc5e>
    <cdc>   DW_AT_data_member_location: 28
 <2><cdd>: Abbrev Number: 8 (DW_TAG_member)
    <cde>   DW_AT_name        : AFR
    <ce2>   DW_AT_decl_file   : 4
    <ce3>   DW_AT_decl_line   : 461
    <ce5>   DW_AT_decl_column : 17
    <ce6>   DW_AT_type        : <0xd0a>
    <cea>   DW_AT_data_member_location: 32
 <2><ceb>: Abbrev Number: 8 (DW_TAG_member)
    <cec>   DW_AT_name        : BRR
    <cf0>   DW_AT_decl_file   : 4
    <cf1>   DW_AT_decl_line   : 462
    <cf3>   DW_AT_decl_column : 17
    <cf4>   DW_AT_type        : <0xc5e>
    <cf8>   DW_AT_data_member_location: 40
 <2><cf9>: Abbrev Number: 0
 <1><cfa>: Abbrev Number: 9 (DW_TAG_array_type)
    <cfb>   DW_AT_type        : <0xc5e>
    <cff>   DW_AT_sibling     : <0xd0a>
 <2><d03>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <d04>   DW_AT_type        : <0xc3f>
    <d08>   DW_AT_upper_bound : 1
 <2><d09>: Abbrev Number: 0
 <1><d0a>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <d0b>   DW_AT_type        : <0xcfa>
 <1><d0f>: Abbrev Number: 11 (DW_TAG_typedef)
    <d10>   DW_AT_name        : (indirect string, offset: 0xcc144): GPIO_TypeDef
    <d14>   DW_AT_decl_file   : 4
    <d15>   DW_AT_decl_line   : 464
    <d17>   DW_AT_decl_column : 3
    <d18>   DW_AT_type        : <0xc63>
 <1><d1c>: Abbrev Number: 6 (DW_TAG_structure_type)
    <d1d>   DW_AT_byte_size   : 156
    <d1e>   DW_AT_decl_file   : 4
    <d1f>   DW_AT_decl_line   : 590
    <d21>   DW_AT_decl_column : 9
    <d22>   DW_AT_sibling     : <0xf48>
 <2><d26>: Abbrev Number: 8 (DW_TAG_member)
    <d27>   DW_AT_name        : CR
    <d2a>   DW_AT_decl_file   : 4
    <d2b>   DW_AT_decl_line   : 592
    <d2d>   DW_AT_decl_column : 17
    <d2e>   DW_AT_type        : <0xc5e>
    <d32>   DW_AT_data_member_location: 0
 <2><d33>: Abbrev Number: 7 (DW_TAG_member)
    <d34>   DW_AT_name        : (indirect string, offset: 0xcc0ba): ICSCR
    <d38>   DW_AT_decl_file   : 4
    <d39>   DW_AT_decl_line   : 593
    <d3b>   DW_AT_decl_column : 17
    <d3c>   DW_AT_type        : <0xc5e>
    <d40>   DW_AT_data_member_location: 4
 <2><d41>: Abbrev Number: 7 (DW_TAG_member)
    <d42>   DW_AT_name        : (indirect string, offset: 0xcc033): CFGR
    <d46>   DW_AT_decl_file   : 4
    <d47>   DW_AT_decl_line   : 594
    <d49>   DW_AT_decl_column : 17
    <d4a>   DW_AT_type        : <0xc5e>
    <d4e>   DW_AT_data_member_location: 8
 <2><d4f>: Abbrev Number: 7 (DW_TAG_member)
    <d50>   DW_AT_name        : (indirect string, offset: 0xcc0c0): PLLCFGR
    <d54>   DW_AT_decl_file   : 4
    <d55>   DW_AT_decl_line   : 595
    <d57>   DW_AT_decl_column : 17
    <d58>   DW_AT_type        : <0xc5e>
    <d5c>   DW_AT_data_member_location: 12
 <2><d5d>: Abbrev Number: 7 (DW_TAG_member)
    <d5e>   DW_AT_name        : (indirect string, offset: 0xcc02c): PLLSAI1CFGR
    <d62>   DW_AT_decl_file   : 4
    <d63>   DW_AT_decl_line   : 596
    <d65>   DW_AT_decl_column : 17
    <d66>   DW_AT_type        : <0xc5e>
    <d6a>   DW_AT_data_member_location: 16
 <2><d6b>: Abbrev Number: 7 (DW_TAG_member)
    <d6c>   DW_AT_name        : (indirect string, offset: 0x7af27): RESERVED
    <d70>   DW_AT_decl_file   : 4
    <d71>   DW_AT_decl_line   : 597
    <d73>   DW_AT_decl_column : 17
    <d74>   DW_AT_type        : <0xc52>
    <d78>   DW_AT_data_member_location: 20
 <2><d79>: Abbrev Number: 7 (DW_TAG_member)
    <d7a>   DW_AT_name        : (indirect string, offset: 0xcbf76): CIER
    <d7e>   DW_AT_decl_file   : 4
    <d7f>   DW_AT_decl_line   : 598
    <d81>   DW_AT_decl_column : 17
    <d82>   DW_AT_type        : <0xc5e>
    <d86>   DW_AT_data_member_location: 24
 <2><d87>: Abbrev Number: 7 (DW_TAG_member)
    <d88>   DW_AT_name        : (indirect string, offset: 0xcbf7b): CIFR
    <d8c>   DW_AT_decl_file   : 4
    <d8d>   DW_AT_decl_line   : 599
    <d8f>   DW_AT_decl_column : 17
    <d90>   DW_AT_type        : <0xc5e>
    <d94>   DW_AT_data_member_location: 28
 <2><d95>: Abbrev Number: 7 (DW_TAG_member)
    <d96>   DW_AT_name        : (indirect string, offset: 0xcbf71): CICR
    <d9a>   DW_AT_decl_file   : 4
    <d9b>   DW_AT_decl_line   : 600
    <d9d>   DW_AT_decl_column : 17
    <d9e>   DW_AT_type        : <0xc5e>
    <da2>   DW_AT_data_member_location: 32
 <2><da3>: Abbrev Number: 7 (DW_TAG_member)
    <da4>   DW_AT_name        : (indirect string, offset: 0xcc126): RESERVED0
    <da8>   DW_AT_decl_file   : 4
    <da9>   DW_AT_decl_line   : 601
    <dab>   DW_AT_decl_column : 17
    <dac>   DW_AT_type        : <0xc52>
    <db0>   DW_AT_data_member_location: 36
 <2><db1>: Abbrev Number: 7 (DW_TAG_member)
    <db2>   DW_AT_name        : (indirect string, offset: 0xcc0e0): AHB1RSTR
    <db6>   DW_AT_decl_file   : 4
    <db7>   DW_AT_decl_line   : 602
    <db9>   DW_AT_decl_column : 17
    <dba>   DW_AT_type        : <0xc5e>
    <dbe>   DW_AT_data_member_location: 40
 <2><dbf>: Abbrev Number: 7 (DW_TAG_member)
    <dc0>   DW_AT_name        : (indirect string, offset: 0xcbfcf): AHB2RSTR
    <dc4>   DW_AT_decl_file   : 4
    <dc5>   DW_AT_decl_line   : 603
    <dc7>   DW_AT_decl_column : 17
    <dc8>   DW_AT_type        : <0xc5e>
    <dcc>   DW_AT_data_member_location: 44
 <2><dcd>: Abbrev Number: 7 (DW_TAG_member)
    <dce>   DW_AT_name        : (indirect string, offset: 0xcc04b): AHB3RSTR
    <dd2>   DW_AT_decl_file   : 4
    <dd3>   DW_AT_decl_line   : 604
    <dd5>   DW_AT_decl_column : 17
    <dd6>   DW_AT_type        : <0xc5e>
    <dda>   DW_AT_data_member_location: 48
 <2><ddb>: Abbrev Number: 7 (DW_TAG_member)
    <ddc>   DW_AT_name        : (indirect string, offset: 0xcc130): RESERVED1
    <de0>   DW_AT_decl_file   : 4
    <de1>   DW_AT_decl_line   : 605
    <de3>   DW_AT_decl_column : 17
    <de4>   DW_AT_type        : <0xc52>
    <de8>   DW_AT_data_member_location: 52
 <2><de9>: Abbrev Number: 7 (DW_TAG_member)
    <dea>   DW_AT_name        : (indirect string, offset: 0xcbfeb): APB1RSTR1
    <dee>   DW_AT_decl_file   : 4
    <def>   DW_AT_decl_line   : 606
    <df1>   DW_AT_decl_column : 17
    <df2>   DW_AT_type        : <0xc5e>
    <df6>   DW_AT_data_member_location: 56
 <2><df7>: Abbrev Number: 7 (DW_TAG_member)
    <df8>   DW_AT_name        : (indirect string, offset: 0xcbff5): APB1RSTR2
    <dfc>   DW_AT_decl_file   : 4
    <dfd>   DW_AT_decl_line   : 607
    <dff>   DW_AT_decl_column : 17
    <e00>   DW_AT_type        : <0xc5e>
    <e04>   DW_AT_data_member_location: 60
 <2><e05>: Abbrev Number: 7 (DW_TAG_member)
    <e06>   DW_AT_name        : (indirect string, offset: 0xcc042): APB2RSTR
    <e0a>   DW_AT_decl_file   : 4
    <e0b>   DW_AT_decl_line   : 608
    <e0d>   DW_AT_decl_column : 17
    <e0e>   DW_AT_type        : <0xc5e>
    <e12>   DW_AT_data_member_location: 64
 <2><e13>: Abbrev Number: 7 (DW_TAG_member)
    <e14>   DW_AT_name        : (indirect string, offset: 0xbf6ed): RESERVED2
    <e18>   DW_AT_decl_file   : 4
    <e19>   DW_AT_decl_line   : 609
    <e1b>   DW_AT_decl_column : 17
    <e1c>   DW_AT_type        : <0xc52>
    <e20>   DW_AT_data_member_location: 68
 <2><e21>: Abbrev Number: 7 (DW_TAG_member)
    <e22>   DW_AT_name        : (indirect string, offset: 0xcbfa8): AHB1ENR
    <e26>   DW_AT_decl_file   : 4
    <e27>   DW_AT_decl_line   : 610
    <e29>   DW_AT_decl_column : 17
    <e2a>   DW_AT_type        : <0xc5e>
    <e2e>   DW_AT_data_member_location: 72
 <2><e2f>: Abbrev Number: 7 (DW_TAG_member)
    <e30>   DW_AT_name        : (indirect string, offset: 0xcc018): AHB2ENR
    <e34>   DW_AT_decl_file   : 4
    <e35>   DW_AT_decl_line   : 611
    <e37>   DW_AT_decl_column : 17
    <e38>   DW_AT_type        : <0xc5e>
    <e3c>   DW_AT_data_member_location: 76
 <2><e3d>: Abbrev Number: 7 (DW_TAG_member)
    <e3e>   DW_AT_name        : (indirect string, offset: 0xcc054): AHB3ENR
    <e42>   DW_AT_decl_file   : 4
    <e43>   DW_AT_decl_line   : 612
    <e45>   DW_AT_decl_column : 17
    <e46>   DW_AT_type        : <0xc5e>
    <e4a>   DW_AT_data_member_location: 80
 <2><e4b>: Abbrev Number: 7 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0xbf6f7): RESERVED3
    <e50>   DW_AT_decl_file   : 4
    <e51>   DW_AT_decl_line   : 613
    <e53>   DW_AT_decl_column : 17
    <e54>   DW_AT_type        : <0xc52>
    <e58>   DW_AT_data_member_location: 84
 <2><e59>: Abbrev Number: 7 (DW_TAG_member)
    <e5a>   DW_AT_name        : (indirect string, offset: 0xcbf80): APB1ENR1
    <e5e>   DW_AT_decl_file   : 4
    <e5f>   DW_AT_decl_line   : 614
    <e61>   DW_AT_decl_column : 17
    <e62>   DW_AT_type        : <0xc5e>
    <e66>   DW_AT_data_member_location: 88
 <2><e67>: Abbrev Number: 7 (DW_TAG_member)
    <e68>   DW_AT_name        : (indirect string, offset: 0xcbf89): APB1ENR2
    <e6c>   DW_AT_decl_file   : 4
    <e6d>   DW_AT_decl_line   : 615
    <e6f>   DW_AT_decl_column : 17
    <e70>   DW_AT_type        : <0xc5e>
    <e74>   DW_AT_data_member_location: 92
 <2><e75>: Abbrev Number: 7 (DW_TAG_member)
    <e76>   DW_AT_name        : (indirect string, offset: 0xcc07c): APB2ENR
    <e7a>   DW_AT_decl_file   : 4
    <e7b>   DW_AT_decl_line   : 616
    <e7d>   DW_AT_decl_column : 17
    <e7e>   DW_AT_type        : <0xc5e>
    <e82>   DW_AT_data_member_location: 96
 <2><e83>: Abbrev Number: 7 (DW_TAG_member)
    <e84>   DW_AT_name        : (indirect string, offset: 0x7904d): RESERVED4
    <e88>   DW_AT_decl_file   : 4
    <e89>   DW_AT_decl_line   : 617
    <e8b>   DW_AT_decl_column : 17
    <e8c>   DW_AT_type        : <0xc52>
    <e90>   DW_AT_data_member_location: 100
 <2><e91>: Abbrev Number: 7 (DW_TAG_member)
    <e92>   DW_AT_name        : (indirect string, offset: 0xcc066): AHB1SMENR
    <e96>   DW_AT_decl_file   : 4
    <e97>   DW_AT_decl_line   : 618
    <e99>   DW_AT_decl_column : 17
    <e9a>   DW_AT_type        : <0xc5e>
    <e9e>   DW_AT_data_member_location: 104
 <2><e9f>: Abbrev Number: 7 (DW_TAG_member)
    <ea0>   DW_AT_name        : (indirect string, offset: 0xcc110): AHB2SMENR
    <ea4>   DW_AT_decl_file   : 4
    <ea5>   DW_AT_decl_line   : 619
    <ea7>   DW_AT_decl_column : 17
    <ea8>   DW_AT_type        : <0xc5e>
    <eac>   DW_AT_data_member_location: 108
 <2><ead>: Abbrev Number: 7 (DW_TAG_member)
    <eae>   DW_AT_name        : (indirect string, offset: 0xcc038): AHB3SMENR
    <eb2>   DW_AT_decl_file   : 4
    <eb3>   DW_AT_decl_line   : 620
    <eb5>   DW_AT_decl_column : 17
    <eb6>   DW_AT_type        : <0xc5e>
    <eba>   DW_AT_data_member_location: 112
 <2><ebb>: Abbrev Number: 7 (DW_TAG_member)
    <ebc>   DW_AT_name        : (indirect string, offset: 0xbf725): RESERVED5
    <ec0>   DW_AT_decl_file   : 4
    <ec1>   DW_AT_decl_line   : 621
    <ec3>   DW_AT_decl_column : 17
    <ec4>   DW_AT_type        : <0xc52>
    <ec8>   DW_AT_data_member_location: 116
 <2><ec9>: Abbrev Number: 7 (DW_TAG_member)
    <eca>   DW_AT_name        : (indirect string, offset: 0xcbf92): APB1SMENR1
    <ece>   DW_AT_decl_file   : 4
    <ecf>   DW_AT_decl_line   : 622
    <ed1>   DW_AT_decl_column : 17
    <ed2>   DW_AT_type        : <0xc5e>
    <ed6>   DW_AT_data_member_location: 120
 <2><ed7>: Abbrev Number: 7 (DW_TAG_member)
    <ed8>   DW_AT_name        : (indirect string, offset: 0xcbf9d): APB1SMENR2
    <edc>   DW_AT_decl_file   : 4
    <edd>   DW_AT_decl_line   : 623
    <edf>   DW_AT_decl_column : 17
    <ee0>   DW_AT_type        : <0xc5e>
    <ee4>   DW_AT_data_member_location: 124
 <2><ee5>: Abbrev Number: 7 (DW_TAG_member)
    <ee6>   DW_AT_name        : (indirect string, offset: 0xcc0f9): APB2SMENR
    <eea>   DW_AT_decl_file   : 4
    <eeb>   DW_AT_decl_line   : 624
    <eed>   DW_AT_decl_column : 17
    <eee>   DW_AT_type        : <0xc5e>
    <ef2>   DW_AT_data_member_location: 128
 <2><ef3>: Abbrev Number: 7 (DW_TAG_member)
    <ef4>   DW_AT_name        : (indirect string, offset: 0xcc08f): RESERVED6
    <ef8>   DW_AT_decl_file   : 4
    <ef9>   DW_AT_decl_line   : 625
    <efb>   DW_AT_decl_column : 17
    <efc>   DW_AT_type        : <0xc52>
    <f00>   DW_AT_data_member_location: 132
 <2><f01>: Abbrev Number: 7 (DW_TAG_member)
    <f02>   DW_AT_name        : (indirect string, offset: 0xcc026): CCIPR
    <f06>   DW_AT_decl_file   : 4
    <f07>   DW_AT_decl_line   : 626
    <f09>   DW_AT_decl_column : 17
    <f0a>   DW_AT_type        : <0xc5e>
    <f0e>   DW_AT_data_member_location: 136
 <2><f0f>: Abbrev Number: 7 (DW_TAG_member)
    <f10>   DW_AT_name        : (indirect string, offset: 0xcc13a): RESERVED7
    <f14>   DW_AT_decl_file   : 4
    <f15>   DW_AT_decl_line   : 627
    <f17>   DW_AT_decl_column : 17
    <f18>   DW_AT_type        : <0xc52>
    <f1c>   DW_AT_data_member_location: 140
 <2><f1d>: Abbrev Number: 7 (DW_TAG_member)
    <f1e>   DW_AT_name        : (indirect string, offset: 0xcc013): BDCR
    <f22>   DW_AT_decl_file   : 4
    <f23>   DW_AT_decl_line   : 628
    <f25>   DW_AT_decl_column : 17
    <f26>   DW_AT_type        : <0xc5e>
    <f2a>   DW_AT_data_member_location: 144
 <2><f2b>: Abbrev Number: 8 (DW_TAG_member)
    <f2c>   DW_AT_name        : CSR
    <f30>   DW_AT_decl_file   : 4
    <f31>   DW_AT_decl_line   : 629
    <f33>   DW_AT_decl_column : 17
    <f34>   DW_AT_type        : <0xc5e>
    <f38>   DW_AT_data_member_location: 148
 <2><f39>: Abbrev Number: 7 (DW_TAG_member)
    <f3a>   DW_AT_name        : (indirect string, offset: 0xcc020): CRRCR
    <f3e>   DW_AT_decl_file   : 4
    <f3f>   DW_AT_decl_line   : 630
    <f41>   DW_AT_decl_column : 17
    <f42>   DW_AT_type        : <0xc5e>
    <f46>   DW_AT_data_member_location: 152
 <2><f47>: Abbrev Number: 0
 <1><f48>: Abbrev Number: 11 (DW_TAG_typedef)
    <f49>   DW_AT_name        : (indirect string, offset: 0xcc070): RCC_TypeDef
    <f4d>   DW_AT_decl_file   : 4
    <f4e>   DW_AT_decl_line   : 631
    <f50>   DW_AT_decl_column : 3
    <f51>   DW_AT_type        : <0xd1c>
 <1><f55>: Abbrev Number: 2 (DW_TAG_base_type)
    <f56>   DW_AT_byte_size   : 8
    <f57>   DW_AT_encoding    : 4	(float)
    <f58>   DW_AT_name        : (indirect string, offset: 0x12da1): long double
 <1><f5c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f5d>   DW_AT_byte_size   : 20
    <f5e>   DW_AT_decl_file   : 5
    <f5f>   DW_AT_decl_line   : 46
    <f60>   DW_AT_decl_column : 9
    <f61>   DW_AT_sibling     : <0xfa7>
 <2><f65>: Abbrev Number: 13 (DW_TAG_member)
    <f66>   DW_AT_name        : Pin
    <f6a>   DW_AT_decl_file   : 5
    <f6b>   DW_AT_decl_line   : 48
    <f6c>   DW_AT_decl_column : 12
    <f6d>   DW_AT_type        : <0xc52>
    <f71>   DW_AT_data_member_location: 0
 <2><f72>: Abbrev Number: 14 (DW_TAG_member)
    <f73>   DW_AT_name        : (indirect string, offset: 0xcdaef): Mode
    <f77>   DW_AT_decl_file   : 5
    <f78>   DW_AT_decl_line   : 51
    <f79>   DW_AT_decl_column : 12
    <f7a>   DW_AT_type        : <0xc52>
    <f7e>   DW_AT_data_member_location: 4
 <2><f7f>: Abbrev Number: 14 (DW_TAG_member)
    <f80>   DW_AT_name        : (indirect string, offset: 0xcc084): Pull
    <f84>   DW_AT_decl_file   : 5
    <f85>   DW_AT_decl_line   : 54
    <f86>   DW_AT_decl_column : 12
    <f87>   DW_AT_type        : <0xc52>
    <f8b>   DW_AT_data_member_location: 8
 <2><f8c>: Abbrev Number: 14 (DW_TAG_member)
    <f8d>   DW_AT_name        : (indirect string, offset: 0xcc089): Speed
    <f91>   DW_AT_decl_file   : 5
    <f92>   DW_AT_decl_line   : 57
    <f93>   DW_AT_decl_column : 12
    <f94>   DW_AT_type        : <0xc52>
    <f98>   DW_AT_data_member_location: 12
 <2><f99>: Abbrev Number: 14 (DW_TAG_member)
    <f9a>   DW_AT_name        : (indirect string, offset: 0xcc05c): Alternate
    <f9e>   DW_AT_decl_file   : 5
    <f9f>   DW_AT_decl_line   : 60
    <fa0>   DW_AT_decl_column : 12
    <fa1>   DW_AT_type        : <0xc52>
    <fa5>   DW_AT_data_member_location: 16
 <2><fa6>: Abbrev Number: 0
 <1><fa7>: Abbrev Number: 3 (DW_TAG_typedef)
    <fa8>   DW_AT_name        : (indirect string, offset: 0xcc0cf): GPIO_InitTypeDef
    <fac>   DW_AT_decl_file   : 5
    <fad>   DW_AT_decl_line   : 62
    <fae>   DW_AT_decl_column : 3
    <faf>   DW_AT_type        : <0xf5c>
 <1><fb3>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <fb4>   DW_AT_encoding    : 7	(unsigned)
    <fb5>   DW_AT_byte_size   : 1
    <fb6>   DW_AT_type        : <0xbef>
    <fba>   DW_AT_decl_file   : 5
    <fbb>   DW_AT_decl_line   : 68
    <fbc>   DW_AT_decl_column : 1
    <fbd>   DW_AT_sibling     : <0xfce>
 <2><fc1>: Abbrev Number: 16 (DW_TAG_enumerator)
    <fc2>   DW_AT_name        : (indirect string, offset: 0xcbfff): GPIO_PIN_RESET
    <fc6>   DW_AT_const_value : 0
 <2><fc7>: Abbrev Number: 16 (DW_TAG_enumerator)
    <fc8>   DW_AT_name        : (indirect string, offset: 0xcbfb0): GPIO_PIN_SET
    <fcc>   DW_AT_const_value : 1
 <2><fcd>: Abbrev Number: 0
 <1><fce>: Abbrev Number: 3 (DW_TAG_typedef)
    <fcf>   DW_AT_name        : (indirect string, offset: 0xcc151): GPIO_PinState
    <fd3>   DW_AT_decl_file   : 5
    <fd4>   DW_AT_decl_line   : 71
    <fd5>   DW_AT_decl_column : 3
    <fd6>   DW_AT_type        : <0xfb3>
 <1><fda>: Abbrev Number: 17 (DW_TAG_subprogram)
    <fdb>   DW_AT_external    : 1
    <fdb>   DW_AT_name        : (indirect string, offset: 0xcc099): HAL_GPIO_Init
    <fdf>   DW_AT_decl_file   : 5
    <fe0>   DW_AT_decl_line   : 283
    <fe2>   DW_AT_decl_column : 19
    <fe3>   DW_AT_prototyped  : 1
    <fe3>   DW_AT_declaration : 1
    <fe3>   DW_AT_sibling     : <0xff2>
 <2><fe7>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <fe8>   DW_AT_type        : <0xff2>
 <2><fec>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <fed>   DW_AT_type        : <0xff8>
 <2><ff1>: Abbrev Number: 0
 <1><ff2>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <ff3>   DW_AT_byte_size   : 4
    <ff4>   DW_AT_type        : <0xd0f>
 <1><ff8>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <ff9>   DW_AT_byte_size   : 4
    <ffa>   DW_AT_type        : <0xfa7>
 <1><ffe>: Abbrev Number: 17 (DW_TAG_subprogram)
    <fff>   DW_AT_external    : 1
    <fff>   DW_AT_name        : (indirect string, offset: 0xcbfbd): HAL_GPIO_WritePin
    <1003>   DW_AT_decl_file   : 5
    <1004>   DW_AT_decl_line   : 296
    <1006>   DW_AT_decl_column : 19
    <1007>   DW_AT_prototyped  : 1
    <1007>   DW_AT_declaration : 1
    <1007>   DW_AT_sibling     : <0x101b>
 <2><100b>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <100c>   DW_AT_type        : <0xff2>
 <2><1010>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <1011>   DW_AT_type        : <0xc46>
 <2><1015>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <1016>   DW_AT_type        : <0xfce>
 <2><101a>: Abbrev Number: 0
 <1><101b>: Abbrev Number: 20 (DW_TAG_subprogram)
    <101c>   DW_AT_external    : 1
    <101c>   DW_AT_name        : (indirect string, offset: 0xcc0ad): MX_GPIO_Init
    <1020>   DW_AT_decl_file   : 1
    <1021>   DW_AT_decl_line   : 42
    <1022>   DW_AT_decl_column : 6
    <1023>   DW_AT_prototyped  : 1
    <1023>   DW_AT_low_pc      : 0x8000728
    <1027>   DW_AT_high_pc     : 0x94
    <102b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <102d>   DW_AT_GNU_all_tail_call_sites: 1
 <2><102d>: Abbrev Number: 21 (DW_TAG_variable)
    <102e>   DW_AT_name        : (indirect string, offset: 0xcc0e9): GPIO_InitStruct
    <1032>   DW_AT_decl_file   : 1
    <1033>   DW_AT_decl_line   : 45
    <1034>   DW_AT_decl_column : 20
    <1035>   DW_AT_type        : <0xfa7>
    <1039>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><103c>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <103d>   DW_AT_low_pc      : 0x800073e
    <1041>   DW_AT_high_pc     : 0x18
    <1045>   DW_AT_sibling     : <0x1059>
 <3><1049>: Abbrev Number: 21 (DW_TAG_variable)
    <104a>   DW_AT_name        : (indirect string, offset: 0xcbf6a): tmpreg
    <104e>   DW_AT_decl_file   : 1
    <104f>   DW_AT_decl_line   : 48
    <1050>   DW_AT_decl_column : 3
    <1051>   DW_AT_type        : <0xc5e>
    <1055>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><1058>: Abbrev Number: 0
 <2><1059>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <105a>   DW_AT_low_pc      : 0x8000756
    <105e>   DW_AT_high_pc     : 0x18
    <1062>   DW_AT_sibling     : <0x1076>
 <3><1066>: Abbrev Number: 21 (DW_TAG_variable)
