Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x3a8 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xc2df0): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x88c7f): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xc5b94): /home/rini/OneDrive/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/TUT04/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x109b6): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5bf18): long long int

    <1a6>   DW_AT_name        : (indirect string, offset: 0x857ce): osPriorityHigh4
    <1aa>   DW_AT_const_value : 44
 <2><1ab>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1ac>   DW_AT_name        : (indirect string, offset: 0x42fb): osPriorityHigh5
    <1b0>   DW_AT_const_value : 45
 <2><1b1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1b2>   DW_AT_name        : (indirect string, offset: 0x8580a): osPriorityHigh6
    <1b6>   DW_AT_const_value : 46
 <2><1b7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x8581a): osPriorityHigh7
    <1bc>   DW_AT_const_value : 47
 <2><1bd>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1be>   DW_AT_name        : (indirect string, offset: 0xb5a12): osPriorityRealtime
    <1c2>   DW_AT_const_value : 48
 <2><1c3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x7e6ce): osPriorityRealtime1
    <1c8>   DW_AT_const_value : 49
 <2><1c9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1ca>   DW_AT_name        : (indirect string, offset: 0x7e6e2): osPriorityRealtime2
    <1ce>   DW_AT_const_value : 50
 <2><1cf>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x7e6f6): osPriorityRealtime3
    <1d4>   DW_AT_const_value : 51
 <2><1d5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x7e70a): osPriorityRealtime4
    <1da>   DW_AT_const_value : 52
 <2><1db>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x7e71e): osPriorityRealtime5
    <1e0>   DW_AT_const_value : 53
 <2><1e1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x7e732): osPriorityRealtime6
    <1e6>   DW_AT_const_value : 54
 <2><1e7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x7e746): osPriorityRealtime7
    <1ec>   DW_AT_const_value : 55
 <2><1ed>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1ee>   DW_AT_name        : (indirect string, offset: 0xcc2): osPriorityISR
    <1f2>   DW_AT_const_value : 56
 <2><1f3>: Abbrev Number: 12 (DW_TAG_enumerator)
    <1f4>   DW_AT_name        : (indirect string, offset: 0xb10a8): osPriorityError
    <1f8>   DW_AT_const_value : -1
 <2><1f9>: Abbrev Number: 13 (DW_TAG_enumerator)
    <1fa>   DW_AT_name        : (indirect string, offset: 0xbeb91): osPriorityReserved
    <1fe>   DW_AT_const_value : 0x7fffffff
 <2><202>: Abbrev Number: 0
 <1><203>: Abbrev Number: 4 (DW_TAG_typedef)
    <204>   DW_AT_name        : (indirect string, offset: 0x93ea3): osPriority_t
    <208>   DW_AT_decl_file   : 4
    <209>   DW_AT_decl_line   : 136
    <20a>   DW_AT_decl_column : 3
    <20b>   DW_AT_type        : <0xb3>
 <1><20f>: Abbrev Number: 4 (DW_TAG_typedef)
    <210>   DW_AT_name        : (indirect string, offset: 0x6d27b): osThreadFunc_t
    <214>   DW_AT_decl_file   : 4
    <215>   DW_AT_decl_line   : 139
    <216>   DW_AT_decl_column : 16
    <217>   DW_AT_type        : <0x8e>
 <1><21b>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <21c>   DW_AT_encoding    : 5	(signed)
    <21d>   DW_AT_byte_size   : 4
    <21e>   DW_AT_type        : <0x29>
    <222>   DW_AT_decl_file   : 4
    <223>   DW_AT_decl_line   : 176
    <224>   DW_AT_decl_column : 14
    <225>   DW_AT_sibling     : <0x25d>
 <2><229>: Abbrev Number: 11 (DW_TAG_enumerator)
    <22a>   DW_AT_name        : (indirect string, offset: 0x9a8d2): osOK
    <22e>   DW_AT_const_value : 0
 <2><22f>: Abbrev Number: 12 (DW_TAG_enumerator)
    <230>   DW_AT_name        : (indirect string, offset: 0x5d1ed): osError
    <234>   DW_AT_const_value : -1
 <2><235>: Abbrev Number: 12 (DW_TAG_enumerator)
    <236>   DW_AT_name        : (indirect string, offset: 0x22707): osErrorTimeout
    <23a>   DW_AT_const_value : -2
 <2><23b>: Abbrev Number: 12 (DW_TAG_enumerator)
    <23c>   DW_AT_name        : (indirect string, offset: 0x83cb3): osErrorResource
    <240>   DW_AT_const_value : -3
 <2><241>: Abbrev Number: 12 (DW_TAG_enumerator)
    <242>   DW_AT_name        : (indirect string, offset: 0x34053): osErrorParameter
    <246>   DW_AT_const_value : -4
 <2><247>: Abbrev Number: 12 (DW_TAG_enumerator)
    <248>   DW_AT_name        : (indirect string, offset: 0x22dd5): osErrorNoMemory
    <24c>   DW_AT_const_value : -5
 <2><24d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <24e>   DW_AT_name        : (indirect string, offset: 0x36169): osErrorISR
    <252>   DW_AT_const_value : -6
 <2><253>: Abbrev Number: 13 (DW_TAG_enumerator)
    <254>   DW_AT_name        : (indirect string, offset: 0x65c58): osStatusReserved
    <258>   DW_AT_const_value : 0x7fffffff
 <2><25c>: Abbrev Number: 0
 <1><25d>: Abbrev Number: 4 (DW_TAG_typedef)
    <25e>   DW_AT_name        : (indirect string, offset: 0x44188): osStatus_t
    <262>   DW_AT_decl_file   : 4
    <263>   DW_AT_decl_line   : 185
    <264>   DW_AT_decl_column : 3
    <265>   DW_AT_type        : <0x21b>
 <1><269>: Abbrev Number: 4 (DW_TAG_typedef)
    <26a>   DW_AT_name        : (indirect string, offset: 0x24a49): osThreadId_t
    <26e>   DW_AT_decl_file   : 4
    <26f>   DW_AT_decl_line   : 189
    <270>   DW_AT_decl_column : 15
    <271>   DW_AT_type        : <0x9f>
 <1><275>: Abbrev Number: 4 (DW_TAG_typedef)
    <276>   DW_AT_name        : (indirect string, offset: 0x87388): TZ_ModuleId_t
    <27a>   DW_AT_decl_file   : 4
    <27b>   DW_AT_decl_line   : 213
    <27c>   DW_AT_decl_column : 18
    <27d>   DW_AT_type        : <0x82>
 <1><281>: Abbrev Number: 14 (DW_TAG_structure_type)
    <282>   DW_AT_byte_size   : 36
    <283>   DW_AT_decl_file   : 4
    <284>   DW_AT_decl_line   : 218
    <285>   DW_AT_decl_column : 9
    <286>   DW_AT_sibling     : <0x300>
 <2><28a>: Abbrev Number: 15 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0xb3854): name
    <28f>   DW_AT_decl_file   : 4
    <290>   DW_AT_decl_line   : 219
    <291>   DW_AT_decl_column : 33
    <292>   DW_AT_type        : <0xad>
    <296>   DW_AT_data_member_location: 0
 <2><297>: Abbrev Number: 15 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0x839f7): attr_bits
    <29c>   DW_AT_decl_file   : 4
    <29d>   DW_AT_decl_line   : 220
    <29e>   DW_AT_decl_column : 28
    <29f>   DW_AT_type        : <0x82>
    <2a3>   DW_AT_data_member_location: 4
 <2><2a4>: Abbrev Number: 15 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x27210): cb_mem
    <2a9>   DW_AT_decl_file   : 4
    <2aa>   DW_AT_decl_line   : 221
    <2ab>   DW_AT_decl_column : 30
    <2ac>   DW_AT_type        : <0x9f>
    <2b0>   DW_AT_data_member_location: 8
 <2><2b1>: Abbrev Number: 15 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0xbddd8): cb_size
    <2b6>   DW_AT_decl_file   : 4
    <2b7>   DW_AT_decl_line   : 222
    <2b8>   DW_AT_decl_column : 30
    <2b9>   DW_AT_type        : <0x82>
    <2bd>   DW_AT_data_member_location: 12
 <2><2be>: Abbrev Number: 15 (DW_TAG_member)
    <2bf>   DW_AT_name        : (indirect string, offset: 0xb62f5): stack_mem
    <2c3>   DW_AT_decl_file   : 4
    <2c4>   DW_AT_decl_line   : 223
    <2c5>   DW_AT_decl_column : 27
    <2c6>   DW_AT_type        : <0x9f>
    <2ca>   DW_AT_data_member_location: 16
 <2><2cb>: Abbrev Number: 15 (DW_TAG_member)
    <2cc>   DW_AT_name        : (indirect string, offset: 0x7e7ab): stack_size
    <2d0>   DW_AT_decl_file   : 4
    <2d1>   DW_AT_decl_line   : 224
    <2d2>   DW_AT_decl_column : 27
    <2d3>   DW_AT_type        : <0x82>
    <2d7>   DW_AT_data_member_location: 20
 <2><2d8>: Abbrev Number: 15 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x4faa7): priority
    <2dd>   DW_AT_decl_file   : 4
    <2de>   DW_AT_decl_line   : 225
    <2df>   DW_AT_decl_column : 29
    <2e0>   DW_AT_type        : <0x203>
    <2e4>   DW_AT_data_member_location: 24
 <2><2e5>: Abbrev Number: 15 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x55b91): tz_module
    <2ea>   DW_AT_decl_file   : 4
    <2eb>   DW_AT_decl_line   : 226
    <2ec>   DW_AT_decl_column : 28
    <2ed>   DW_AT_type        : <0x275>
    <2f1>   DW_AT_data_member_location: 28
 <2><2f2>: Abbrev Number: 15 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0xb40d0): reserved
    <2f7>   DW_AT_decl_file   : 4
    <2f8>   DW_AT_decl_line   : 227
    <2f9>   DW_AT_decl_column : 29
    <2fa>   DW_AT_type        : <0x82>
    <2fe>   DW_AT_data_member_location: 32
 <2><2ff>: Abbrev Number: 0
 <1><300>: Abbrev Number: 4 (DW_TAG_typedef)
    <301>   DW_AT_name        : (indirect string, offset: 0x1fc87): osThreadAttr_t
    <305>   DW_AT_decl_file   : 4
    <306>   DW_AT_decl_line   : 228
    <307>   DW_AT_decl_column : 3
    <308>   DW_AT_type        : <0x281>
 <1><30c>: Abbrev Number: 9 (DW_TAG_const_type)
    <30d>   DW_AT_type        : <0x300>
 <1><311>: Abbrev Number: 16 (DW_TAG_variable)
    <312>   DW_AT_name        : (indirect string, offset: 0x31a3c): initTaskHandle
    <316>   DW_AT_decl_file   : 1
    <317>   DW_AT_decl_line   : 50
    <318>   DW_AT_decl_column : 14
    <319>   DW_AT_type        : <0x269>
    <31d>   DW_AT_external    : 1
    <31d>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><323>: Abbrev Number: 16 (DW_TAG_variable)
    <324>   DW_AT_name        : (indirect string, offset: 0x8af05): initTask_attributes
    <328>   DW_AT_decl_file   : 1
    <329>   DW_AT_decl_line   : 51
    <32a>   DW_AT_decl_column : 22
    <32b>   DW_AT_type        : <0x30c>
    <32f>   DW_AT_external    : 1
    <32f>   DW_AT_location    : 5 byte block: 3 b8 67 0 8 	(DW_OP_addr: 80067b8)
 <1><335>: Abbrev Number: 17 (DW_TAG_subprogram)
    <336>   DW_AT_external    : 1
    <336>   DW_AT_name        : (indirect string, offset: 0xc699f): osDelay
    <33a>   DW_AT_decl_file   : 4
    <33b>   DW_AT_decl_line   : 459
    <33d>   DW_AT_decl_column : 12
    <33e>   DW_AT_prototyped  : 1
    <33e>   DW_AT_type        : <0x25d>
    <342>   DW_AT_declaration : 1
    <342>   DW_AT_sibling     : <0x34c>
 <2><346>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <347>   DW_AT_type        : <0x82>
 <2><34b>: Abbrev Number: 0
 <1><34c>: Abbrev Number: 17 (DW_TAG_subprogram)
    <34d>   DW_AT_external    : 1
    <34d>   DW_AT_name        : (indirect string, offset: 0x70058): osThreadNew
    <351>   DW_AT_decl_file   : 4
    <352>   DW_AT_decl_line   : 349
    <354>   DW_AT_decl_column : 14
    <355>   DW_AT_prototyped  : 1
    <355>   DW_AT_type        : <0x269>
    <359>   DW_AT_declaration : 1
    <359>   DW_AT_sibling     : <0x36d>
 <2><35d>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <35e>   DW_AT_type        : <0x20f>
 <2><362>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <363>   DW_AT_type        : <0x9f>
 <2><367>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <368>   DW_AT_type        : <0x36d>
 <2><36c>: Abbrev Number: 0
 <1><36d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <36e>   DW_AT_byte_size   : 4
    <36f>   DW_AT_type        : <0x30c>
 <1><373>: Abbrev Number: 18 (DW_TAG_subprogram)
    <374>   DW_AT_external    : 1
    <374>   DW_AT_name        : (indirect string, offset: 0x84af): InitTasks
    <378>   DW_AT_decl_file   : 1
    <379>   DW_AT_decl_line   : 113
    <37a>   DW_AT_decl_column : 13
    <37b>   DW_AT_prototyped  : 1
    <37b>   DW_AT_low_pc      : 0x0
    <37f>   DW_AT_high_pc     : 0x10
    <383>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <385>   DW_AT_GNU_all_tail_call_sites: 1
    <385>   DW_AT_sibling     : <0x399>
 <2><389>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <38a>   DW_AT_name        : (indirect string, offset: 0x2ad4d): argument
    <38e>   DW_AT_decl_file   : 1
    <38f>   DW_AT_decl_line   : 113
    <390>   DW_AT_decl_column : 29
    <391>   DW_AT_type        : <0x9f>
    <395>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><398>: Abbrev Number: 0
 <1><399>: Abbrev Number: 20 (DW_TAG_subprogram)
    <39a>   DW_AT_external    : 1
    <39a>   DW_AT_name        : (indirect string, offset: 0xa1780): MX_FREERTOS_Init
    <39e>   DW_AT_decl_file   : 1
    <39f>   DW_AT_decl_line   : 71
    <3a0>   DW_AT_decl_column : 6
    <3a1>   DW_AT_prototyped  : 1
    <3a1>   DW_AT_low_pc      : 0x80004d4
    <3a5>   DW_AT_high_pc     : 0x24
    <3a9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3ab>   DW_AT_GNU_all_tail_call_sites: 1
 <1><3ab>: Abbrev Number: 0
  Compilation Unit @ offset 0x3ac:
   Length:        0x4ce (32-bit)
   Version:       4
   Abbrev Offset: 0x122
   Pointer Size:  4
 <0><3b7>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <3b8>   DW_AT_producer    : (indirect string, offset: 0xc2df0): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <3bc>   DW_AT_language    : 12	(ANSI C99)
    <3bd>   DW_AT_name        : (indirect string, offset: 0xc9577): ../Core/Src/gpio.c
    <3c1>   DW_AT_comp_dir    : (indirect string, offset: 0xc5b94): /home/rini/OneDrive/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/TUT04/Debug
    <3c5>   DW_AT_ranges      : 0x18
    <3c9>   DW_AT_low_pc      : 0x0
    <3cd>   DW_AT_stmt_list   : 0x95b
    <3d1>   DW_AT_GNU_macros  : 0x1f970
 <1><3d5>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d6>   DW_AT_byte_size   : 1
    <3d7>   DW_AT_encoding    : 6	(signed char)
    <3d8>   DW_AT_name        : (indirect string, offset: 0x650d2): signed char
 <1><3dc>: Abbrev Number: 2 (DW_TAG_base_type)
    <3dd>   DW_AT_byte_size   : 1
    <3de>   DW_AT_encoding    : 8	(unsigned char)
    <3df>   DW_AT_name        : (indirect string, offset: 0xc1a87): unsigned char
 <1><3e3>: Abbrev Number: 2 (DW_TAG_base_type)
    <3e4>   DW_AT_byte_size   : 2
    <3e5>   DW_AT_encoding    : 5	(signed)
    <3e6>   DW_AT_name        : (indirect string, offset: 0x95572): short int
 <1><3ea>: Abbrev Number: 3 (DW_TAG_typedef)
    <3eb>   DW_AT_name        : (indirect string, offset: 0xc96ac): __uint16_t
    <3ef>   DW_AT_decl_file   : 2
    <3f0>   DW_AT_decl_line   : 57
    <3f1>   DW_AT_decl_column : 25
    <3f2>   DW_AT_type        : <0x3f6>
 <1><3f6>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f7>   DW_AT_byte_size   : 2
    <3f8>   DW_AT_encoding    : 7	(unsigned)
    <3f9>   DW_AT_name        : (indirect string, offset: 0xc0295): short unsigned int
 <1><3fd>: Abbrev Number: 2 (DW_TAG_base_type)
    <3fe>   DW_AT_byte_size   : 4
    <3ff>   DW_AT_encoding    : 5	(signed)
    <400>   DW_AT_name        : (indirect string, offset: 0x113e0): long int
 <1><404>: Abbrev Number: 3 (DW_TAG_typedef)
    <405>   DW_AT_name        : (indirect string, offset: 0x805a1): __uint32_t
    <409>   DW_AT_decl_file   : 2
    <40a>   DW_AT_decl_line   : 79
    <40b>   DW_AT_decl_column : 25
    <40c>   DW_AT_type        : <0x410>
 <1><410>: Abbrev Number: 2 (DW_TAG_base_type)
    <411>   DW_AT_byte_size   : 4
    <412>   DW_AT_encoding    : 7	(unsigned)
    <413>   DW_AT_name        : (indirect string, offset: 0x4cdee): long unsigned int
 <1><417>: Abbrev Number: 2 (DW_TAG_base_type)
    <418>   DW_AT_byte_size   : 8
    <419>   DW_AT_encoding    : 5	(signed)
    <41a>   DW_AT_name        : (indirect string, offset: 0x5bf18): long long int
 <1><41e>: Abbrev Number: 2 (DW_TAG_base_type)
    <41f>   DW_AT_byte_size   : 8
    <420>   DW_AT_encoding    : 7	(unsigned)
    <421>   DW_AT_name        : (indirect string, offset: 0x29b31): long long unsigned int
 <1><425>: Abbrev Number: 4 (DW_TAG_base_type)
    <426>   DW_AT_byte_size   : 4
    <427>   DW_AT_encoding    : 5	(signed)
    <428>   DW_AT_name        : int
 <1><42c>: Abbrev Number: 2 (DW_TAG_base_type)
    <42d>   DW_AT_byte_size   : 4
    <42e>   DW_AT_encoding    : 7	(unsigned)
    <42f>   DW_AT_name        : (indirect string, offset: 0x109b6): unsigned int
 <1><433>: Abbrev Number: 3 (DW_TAG_typedef)
    <434>   DW_AT_name        : (indirect string, offset: 0x92666): uint16_t
    <438>   DW_AT_decl_file   : 3
    <439>   DW_AT_decl_line   : 36
    <43a>   DW_AT_decl_column : 20
    <43b>   DW_AT_type        : <0x3ea>
 <1><43f>: Abbrev Number: 3 (DW_TAG_typedef)
    <440>   DW_AT_name        : (indirect string, offset: 0x91c47): uint32_t
    <444>   DW_AT_decl_file   : 3
    <445>   DW_AT_decl_line   : 48
    <446>   DW_AT_decl_column : 20
    <447>   DW_AT_type        : <0x404>
 <1><44b>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <44c>   DW_AT_type        : <0x43f>
 <1><450>: Abbrev Number: 6 (DW_TAG_structure_type)
    <451>   DW_AT_byte_size   : 44
    <452>   DW_AT_decl_file   : 4
    <453>   DW_AT_decl_line   : 451
    <455>   DW_AT_decl_column : 9
    <456>   DW_AT_sibling     : <0x4e7>
 <2><45a>: Abbrev Number: 7 (DW_TAG_member)
    <45b>   DW_AT_name        : (indirect string, offset: 0xc9503): MODER
    <45f>   DW_AT_decl_file   : 4
    <460>   DW_AT_decl_line   : 453
    <462>   DW_AT_decl_column : 17
    <463>   DW_AT_type        : <0x44b>
    <467>   DW_AT_data_member_location: 0
 <2><468>: Abbrev Number: 7 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0xc9671): OTYPER
    <46d>   DW_AT_decl_file   : 4
    <46e>   DW_AT_decl_line   : 454
    <470>   DW_AT_decl_column : 17
    <471>   DW_AT_type        : <0x44b>
    <475>   DW_AT_data_member_location: 4
 <2><476>: Abbrev Number: 7 (DW_TAG_member)
    <477>   DW_AT_name        : (indirect string, offset: 0xc96bc): OSPEEDR
    <47b>   DW_AT_decl_file   : 4
    <47c>   DW_AT_decl_line   : 455
    <47e>   DW_AT_decl_column : 17
    <47f>   DW_AT_type        : <0x44b>
    <483>   DW_AT_data_member_location: 8
 <2><484>: Abbrev Number: 7 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0xc9650): PUPDR
    <489>   DW_AT_decl_file   : 4
    <48a>   DW_AT_decl_line   : 456
    <48c>   DW_AT_decl_column : 17
    <48d>   DW_AT_type        : <0x44b>
    <491>   DW_AT_data_member_location: 12
 <2><492>: Abbrev Number: 8 (DW_TAG_member)
    <493>   DW_AT_name        : IDR
    <497>   DW_AT_decl_file   : 4
    <498>   DW_AT_decl_line   : 457
    <49a>   DW_AT_decl_column : 17
    <49b>   DW_AT_type        : <0x44b>
    <49f>   DW_AT_data_member_location: 16
 <2><4a0>: Abbrev Number: 8 (DW_TAG_member)
    <4a1>   DW_AT_name        : ODR
    <4a5>   DW_AT_decl_file   : 4
    <4a6>   DW_AT_decl_line   : 458
    <4a8>   DW_AT_decl_column : 17
    <4a9>   DW_AT_type        : <0x44b>
    <4ad>   DW_AT_data_member_location: 20
 <2><4ae>: Abbrev Number: 7 (DW_TAG_member)
    <4af>   DW_AT_name        : (indirect string, offset: 0xc95ad): BSRR
    <4b3>   DW_AT_decl_file   : 4
    <4b4>   DW_AT_decl_line   : 459
    <4b6>   DW_AT_decl_column : 17
    <4b7>   DW_AT_type        : <0x44b>
    <4bb>   DW_AT_data_member_location: 24
 <2><4bc>: Abbrev Number: 7 (DW_TAG_member)
    <4bd>   DW_AT_name        : (indirect string, offset: 0xc96b7): LCKR
    <4c1>   DW_AT_decl_file   : 4
    <4c2>   DW_AT_decl_line   : 460
    <4c4>   DW_AT_decl_column : 17
    <4c5>   DW_AT_type        : <0x44b>
    <4c9>   DW_AT_data_member_location: 28
 <2><4ca>: Abbrev Number: 8 (DW_TAG_member)
    <4cb>   DW_AT_name        : AFR
    <4cf>   DW_AT_decl_file   : 4
    <4d0>   DW_AT_decl_line   : 461
    <4d2>   DW_AT_decl_column : 17
    <4d3>   DW_AT_type        : <0x4f7>
    <4d7>   DW_AT_data_member_location: 32
 <2><4d8>: Abbrev Number: 8 (DW_TAG_member)
    <4d9>   DW_AT_name        : BRR
    <4dd>   DW_AT_decl_file   : 4
    <4de>   DW_AT_decl_line   : 462
    <4e0>   DW_AT_decl_column : 17
    <4e1>   DW_AT_type        : <0x44b>
    <4e5>   DW_AT_data_member_location: 40
 <2><4e6>: Abbrev Number: 0
 <1><4e7>: Abbrev Number: 9 (DW_TAG_array_type)
    <4e8>   DW_AT_type        : <0x44b>
    <4ec>   DW_AT_sibling     : <0x4f7>
 <2><4f0>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <4f1>   DW_AT_type        : <0x42c>
    <4f5>   DW_AT_upper_bound : 1
 <2><4f6>: Abbrev Number: 0
 <1><4f7>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <4f8>   DW_AT_type        : <0x4e7>
 <1><4fc>: Abbrev Number: 11 (DW_TAG_typedef)
    <4fd>   DW_AT_name        : (indirect string, offset: 0xc9716): GPIO_TypeDef
    <501>   DW_AT_decl_file   : 4
    <502>   DW_AT_decl_line   : 464
    <504>   DW_AT_decl_column : 3
    <505>   DW_AT_type        : <0x450>
 <1><509>: Abbrev Number: 6 (DW_TAG_structure_type)
    <50a>   DW_AT_byte_size   : 156
    <50b>   DW_AT_decl_file   : 4
    <50c>   DW_AT_decl_line   : 590
    <50e>   DW_AT_decl_column : 9
    <50f>   DW_AT_sibling     : <0x735>
 <2><513>: Abbrev Number: 8 (DW_TAG_member)
    <514>   DW_AT_name        : CR
    <517>   DW_AT_decl_file   : 4
    <518>   DW_AT_decl_line   : 592
    <51a>   DW_AT_decl_column : 17
    <51b>   DW_AT_type        : <0x44b>
    <51f>   DW_AT_data_member_location: 0
 <2><520>: Abbrev Number: 7 (DW_TAG_member)
    <521>   DW_AT_name        : (indirect string, offset: 0xc9663): ICSCR
    <525>   DW_AT_decl_file   : 4
    <526>   DW_AT_decl_line   : 593
    <528>   DW_AT_decl_column : 17
    <529>   DW_AT_type        : <0x44b>
    <52d>   DW_AT_data_member_location: 4
 <2><52e>: Abbrev Number: 7 (DW_TAG_member)
    <52f>   DW_AT_name        : (indirect string, offset: 0xc95d2): CFGR
    <533>   DW_AT_decl_file   : 4
    <534>   DW_AT_decl_line   : 594
    <536>   DW_AT_decl_column : 17
    <537>   DW_AT_type        : <0x44b>
    <53b>   DW_AT_data_member_location: 8
 <2><53c>: Abbrev Number: 7 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0xc9669): PLLCFGR
    <541>   DW_AT_decl_file   : 4
    <542>   DW_AT_decl_line   : 595
    <544>   DW_AT_decl_column : 17
    <545>   DW_AT_type        : <0x44b>
    <549>   DW_AT_data_member_location: 12
 <2><54a>: Abbrev Number: 7 (DW_TAG_member)
    <54b>   DW_AT_name        : (indirect string, offset: 0xc95cb): PLLSAI1CFGR
    <54f>   DW_AT_decl_file   : 4
    <550>   DW_AT_decl_line   : 596
    <552>   DW_AT_decl_column : 17
    <553>   DW_AT_type        : <0x44b>
    <557>   DW_AT_data_member_location: 16
 <2><558>: Abbrev Number: 7 (DW_TAG_member)
    <559>   DW_AT_name        : (indirect string, offset: 0x796c6): RESERVED
    <55d>   DW_AT_decl_file   : 4
    <55e>   DW_AT_decl_line   : 597
    <560>   DW_AT_decl_column : 17
    <561>   DW_AT_type        : <0x43f>
    <565>   DW_AT_data_member_location: 20
 <2><566>: Abbrev Number: 7 (DW_TAG_member)
    <567>   DW_AT_name        : (indirect string, offset: 0xc9515): CIER
    <56b>   DW_AT_decl_file   : 4
    <56c>   DW_AT_decl_line   : 598
    <56e>   DW_AT_decl_column : 17
    <56f>   DW_AT_type        : <0x44b>
    <573>   DW_AT_data_member_location: 24
 <2><574>: Abbrev Number: 7 (DW_TAG_member)
    <575>   DW_AT_name        : (indirect string, offset: 0xc951a): CIFR
    <579>   DW_AT_decl_file   : 4
    <57a>   DW_AT_decl_line   : 599
    <57c>   DW_AT_decl_column : 17
    <57d>   DW_AT_type        : <0x44b>
    <581>   DW_AT_data_member_location: 28
 <2><582>: Abbrev Number: 7 (DW_TAG_member)
    <583>   DW_AT_name        : (indirect string, offset: 0xc9510): CICR
    <587>   DW_AT_decl_file   : 4
    <588>   DW_AT_decl_line   : 600
    <58a>   DW_AT_decl_column : 17
    <58b>   DW_AT_type        : <0x44b>
    <58f>   DW_AT_data_member_location: 32
 <2><590>: Abbrev Number: 7 (DW_TAG_member)
    <591>   DW_AT_name        : (indirect string, offset: 0xc96da): RESERVED0
    <595>   DW_AT_decl_file   : 4
    <596>   DW_AT_decl_line   : 601
    <598>   DW_AT_decl_column : 17
    <599>   DW_AT_type        : <0x43f>
    <59d>   DW_AT_data_member_location: 36
 <2><59e>: Abbrev Number: 7 (DW_TAG_member)
    <59f>   DW_AT_name        : (indirect string, offset: 0xc9689): AHB1RSTR
    <5a3>   DW_AT_decl_file   : 4
    <5a4>   DW_AT_decl_line   : 602
    <5a6>   DW_AT_decl_column : 17
    <5a7>   DW_AT_type        : <0x44b>
    <5ab>   DW_AT_data_member_location: 40
 <2><5ac>: Abbrev Number: 7 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0xc956e): AHB2RSTR
    <5b1>   DW_AT_decl_file   : 4
    <5b2>   DW_AT_decl_line   : 603
    <5b4>   DW_AT_decl_column : 17
    <5b5>   DW_AT_type        : <0x44b>
    <5b9>   DW_AT_data_member_location: 44
 <2><5ba>: Abbrev Number: 7 (DW_TAG_member)
    <5bb>   DW_AT_name        : (indirect string, offset: 0xc95ea): AHB3RSTR
    <5bf>   DW_AT_decl_file   : 4
    <5c0>   DW_AT_decl_line   : 604
    <5c2>   DW_AT_decl_column : 17
    <5c3>   DW_AT_type        : <0x44b>
    <5c7>   DW_AT_data_member_location: 48
 <2><5c8>: Abbrev Number: 7 (DW_TAG_member)
    <5c9>   DW_AT_name        : (indirect string, offset: 0xc96e4): RESERVED1
    <5cd>   DW_AT_decl_file   : 4
    <5ce>   DW_AT_decl_line   : 605
    <5d0>   DW_AT_decl_column : 17
    <5d1>   DW_AT_type        : <0x43f>
    <5d5>   DW_AT_data_member_location: 52
 <2><5d6>: Abbrev Number: 7 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0xc958a): APB1RSTR1
    <5db>   DW_AT_decl_file   : 4
    <5dc>   DW_AT_decl_line   : 606
    <5de>   DW_AT_decl_column : 17
    <5df>   DW_AT_type        : <0x44b>
    <5e3>   DW_AT_data_member_location: 56
 <2><5e4>: Abbrev Number: 7 (DW_TAG_member)
    <5e5>   DW_AT_name        : (indirect string, offset: 0xc9594): APB1RSTR2
    <5e9>   DW_AT_decl_file   : 4
    <5ea>   DW_AT_decl_line   : 607
    <5ec>   DW_AT_decl_column : 17
    <5ed>   DW_AT_type        : <0x44b>
    <5f1>   DW_AT_data_member_location: 60
 <2><5f2>: Abbrev Number: 7 (DW_TAG_member)
    <5f3>   DW_AT_name        : (indirect string, offset: 0xc95e1): APB2RSTR
    <5f7>   DW_AT_decl_file   : 4
    <5f8>   DW_AT_decl_line   : 608
    <5fa>   DW_AT_decl_column : 17
    <5fb>   DW_AT_type        : <0x44b>
    <5ff>   DW_AT_data_member_location: 64
 <2><600>: Abbrev Number: 7 (DW_TAG_member)
    <601>   DW_AT_name        : (indirect string, offset: 0xc96ee): RESERVED2
    <605>   DW_AT_decl_file   : 4
    <606>   DW_AT_decl_line   : 609
    <608>   DW_AT_decl_column : 17
    <609>   DW_AT_type        : <0x43f>
    <60d>   DW_AT_data_member_location: 68
 <2><60e>: Abbrev Number: 7 (DW_TAG_member)
    <60f>   DW_AT_name        : (indirect string, offset: 0xc9547): AHB1ENR
    <613>   DW_AT_decl_file   : 4
    <614>   DW_AT_decl_line   : 610
    <616>   DW_AT_decl_column : 17
    <617>   DW_AT_type        : <0x44b>
    <61b>   DW_AT_data_member_location: 72
 <2><61c>: Abbrev Number: 7 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0xc95b7): AHB2ENR
    <621>   DW_AT_decl_file   : 4
    <622>   DW_AT_decl_line   : 611
    <624>   DW_AT_decl_column : 17
    <625>   DW_AT_type        : <0x44b>
    <629>   DW_AT_data_member_location: 76
 <2><62a>: Abbrev Number: 7 (DW_TAG_member)
    <62b>   DW_AT_name        : (indirect string, offset: 0xc95f3): AHB3ENR
    <62f>   DW_AT_decl_file   : 4
    <630>   DW_AT_decl_line   : 612
    <632>   DW_AT_decl_column : 17
    <633>   DW_AT_type        : <0x44b>
    <637>   DW_AT_data_member_location: 80
 <2><638>: Abbrev Number: 7 (DW_TAG_member)
    <639>   DW_AT_name        : (indirect string, offset: 0xc96f8): RESERVED3
    <63d>   DW_AT_decl_file   : 4
    <63e>   DW_AT_decl_line   : 613
    <640>   DW_AT_decl_column : 17
    <641>   DW_AT_type        : <0x43f>
    <645>   DW_AT_data_member_location: 84
 <2><646>: Abbrev Number: 7 (DW_TAG_member)
    <647>   DW_AT_name        : (indirect string, offset: 0xc951f): APB1ENR1
    <64b>   DW_AT_decl_file   : 4
    <64c>   DW_AT_decl_line   : 614
    <64e>   DW_AT_decl_column : 17
    <64f>   DW_AT_type        : <0x44b>
    <653>   DW_AT_data_member_location: 88
 <2><654>: Abbrev Number: 7 (DW_TAG_member)
    <655>   DW_AT_name        : (indirect string, offset: 0xc9528): APB1ENR2
    <659>   DW_AT_decl_file   : 4
    <65a>   DW_AT_decl_line   : 615
    <65c>   DW_AT_decl_column : 17
    <65d>   DW_AT_type        : <0x44b>
    <661>   DW_AT_data_member_location: 92
 <2><662>: Abbrev Number: 7 (DW_TAG_member)
    <663>   DW_AT_name        : (indirect string, offset: 0xc961b): APB2ENR
    <667>   DW_AT_decl_file   : 4
    <668>   DW_AT_decl_line   : 616
    <66a>   DW_AT_decl_column : 17
    <66b>   DW_AT_type        : <0x44b>
    <66f>   DW_AT_data_member_location: 96
 <2><670>: Abbrev Number: 7 (DW_TAG_member)
    <671>   DW_AT_name        : (indirect string, offset: 0xc962e): RESERVED4
    <675>   DW_AT_decl_file   : 4
    <676>   DW_AT_decl_line   : 617
    <678>   DW_AT_decl_column : 17
    <679>   DW_AT_type        : <0x43f>
    <67d>   DW_AT_data_member_location: 100
 <2><67e>: Abbrev Number: 7 (DW_TAG_member)
    <67f>   DW_AT_name        : (indirect string, offset: 0xc9605): AHB1SMENR
    <683>   DW_AT_decl_file   : 4
    <684>   DW_AT_decl_line   : 618
    <686>   DW_AT_decl_column : 17
    <687>   DW_AT_type        : <0x44b>
    <68b>   DW_AT_data_member_location: 104
 <2><68c>: Abbrev Number: 7 (DW_TAG_member)
    <68d>   DW_AT_name        : (indirect string, offset: 0xc96c4): AHB2SMENR
    <691>   DW_AT_decl_file   : 4
    <692>   DW_AT_decl_line   : 619
    <694>   DW_AT_decl_column : 17
    <695>   DW_AT_type        : <0x44b>
    <699>   DW_AT_data_member_location: 108
 <2><69a>: Abbrev Number: 7 (DW_TAG_member)
    <69b>   DW_AT_name        : (indirect string, offset: 0xc95d7): AHB3SMENR
    <69f>   DW_AT_decl_file   : 4
    <6a0>   DW_AT_decl_line   : 620
    <6a2>   DW_AT_decl_column : 17
    <6a3>   DW_AT_type        : <0x44b>
    <6a7>   DW_AT_data_member_location: 112
 <2><6a8>: Abbrev Number: 7 (DW_TAG_member)
    <6a9>   DW_AT_name        : (indirect string, offset: 0xc9702): RESERVED5
    <6ad>   DW_AT_decl_file   : 4
    <6ae>   DW_AT_decl_line   : 621
    <6b0>   DW_AT_decl_column : 17
    <6b1>   DW_AT_type        : <0x43f>
    <6b5>   DW_AT_data_member_location: 116
 <2><6b6>: Abbrev Number: 7 (DW_TAG_member)
    <6b7>   DW_AT_name        : (indirect string, offset: 0xc9531): APB1SMENR1
    <6bb>   DW_AT_decl_file   : 4
    <6bc>   DW_AT_decl_line   : 622
    <6be>   DW_AT_decl_column : 17
    <6bf>   DW_AT_type        : <0x44b>
    <6c3>   DW_AT_data_member_location: 120
 <2><6c4>: Abbrev Number: 7 (DW_TAG_member)
    <6c5>   DW_AT_name        : (indirect string, offset: 0xc953c): APB1SMENR2
    <6c9>   DW_AT_decl_file   : 4
    <6ca>   DW_AT_decl_line   : 623
    <6cc>   DW_AT_decl_column : 17
    <6cd>   DW_AT_type        : <0x44b>
    <6d1>   DW_AT_data_member_location: 124
 <2><6d2>: Abbrev Number: 7 (DW_TAG_member)
    <6d3>   DW_AT_name        : (indirect string, offset: 0xc96a2): APB2SMENR
    <6d7>   DW_AT_decl_file   : 4
    <6d8>   DW_AT_decl_line   : 624
    <6da>   DW_AT_decl_column : 17
    <6db>   DW_AT_type        : <0x44b>
    <6df>   DW_AT_data_member_location: 128
 <2><6e0>: Abbrev Number: 7 (DW_TAG_member)
    <6e1>   DW_AT_name        : (indirect string, offset: 0xc9638): RESERVED6
    <6e5>   DW_AT_decl_file   : 4
    <6e6>   DW_AT_decl_line   : 625
    <6e8>   DW_AT_decl_column : 17
    <6e9>   DW_AT_type        : <0x43f>
    <6ed>   DW_AT_data_member_location: 132
 <2><6ee>: Abbrev Number: 7 (DW_TAG_member)
    <6ef>   DW_AT_name        : (indirect string, offset: 0xc95c5): CCIPR
    <6f3>   DW_AT_decl_file   : 4
    <6f4>   DW_AT_decl_line   : 626
    <6f6>   DW_AT_decl_column : 17
    <6f7>   DW_AT_type        : <0x44b>
    <6fb>   DW_AT_data_member_location: 136
 <2><6fc>: Abbrev Number: 7 (DW_TAG_member)
    <6fd>   DW_AT_name        : (indirect string, offset: 0xc970c): RESERVED7
    <701>   DW_AT_decl_file   : 4
    <702>   DW_AT_decl_line   : 627
    <704>   DW_AT_decl_column : 17
    <705>   DW_AT_type        : <0x43f>
    <709>   DW_AT_data_member_location: 140
 <2><70a>: Abbrev Number: 7 (DW_TAG_member)
    <70b>   DW_AT_name        : (indirect string, offset: 0xc95b2): BDCR
    <70f>   DW_AT_decl_file   : 4
    <710>   DW_AT_decl_line   : 628
    <712>   DW_AT_decl_column : 17
    <713>   DW_AT_type        : <0x44b>
    <717>   DW_AT_data_member_location: 144
 <2><718>: Abbrev Number: 8 (DW_TAG_member)
    <719>   DW_AT_name        : CSR
    <71d>   DW_AT_decl_file   : 4
    <71e>   DW_AT_decl_line   : 629
    <720>   DW_AT_decl_column : 17
    <721>   DW_AT_type        : <0x44b>
    <725>   DW_AT_data_member_location: 148
 <2><726>: Abbrev Number: 7 (DW_TAG_member)
    <727>   DW_AT_name        : (indirect string, offset: 0xc95bf): CRRCR
    <72b>   DW_AT_decl_file   : 4
    <72c>   DW_AT_decl_line   : 630
    <72e>   DW_AT_decl_column : 17
    <72f>   DW_AT_type        : <0x44b>
    <733>   DW_AT_data_member_location: 152
 <2><734>: Abbrev Number: 0
 <1><735>: Abbrev Number: 11 (DW_TAG_typedef)
    <736>   DW_AT_name        : (indirect string, offset: 0xc960f): RCC_TypeDef
    <73a>   DW_AT_decl_file   : 4
    <73b>   DW_AT_decl_line   : 631
    <73d>   DW_AT_decl_column : 3
    <73e>   DW_AT_type        : <0x509>
 <1><742>: Abbrev Number: 2 (DW_TAG_base_type)
    <743>   DW_AT_byte_size   : 8
    <744>   DW_AT_encoding    : 4	(float)
    <745>   DW_AT_name        : (indirect string, offset: 0x12b58): long double
 <1><749>: Abbrev Number: 12 (DW_TAG_structure_type)
    <74a>   DW_AT_byte_size   : 20
    <74b>   DW_AT_decl_file   : 5
    <74c>   DW_AT_decl_line   : 46
    <74d>   DW_AT_decl_column : 9
    <74e>   DW_AT_sibling     : <0x794>
 <2><752>: Abbrev Number: 13 (DW_TAG_member)
    <753>   DW_AT_name        : Pin
    <757>   DW_AT_decl_file   : 5
    <758>   DW_AT_decl_line   : 48
    <759>   DW_AT_decl_column : 12
    <75a>   DW_AT_type        : <0x43f>
    <75e>   DW_AT_data_member_location: 0
 <2><75f>: Abbrev Number: 14 (DW_TAG_member)
    <760>   DW_AT_name        : (indirect string, offset: 0xce4ee): Mode
    <764>   DW_AT_decl_file   : 5
    <765>   DW_AT_decl_line   : 51
    <766>   DW_AT_decl_column : 12
    <767>   DW_AT_type        : <0x43f>
    <76b>   DW_AT_data_member_location: 4
 <2><76c>: Abbrev Number: 14 (DW_TAG_member)
    <76d>   DW_AT_name        : (indirect string, offset: 0xc9623): Pull
    <771>   DW_AT_decl_file   : 5
    <772>   DW_AT_decl_line   : 54
    <773>   DW_AT_decl_column : 12
    <774>   DW_AT_type        : <0x43f>
    <778>   DW_AT_data_member_location: 8
 <2><779>: Abbrev Number: 14 (DW_TAG_member)
    <77a>   DW_AT_name        : (indirect string, offset: 0xc9628): Speed
    <77e>   DW_AT_decl_file   : 5
    <77f>   DW_AT_decl_line   : 57
    <780>   DW_AT_decl_column : 12
    <781>   DW_AT_type        : <0x43f>
    <785>   DW_AT_data_member_location: 12
 <2><786>: Abbrev Number: 14 (DW_TAG_member)
    <787>   DW_AT_name        : (indirect string, offset: 0xc95fb): Alternate
    <78b>   DW_AT_decl_file   : 5
    <78c>   DW_AT_decl_line   : 60
    <78d>   DW_AT_decl_column : 12
    <78e>   DW_AT_type        : <0x43f>
    <792>   DW_AT_data_member_location: 16
 <2><793>: Abbrev Number: 0
 <1><794>: Abbrev Number: 3 (DW_TAG_typedef)
    <795>   DW_AT_name        : (indirect string, offset: 0xc9678): GPIO_InitTypeDef
    <799>   DW_AT_decl_file   : 5
    <79a>   DW_AT_decl_line   : 62
    <79b>   DW_AT_decl_column : 3
    <79c>   DW_AT_type        : <0x749>
 <1><7a0>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <7a1>   DW_AT_encoding    : 7	(unsigned)
    <7a2>   DW_AT_byte_size   : 1
    <7a3>   DW_AT_type        : <0x3dc>
    <7a7>   DW_AT_decl_file   : 5
    <7a8>   DW_AT_decl_line   : 68
    <7a9>   DW_AT_decl_column : 1
    <7aa>   DW_AT_sibling     : <0x7bb>
 <2><7ae>: Abbrev Number: 16 (DW_TAG_enumerator)
    <7af>   DW_AT_name        : (indirect string, offset: 0xc959e): GPIO_PIN_RESET
    <7b3>   DW_AT_const_value : 0
 <2><7b4>: Abbrev Number: 16 (DW_TAG_enumerator)
    <7b5>   DW_AT_name        : (indirect string, offset: 0xc954f): GPIO_PIN_SET
    <7b9>   DW_AT_const_value : 1
 <2><7ba>: Abbrev Number: 0
 <1><7bb>: Abbrev Number: 3 (DW_TAG_typedef)
    <7bc>   DW_AT_name        : (indirect string, offset: 0xc9723): GPIO_PinState
    <7c0>   DW_AT_decl_file   : 5
    <7c1>   DW_AT_decl_line   : 71
    <7c2>   DW_AT_decl_column : 3
    <7c3>   DW_AT_type        : <0x7a0>
 <1><7c7>: Abbrev Number: 17 (DW_TAG_subprogram)
    <7c8>   DW_AT_external    : 1
    <7c8>   DW_AT_name        : (indirect string, offset: 0xc9642): HAL_GPIO_Init
    <7cc>   DW_AT_decl_file   : 5
    <7cd>   DW_AT_decl_line   : 283
    <7cf>   DW_AT_decl_column : 19
    <7d0>   DW_AT_prototyped  : 1
    <7d0>   DW_AT_declaration : 1
    <7d0>   DW_AT_sibling     : <0x7df>
 <2><7d4>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <7d5>   DW_AT_type        : <0x7df>
 <2><7d9>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <7da>   DW_AT_type        : <0x7e5>
 <2><7de>: Abbrev Number: 0
 <1><7df>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <7e0>   DW_AT_byte_size   : 4
    <7e1>   DW_AT_type        : <0x4fc>
 <1><7e5>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <7e6>   DW_AT_byte_size   : 4
    <7e7>   DW_AT_type        : <0x794>
 <1><7eb>: Abbrev Number: 17 (DW_TAG_subprogram)
    <7ec>   DW_AT_external    : 1
    <7ec>   DW_AT_name        : (indirect string, offset: 0xc955c): HAL_GPIO_WritePin
    <7f0>   DW_AT_decl_file   : 5
    <7f1>   DW_AT_decl_line   : 296
    <7f3>   DW_AT_decl_column : 19
    <7f4>   DW_AT_prototyped  : 1
    <7f4>   DW_AT_declaration : 1
    <7f4>   DW_AT_sibling     : <0x808>
 <2><7f8>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <7f9>   DW_AT_type        : <0x7df>
 <2><7fd>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <7fe>   DW_AT_type        : <0x433>
 <2><802>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <803>   DW_AT_type        : <0x7bb>
 <2><807>: Abbrev Number: 0
 <1><808>: Abbrev Number: 20 (DW_TAG_subprogram)
    <809>   DW_AT_external    : 1
    <809>   DW_AT_name        : (indirect string, offset: 0xc9656): MX_GPIO_Init
    <80d>   DW_AT_decl_file   : 1
    <80e>   DW_AT_decl_line   : 42
    <80f>   DW_AT_decl_column : 6
    <810>   DW_AT_prototyped  : 1
    <810>   DW_AT_low_pc      : 0x80004f8
    <814>   DW_AT_high_pc     : 0x94
    <818>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <81a>   DW_AT_GNU_all_tail_call_sites: 1
 <2><81a>: Abbrev Number: 21 (DW_TAG_variable)
    <81b>   DW_AT_name        : (indirect string, offset: 0xc9692): GPIO_InitStruct
    <81f>   DW_AT_decl_file   : 1
    <820>   DW_AT_decl_line   : 45
    <821>   DW_AT_decl_column : 20
    <822>   DW_AT_type        : <0x794>
    <826>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><829>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <82a>   DW_AT_low_pc      : 0x800050e
    <82e>   DW_AT_high_pc     : 0x18
    <832>   DW_AT_sibling     : <0x846>
 <3><836>: Abbrev Number: 21 (DW_TAG_variable)
    <837>   DW_AT_name        : (indirect string, offset: 0xc9509): tmpreg
    <83b>   DW_AT_decl_file   : 1
    <83c>   DW_AT_decl_line   : 48
    <83d>   DW_AT_decl_column : 3
    <83e>   DW_AT_type        : <0x44b>
    <842>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><845>: Abbrev Number: 0
 <2><846>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <847>   DW_AT_low_pc      : 0x8000526
    <84b>   DW_AT_high_pc     : 0x18
    <84f>   DW_AT_sibling     : <0x863>
 <3><853>: Abbrev Number: 21 (DW_TAG_variable)
    <854>   DW_AT_name        : (indirect string, offset: 0xc9509): tmpreg
    <858>   DW_AT_decl_file   : 1
    <859>   DW_AT_decl_line   : 49
    <85a>   DW_AT_decl_column : 3
    <85b>   DW_AT_type        : <0x44b>
    <85f>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><862>: Abbrev Number: 0
 <2><863>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <864>   DW_AT_low_pc      : 0x800053e
    <868>   DW_AT_high_pc     : 0x18
 <3><86c>: Abbrev Number: 21 (DW_TAG_variable)
    <86d>   DW_AT_name        : (indirect string, offset: 0xc9509): tmpreg
    <871>   DW_AT_decl_file   : 1
    <872>   DW_AT_decl_line   : 50
    <873>   DW_AT_decl_column : 3
    <874>   DW_AT_type        : <0x44b>
    <878>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><87b>: Abbrev Number: 0
 <2><87c>: Abbrev Number: 0
 <1><87d>: Abbrev Number: 0
  Compilation Unit @ offset 0x87e:
   Length:        0xc05 (32-bit)
   Version:       4
   Abbrev Offset: 0x268
   Pointer Size:  4
 <0><889>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <88a>   DW_AT_producer    : (indirect string, offset: 0xc2df0): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <88e>   DW_AT_language    : 12	(ANSI C99)
    <88f>   DW_AT_name        : (indirect string, offset: 0xc9d87): ../Core/Src/main.c
    <893>   DW_AT_comp_dir    : (indirect string, offset: 0xc5b94): /home/rini/OneDrive/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/TUT04/Debug
    <897>   DW_AT_ranges      : 0x28
    <89b>   DW_AT_low_pc      : 0x0
    <89f>   DW_AT_stmt_list   : 0x1033
    <8a3>   DW_AT_GNU_macros  : 0x1fb62
 <1><8a7>: Abbrev Number: 2 (DW_TAG_base_type)
    <8a8>   DW_AT_byte_size   : 1
    <8a9>   DW_AT_encoding    : 6	(signed char)
    <8aa>   DW_AT_name        : (indirect string, offset: 0x650d2): signed char
 <1><8ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <8af>   DW_AT_byte_size   : 1
    <8b0>   DW_AT_encoding    : 8	(unsigned char)
    <8b1>   DW_AT_name        : (indirect string, offset: 0xc1a87): unsigned char
 <1><8b5>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b6>   DW_AT_byte_size   : 2
    <8b7>   DW_AT_encoding    : 5	(signed)
    <8b8>   DW_AT_name        : (indirect string, offset: 0x95572): short int
 <1><8bc>: Abbrev Number: 2 (DW_TAG_base_type)
    <8bd>   DW_AT_byte_size   : 2
    <8be>   DW_AT_encoding    : 7	(unsigned)
    <8bf>   DW_AT_name        : (indirect string, offset: 0xc0295): short unsigned int
 <1><8c3>: Abbrev Number: 2 (DW_TAG_base_type)
    <8c4>   DW_AT_byte_size   : 4
    <8c5>   DW_AT_encoding    : 5	(signed)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x113e0): long int
 <1><8ca>: Abbrev Number: 3 (DW_TAG_typedef)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x805a1): __uint32_t
    <8cf>   DW_AT_decl_file   : 3
    <8d0>   DW_AT_decl_line   : 79
    <8d1>   DW_AT_decl_column : 25
    <8d2>   DW_AT_type        : <0x8d6>
 <1><8d6>: Abbrev Number: 2 (DW_TAG_base_type)
    <8d7>   DW_AT_byte_size   : 4
    <8d8>   DW_AT_encoding    : 7	(unsigned)
    <8d9>   DW_AT_name        : (indirect string, offset: 0x4cdee): long unsigned int
 <1><8dd>: Abbrev Number: 2 (DW_TAG_base_type)
    <8de>   DW_AT_byte_size   : 8
    <8df>   DW_AT_encoding    : 5	(signed)
    <8e0>   DW_AT_name        : (indirect string, offset: 0x5bf18): long long int
 <1><8e4>: Abbrev Number: 2 (DW_TAG_base_type)
    <8e5>   DW_AT_byte_size   : 8
    <8e6>   DW_AT_encoding    : 7	(unsigned)
    <8e7>   DW_AT_name        : (indirect string, offset: 0x29b31): long long unsigned int
 <1><8eb>: Abbrev Number: 4 (DW_TAG_base_type)
    <8ec>   DW_AT_byte_size   : 4
    <8ed>   DW_AT_encoding    : 5	(signed)
    <8ee>   DW_AT_name        : int
 <1><8f2>: Abbrev Number: 2 (DW_TAG_base_type)
    <8f3>   DW_AT_byte_size   : 4
    <8f4>   DW_AT_encoding    : 7	(unsigned)
    <8f5>   DW_AT_name        : (indirect string, offset: 0x109b6): unsigned int
 <1><8f9>: Abbrev Number: 3 (DW_TAG_typedef)
    <8fa>   DW_AT_name        : (indirect string, offset: 0x91c47): uint32_t
    <8fe>   DW_AT_decl_file   : 4
    <8ff>   DW_AT_decl_line   : 48
    <900>   DW_AT_decl_column : 20
    <901>   DW_AT_type        : <0x8ca>
 <1><905>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <906>   DW_AT_type        : <0x8f9>
 <1><90a>: Abbrev Number: 6 (DW_TAG_structure_type)
    <90b>   DW_AT_byte_size   : 16
    <90c>   DW_AT_decl_file   : 5
    <90d>   DW_AT_decl_line   : 360
    <90f>   DW_AT_decl_column : 9
    <910>   DW_AT_sibling     : <0x94d>
 <2><914>: Abbrev Number: 7 (DW_TAG_member)
    <915>   DW_AT_name        : CCR
    <919>   DW_AT_decl_file   : 5
    <91a>   DW_AT_decl_line   : 362
    <91c>   DW_AT_decl_column : 17
    <91d>   DW_AT_type        : <0x905>
    <921>   DW_AT_data_member_location: 0
 <2><922>: Abbrev Number: 8 (DW_TAG_member)
    <923>   DW_AT_name        : (indirect string, offset: 0xc98a3): CNDTR
    <927>   DW_AT_decl_file   : 5
    <928>   DW_AT_decl_line   : 363
    <92a>   DW_AT_decl_column : 17
    <92b>   DW_AT_type        : <0x905>
    <92f>   DW_AT_data_member_location: 4
 <2><930>: Abbrev Number: 8 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0xc9e01): CPAR
    <935>   DW_AT_decl_file   : 5
    <936>   DW_AT_decl_line   : 364
    <938>   DW_AT_decl_column : 17
    <939>   DW_AT_type        : <0x905>
    <93d>   DW_AT_data_member_location: 8
 <2><93e>: Abbrev Number: 8 (DW_TAG_member)
    <93f>   DW_AT_name        : (indirect string, offset: 0xc9a30): CMAR
    <943>   DW_AT_decl_file   : 5
    <944>   DW_AT_decl_line   : 365
    <946>   DW_AT_decl_column : 17
    <947>   DW_AT_type        : <0x905>
    <94b>   DW_AT_data_member_location: 12
 <2><94c>: Abbrev Number: 0
 <1><94d>: Abbrev Number: 9 (DW_TAG_typedef)
    <94e>   DW_AT_name        : (indirect string, offset: 0xc9dda): DMA_Channel_TypeDef
    <952>   DW_AT_decl_file   : 5
    <953>   DW_AT_decl_line   : 366
    <955>   DW_AT_decl_column : 3
    <956>   DW_AT_type        : <0x90a>
 <1><95a>: Abbrev Number: 6 (DW_TAG_structure_type)
    <95b>   DW_AT_byte_size   : 8
    <95c>   DW_AT_decl_file   : 5
    <95d>   DW_AT_decl_line   : 368
    <95f>   DW_AT_decl_column : 9
    <960>   DW_AT_sibling     : <0x981>
 <2><964>: Abbrev Number: 7 (DW_TAG_member)
    <965>   DW_AT_name        : ISR
    <969>   DW_AT_decl_file   : 5
    <96a>   DW_AT_decl_line   : 370
    <96c>   DW_AT_decl_column : 17
    <96d>   DW_AT_type        : <0x905>
    <971>   DW_AT_data_member_location: 0
 <2><972>: Abbrev Number: 8 (DW_TAG_member)
    <973>   DW_AT_name        : (indirect string, offset: 0xc9c06): IFCR
    <977>   DW_AT_decl_file   : 5
    <978>   DW_AT_decl_line   : 371
    <97a>   DW_AT_decl_column : 17
    <97b>   DW_AT_type        : <0x905>
    <97f>   DW_AT_data_member_location: 4
 <2><980>: Abbrev Number: 0
 <1><981>: Abbrev Number: 9 (DW_TAG_typedef)
    <982>   DW_AT_name        : (indirect string, offset: 0xc98ff): DMA_TypeDef
    <986>   DW_AT_decl_file   : 5
    <987>   DW_AT_decl_line   : 372
    <989>   DW_AT_decl_column : 3
    <98a>   DW_AT_type        : <0x95a>
 <1><98e>: Abbrev Number: 6 (DW_TAG_structure_type)
    <98f>   DW_AT_byte_size   : 156
    <990>   DW_AT_decl_file   : 5
    <991>   DW_AT_decl_line   : 590
    <993>   DW_AT_decl_column : 9
    <994>   DW_AT_sibling     : <0xbba>
 <2><998>: Abbrev Number: 7 (DW_TAG_member)
    <999>   DW_AT_name        : CR
    <99c>   DW_AT_decl_file   : 5
    <99d>   DW_AT_decl_line   : 592
    <99f>   DW_AT_decl_column : 17
    <9a0>   DW_AT_type        : <0x905>
    <9a4>   DW_AT_data_member_location: 0
 <2><9a5>: Abbrev Number: 8 (DW_TAG_member)
    <9a6>   DW_AT_name        : (indirect string, offset: 0xc9663): ICSCR
    <9aa>   DW_AT_decl_file   : 5
    <9ab>   DW_AT_decl_line   : 593
    <9ad>   DW_AT_decl_column : 17
    <9ae>   DW_AT_type        : <0x905>
    <9b2>   DW_AT_data_member_location: 4
 <2><9b3>: Abbrev Number: 8 (DW_TAG_member)
    <9b4>   DW_AT_name        : (indirect string, offset: 0xc95d2): CFGR
    <9b8>   DW_AT_decl_file   : 5
    <9b9>   DW_AT_decl_line   : 594
    <9bb>   DW_AT_decl_column : 17
    <9bc>   DW_AT_type        : <0x905>
    <9c0>   DW_AT_data_member_location: 8
 <2><9c1>: Abbrev Number: 8 (DW_TAG_member)
    <9c2>   DW_AT_name        : (indirect string, offset: 0xc9669): PLLCFGR
    <9c6>   DW_AT_decl_file   : 5
    <9c7>   DW_AT_decl_line   : 595
    <9c9>   DW_AT_decl_column : 17
    <9ca>   DW_AT_type        : <0x905>
    <9ce>   DW_AT_data_member_location: 12
 <2><9cf>: Abbrev Number: 8 (DW_TAG_member)
    <9d0>   DW_AT_name        : (indirect string, offset: 0xc95cb): PLLSAI1CFGR
    <9d4>   DW_AT_decl_file   : 5
    <9d5>   DW_AT_decl_line   : 596
    <9d7>   DW_AT_decl_column : 17
    <9d8>   DW_AT_type        : <0x905>
    <9dc>   DW_AT_data_member_location: 16
 <2><9dd>: Abbrev Number: 8 (DW_TAG_member)
    <9de>   DW_AT_name        : (indirect string, offset: 0x796c6): RESERVED
    <9e2>   DW_AT_decl_file   : 5
    <9e3>   DW_AT_decl_line   : 597
    <9e5>   DW_AT_decl_column : 17
    <9e6>   DW_AT_type        : <0x8f9>
    <9ea>   DW_AT_data_member_location: 20
 <2><9eb>: Abbrev Number: 8 (DW_TAG_member)
    <9ec>   DW_AT_name        : (indirect string, offset: 0xc9515): CIER
    <9f0>   DW_AT_decl_file   : 5
    <9f1>   DW_AT_decl_line   : 598
    <9f3>   DW_AT_decl_column : 17
    <9f4>   DW_AT_type        : <0x905>
    <9f8>   DW_AT_data_member_location: 24
 <2><9f9>: Abbrev Number: 8 (DW_TAG_member)
    <9fa>   DW_AT_name        : (indirect string, offset: 0xc951a): CIFR
    <9fe>   DW_AT_decl_file   : 5
    <9ff>   DW_AT_decl_line   : 599
    <a01>   DW_AT_decl_column : 17
    <a02>   DW_AT_type        : <0x905>
    <a06>   DW_AT_data_member_location: 28
 <2><a07>: Abbrev Number: 8 (DW_TAG_member)
    <a08>   DW_AT_name        : (indirect string, offset: 0xc9510): CICR
    <a0c>   DW_AT_decl_file   : 5
    <a0d>   DW_AT_decl_line   : 600
    <a0f>   DW_AT_decl_column : 17
    <a10>   DW_AT_type        : <0x905>
    <a14>   DW_AT_data_member_location: 32
 <2><a15>: Abbrev Number: 8 (DW_TAG_member)
    <a16>   DW_AT_name        : (indirect string, offset: 0xc96da): RESERVED0
    <a1a>   DW_AT_decl_file   : 5
    <a1b>   DW_AT_decl_line   : 601
    <a1d>   DW_AT_decl_column : 17
    <a1e>   DW_AT_type        : <0x8f9>
    <a22>   DW_AT_data_member_location: 36
 <2><a23>: Abbrev Number: 8 (DW_TAG_member)
    <a24>   DW_AT_name        : (indirect string, offset: 0xc9689): AHB1RSTR
    <a28>   DW_AT_decl_file   : 5
    <a29>   DW_AT_decl_line   : 602
    <a2b>   DW_AT_decl_column : 17
    <a2c>   DW_AT_type        : <0x905>
    <a30>   DW_AT_data_member_location: 40
 <2><a31>: Abbrev Number: 8 (DW_TAG_member)
    <a32>   DW_AT_name        : (indirect string, offset: 0xc956e): AHB2RSTR
    <a36>   DW_AT_decl_file   : 5
    <a37>   DW_AT_decl_line   : 603
    <a39>   DW_AT_decl_column : 17
    <a3a>   DW_AT_type        : <0x905>
    <a3e>   DW_AT_data_member_location: 44
 <2><a3f>: Abbrev Number: 8 (DW_TAG_member)
    <a40>   DW_AT_name        : (indirect string, offset: 0xc95ea): AHB3RSTR
    <a44>   DW_AT_decl_file   : 5
    <a45>   DW_AT_decl_line   : 604
    <a47>   DW_AT_decl_column : 17
    <a48>   DW_AT_type        : <0x905>
    <a4c>   DW_AT_data_member_location: 48
 <2><a4d>: Abbrev Number: 8 (DW_TAG_member)
    <a4e>   DW_AT_name        : (indirect string, offset: 0xc96e4): RESERVED1
    <a52>   DW_AT_decl_file   : 5
    <a53>   DW_AT_decl_line   : 605
    <a55>   DW_AT_decl_column : 17
    <a56>   DW_AT_type        : <0x8f9>
    <a5a>   DW_AT_data_member_location: 52
 <2><a5b>: Abbrev Number: 8 (DW_TAG_member)
    <a5c>   DW_AT_name        : (indirect string, offset: 0xc958a): APB1RSTR1
    <a60>   DW_AT_decl_file   : 5
    <a61>   DW_AT_decl_line   : 606
    <a63>   DW_AT_decl_column : 17
    <a64>   DW_AT_type        : <0x905>
    <a68>   DW_AT_data_member_location: 56
 <2><a69>: Abbrev Number: 8 (DW_TAG_member)
    <a6a>   DW_AT_name        : (indirect string, offset: 0xc9594): APB1RSTR2
    <a6e>   DW_AT_decl_file   : 5
    <a6f>   DW_AT_decl_line   : 607
    <a71>   DW_AT_decl_column : 17
    <a72>   DW_AT_type        : <0x905>
    <a76>   DW_AT_data_member_location: 60
 <2><a77>: Abbrev Number: 8 (DW_TAG_member)
    <a78>   DW_AT_name        : (indirect string, offset: 0xc95e1): APB2RSTR
    <a7c>   DW_AT_decl_file   : 5
    <a7d>   DW_AT_decl_line   : 608
    <a7f>   DW_AT_decl_column : 17
    <a80>   DW_AT_type        : <0x905>
    <a84>   DW_AT_data_member_location: 64
 <2><a85>: Abbrev Number: 8 (DW_TAG_member)
    <a86>   DW_AT_name        : (indirect string, offset: 0xc96ee): RESERVED2
    <a8a>   DW_AT_decl_file   : 5
    <a8b>   DW_AT_decl_line   : 609
    <a8d>   DW_AT_decl_column : 17
    <a8e>   DW_AT_type        : <0x8f9>
    <a92>   DW_AT_data_member_location: 68
 <2><a93>: Abbrev Number: 8 (DW_TAG_member)
    <a94>   DW_AT_name        : (indirect string, offset: 0xc9547): AHB1ENR
    <a98>   DW_AT_decl_file   : 5
    <a99>   DW_AT_decl_line   : 610
    <a9b>   DW_AT_decl_column : 17
    <a9c>   DW_AT_type        : <0x905>
    <aa0>   DW_AT_data_member_location: 72
 <2><aa1>: Abbrev Number: 8 (DW_TAG_member)
    <aa2>   DW_AT_name        : (indirect string, offset: 0xc95b7): AHB2ENR
    <aa6>   DW_AT_decl_file   : 5
    <aa7>   DW_AT_decl_line   : 611
    <aa9>   DW_AT_decl_column : 17
    <aaa>   DW_AT_type        : <0x905>
    <aae>   DW_AT_data_member_location: 76
 <2><aaf>: Abbrev Number: 8 (DW_TAG_member)
    <ab0>   DW_AT_name        : (indirect string, offset: 0xc95f3): AHB3ENR
    <ab4>   DW_AT_decl_file   : 5
    <ab5>   DW_AT_decl_line   : 612
    <ab7>   DW_AT_decl_column : 17
    <ab8>   DW_AT_type        : <0x905>
    <abc>   DW_AT_data_member_location: 80
 <2><abd>: Abbrev Number: 8 (DW_TAG_member)
    <abe>   DW_AT_name        : (indirect string, offset: 0xc96f8): RESERVED3
    <ac2>   DW_AT_decl_file   : 5
    <ac3>   DW_AT_decl_line   : 613
    <ac5>   DW_AT_decl_column : 17
    <ac6>   DW_AT_type        : <0x8f9>
    <aca>   DW_AT_data_member_location: 84
 <2><acb>: Abbrev Number: 8 (DW_TAG_member)
    <acc>   DW_AT_name        : (indirect string, offset: 0xc951f): APB1ENR1
    <ad0>   DW_AT_decl_file   : 5
    <ad1>   DW_AT_decl_line   : 614
    <ad3>   DW_AT_decl_column : 17
    <ad4>   DW_AT_type        : <0x905>
    <ad8>   DW_AT_data_member_location: 88
 <2><ad9>: Abbrev Number: 8 (DW_TAG_member)
    <ada>   DW_AT_name        : (indirect string, offset: 0xc9528): APB1ENR2
    <ade>   DW_AT_decl_file   : 5
    <adf>   DW_AT_decl_line   : 615
    <ae1>   DW_AT_decl_column : 17
    <ae2>   DW_AT_type        : <0x905>
    <ae6>   DW_AT_data_member_location: 92
 <2><ae7>: Abbrev Number: 8 (DW_TAG_member)
    <ae8>   DW_AT_name        : (indirect string, offset: 0xc961b): APB2ENR
    <aec>   DW_AT_decl_file   : 5
    <aed>   DW_AT_decl_line   : 616
    <aef>   DW_AT_decl_column : 17
    <af0>   DW_AT_type        : <0x905>
    <af4>   DW_AT_data_member_location: 96
 <2><af5>: Abbrev Number: 8 (DW_TAG_member)
    <af6>   DW_AT_name        : (indirect string, offset: 0xc962e): RESERVED4
    <afa>   DW_AT_decl_file   : 5
    <afb>   DW_AT_decl_line   : 617
    <afd>   DW_AT_decl_column : 17
    <afe>   DW_AT_type        : <0x8f9>
    <b02>   DW_AT_data_member_location: 100
 <2><b03>: Abbrev Number: 8 (DW_TAG_member)
    <b04>   DW_AT_name        : (indirect string, offset: 0xc9605): AHB1SMENR
    <b08>   DW_AT_decl_file   : 5
    <b09>   DW_AT_decl_line   : 618
    <b0b>   DW_AT_decl_column : 17
    <b0c>   DW_AT_type        : <0x905>
    <b10>   DW_AT_data_member_location: 104
 <2><b11>: Abbrev Number: 8 (DW_TAG_member)
    <b12>   DW_AT_name        : (indirect string, offset: 0xc96c4): AHB2SMENR
    <b16>   DW_AT_decl_file   : 5
    <b17>   DW_AT_decl_line   : 619
    <b19>   DW_AT_decl_column : 17
    <b1a>   DW_AT_type        : <0x905>
    <b1e>   DW_AT_data_member_location: 108
 <2><b1f>: Abbrev Number: 8 (DW_TAG_member)
    <b20>   DW_AT_name        : (indirect string, offset: 0xc95d7): AHB3SMENR
    <b24>   DW_AT_decl_file   : 5
    <b25>   DW_AT_decl_line   : 620
    <b27>   DW_AT_decl_column : 17
    <b28>   DW_AT_type        : <0x905>
    <b2c>   DW_AT_data_member_location: 112
 <2><b2d>: Abbrev Number: 8 (DW_TAG_member)
    <b2e>   DW_AT_name        : (indirect string, offset: 0xc9702): RESERVED5
    <b32>   DW_AT_decl_file   : 5
    <b33>   DW_AT_decl_line   : 621
    <b35>   DW_AT_decl_column : 17
    <b36>   DW_AT_type        : <0x8f9>
    <b3a>   DW_AT_data_member_location: 116
 <2><b3b>: Abbrev Number: 8 (DW_TAG_member)
    <b3c>   DW_AT_name        : (indirect string, offset: 0xc9531): APB1SMENR1
    <b40>   DW_AT_decl_file   : 5
    <b41>   DW_AT_decl_line   : 622
    <b43>   DW_AT_decl_column : 17
    <b44>   DW_AT_type        : <0x905>
    <b48>   DW_AT_data_member_location: 120
 <2><b49>: Abbrev Number: 8 (DW_TAG_member)
    <b4a>   DW_AT_name        : (indirect string, offset: 0xc953c): APB1SMENR2
    <b4e>   DW_AT_decl_file   : 5
    <b4f>   DW_AT_decl_line   : 623
    <b51>   DW_AT_decl_column : 17
    <b52>   DW_AT_type        : <0x905>
    <b56>   DW_AT_data_member_location: 124
 <2><b57>: Abbrev Number: 8 (DW_TAG_member)
    <b58>   DW_AT_name        : (indirect string, offset: 0xc96a2): APB2SMENR
    <b5c>   DW_AT_decl_file   : 5
    <b5d>   DW_AT_decl_line   : 624
    <b5f>   DW_AT_decl_column : 17
    <b60>   DW_AT_type        : <0x905>
    <b64>   DW_AT_data_member_location: 128
 <2><b65>: Abbrev Number: 8 (DW_TAG_member)
    <b66>   DW_AT_name        : (indirect string, offset: 0xc9638): RESERVED6
    <b6a>   DW_AT_decl_file   : 5
    <b6b>   DW_AT_decl_line   : 625
    <b6d>   DW_AT_decl_column : 17
    <b6e>   DW_AT_type        : <0x8f9>
    <b72>   DW_AT_data_member_location: 132
 <2><b73>: Abbrev Number: 8 (DW_TAG_member)
    <b74>   DW_AT_name        : (indirect string, offset: 0xc95c5): CCIPR
    <b78>   DW_AT_decl_file   : 5
    <b79>   DW_AT_decl_line   : 626
    <b7b>   DW_AT_decl_column : 17
    <b7c>   DW_AT_type        : <0x905>
    <b80>   DW_AT_data_member_location: 136
 <2><b81>: Abbrev Number: 8 (DW_TAG_member)
    <b82>   DW_AT_name        : (indirect string, offset: 0xc970c): RESERVED7
    <b86>   DW_AT_decl_file   : 5
    <b87>   DW_AT_decl_line   : 627
    <b89>   DW_AT_decl_column : 17
    <b8a>   DW_AT_type        : <0x8f9>
    <b8e>   DW_AT_data_member_location: 140
 <2><b8f>: Abbrev Number: 8 (DW_TAG_member)
    <b90>   DW_AT_name        : (indirect string, offset: 0xc95b2): BDCR
    <b94>   DW_AT_decl_file   : 5
    <b95>   DW_AT_decl_line   : 628
    <b97>   DW_AT_decl_column : 17
    <b98>   DW_AT_type        : <0x905>
    <b9c>   DW_AT_data_member_location: 144
 <2><b9d>: Abbrev Number: 7 (DW_TAG_member)
    <b9e>   DW_AT_name        : CSR
    <ba2>   DW_AT_decl_file   : 5
    <ba3>   DW_AT_decl_line   : 629
    <ba5>   DW_AT_decl_column : 17
    <ba6>   DW_AT_type        : <0x905>
    <baa>   DW_AT_data_member_location: 148
 <2><bab>: Abbrev Number: 8 (DW_TAG_member)
    <bac>   DW_AT_name        : (indirect string, offset: 0xc95bf): CRRCR
    <bb0>   DW_AT_decl_file   : 5
    <bb1>   DW_AT_decl_line   : 630
    <bb3>   DW_AT_decl_column : 17
    <bb4>   DW_AT_type        : <0x905>
    <bb8>   DW_AT_data_member_location: 152
 <2><bb9>: Abbrev Number: 0
 <1><bba>: Abbrev Number: 9 (DW_TAG_typedef)
    <bbb>   DW_AT_name        : (indirect string, offset: 0xc960f): RCC_TypeDef
    <bbf>   DW_AT_decl_file   : 5
    <bc0>   DW_AT_decl_line   : 631
    <bc2>   DW_AT_decl_column : 3
    <bc3>   DW_AT_type        : <0x98e>
 <1><bc7>: Abbrev Number: 6 (DW_TAG_structure_type)
    <bc8>   DW_AT_byte_size   : 104
    <bc9>   DW_AT_decl_file   : 5
    <bca>   DW_AT_decl_line   : 770
    <bcc>   DW_AT_decl_column : 9
    <bcd>   DW_AT_sibling     : <0xd3d>
 <2><bd1>: Abbrev Number: 7 (DW_TAG_member)
    <bd2>   DW_AT_name        : CR1
    <bd6>   DW_AT_decl_file   : 5
    <bd7>   DW_AT_decl_line   : 772
    <bd9>   DW_AT_decl_column : 17
    <bda>   DW_AT_type        : <0x905>
    <bde>   DW_AT_data_member_location: 0
 <2><bdf>: Abbrev Number: 7 (DW_TAG_member)
    <be0>   DW_AT_name        : CR2
    <be4>   DW_AT_decl_file   : 5
    <be5>   DW_AT_decl_line   : 773
    <be7>   DW_AT_decl_column : 17
    <be8>   DW_AT_type        : <0x905>
    <bec>   DW_AT_data_member_location: 4
 <2><bed>: Abbrev Number: 8 (DW_TAG_member)
    <bee>   DW_AT_name        : (indirect string, offset: 0x5362): SMCR
    <bf2>   DW_AT_decl_file   : 5
    <bf3>   DW_AT_decl_line   : 774
    <bf5>   DW_AT_decl_column : 17
    <bf6>   DW_AT_type        : <0x905>
    <bfa>   DW_AT_data_member_location: 8
 <2><bfb>: Abbrev Number: 8 (DW_TAG_member)
    <bfc>   DW_AT_name        : (indirect string, offset: 0x40527): DIER
    <c00>   DW_AT_decl_file   : 5
    <c01>   DW_AT_decl_line   : 775
    <c03>   DW_AT_decl_column : 17
    <c04>   DW_AT_type        : <0x905>
    <c08>   DW_AT_data_member_location: 12
 <2><c09>: Abbrev Number: 7 (DW_TAG_member)
    <c0a>   DW_AT_name        : SR
    <c0d>   DW_AT_decl_file   : 5
    <c0e>   DW_AT_decl_line   : 776
    <c10>   DW_AT_decl_column : 17
    <c11>   DW_AT_type        : <0x905>
    <c15>   DW_AT_data_member_location: 16
 <2><c16>: Abbrev Number: 7 (DW_TAG_member)
    <c17>   DW_AT_name        : EGR
    <c1b>   DW_AT_decl_file   : 5
    <c1c>   DW_AT_decl_line   : 777
    <c1e>   DW_AT_decl_column : 17
    <c1f>   DW_AT_type        : <0x905>
    <c23>   DW_AT_data_member_location: 20
 <2><c24>: Abbrev Number: 8 (DW_TAG_member)
    <c25>   DW_AT_name        : (indirect string, offset: 0x26c33): CCMR1
    <c29>   DW_AT_decl_file   : 5
    <c2a>   DW_AT_decl_line   : 778
    <c2c>   DW_AT_decl_column : 17
    <c2d>   DW_AT_type        : <0x905>
    <c31>   DW_AT_data_member_location: 24
 <2><c32>: Abbrev Number: 8 (DW_TAG_member)
    <c33>   DW_AT_name        : (indirect string, offset: 0x504a4): CCMR2
    <c37>   DW_AT_decl_file   : 5
    <c38>   DW_AT_decl_line   : 779
    <c3a>   DW_AT_decl_column : 17
    <c3b>   DW_AT_type        : <0x905>
    <c3f>   DW_AT_data_member_location: 28
 <2><c40>: Abbrev Number: 8 (DW_TAG_member)
    <c41>   DW_AT_name        : (indirect string, offset: 0x305a6): CCER
    <c45>   DW_AT_decl_file   : 5
    <c46>   DW_AT_decl_line   : 780
    <c48>   DW_AT_decl_column : 17
    <c49>   DW_AT_type        : <0x905>
    <c4d>   DW_AT_data_member_location: 32
 <2><c4e>: Abbrev Number: 7 (DW_TAG_member)
    <c4f>   DW_AT_name        : CNT
    <c53>   DW_AT_decl_file   : 5
    <c54>   DW_AT_decl_line   : 781
    <c56>   DW_AT_decl_column : 17
    <c57>   DW_AT_type        : <0x905>
    <c5b>   DW_AT_data_member_location: 36
 <2><c5c>: Abbrev Number: 7 (DW_TAG_member)
    <c5d>   DW_AT_name        : PSC
    <c61>   DW_AT_decl_file   : 5
    <c62>   DW_AT_decl_line   : 782
    <c64>   DW_AT_decl_column : 17
    <c65>   DW_AT_type        : <0x905>
    <c69>   DW_AT_data_member_location: 40
 <2><c6a>: Abbrev Number: 7 (DW_TAG_member)
    <c6b>   DW_AT_name        : ARR
    <c6f>   DW_AT_decl_file   : 5
    <c70>   DW_AT_decl_line   : 783
    <c72>   DW_AT_decl_column : 17
    <c73>   DW_AT_type        : <0x905>
    <c77>   DW_AT_data_member_location: 44
 <2><c78>: Abbrev Number: 7 (DW_TAG_member)
    <c79>   DW_AT_name        : RCR
    <c7d>   DW_AT_decl_file   : 5
    <c7e>   DW_AT_decl_line   : 784
    <c80>   DW_AT_decl_column : 17
    <c81>   DW_AT_type        : <0x905>
    <c85>   DW_AT_data_member_location: 48
 <2><c86>: Abbrev Number: 8 (DW_TAG_member)
    <c87>   DW_AT_name        : (indirect string, offset: 0x1817d): CCR1
    <c8b>   DW_AT_decl_file   : 5
    <c8c>   DW_AT_decl_line   : 785
    <c8e>   DW_AT_decl_column : 17
    <c8f>   DW_AT_type        : <0x905>
    <c93>   DW_AT_data_member_location: 52
 <2><c94>: Abbrev Number: 8 (DW_TAG_member)
    <c95>   DW_AT_name        : (indirect string, offset: 0x5430f): CCR2
    <c99>   DW_AT_decl_file   : 5
    <c9a>   DW_AT_decl_line   : 786
    <c9c>   DW_AT_decl_column : 17
    <c9d>   DW_AT_type        : <0x905>
    <ca1>   DW_AT_data_member_location: 56
 <2><ca2>: Abbrev Number: 8 (DW_TAG_member)
    <ca3>   DW_AT_name        : (indirect string, offset: 0x38dce): CCR3
    <ca7>   DW_AT_decl_file   : 5
    <ca8>   DW_AT_decl_line   : 787
    <caa>   DW_AT_decl_column : 17
    <cab>   DW_AT_type        : <0x905>
    <caf>   DW_AT_data_member_location: 60
 <2><cb0>: Abbrev Number: 8 (DW_TAG_member)
    <cb1>   DW_AT_name        : (indirect string, offset: 0xcd43): CCR4
    <cb5>   DW_AT_decl_file   : 5
    <cb6>   DW_AT_decl_line   : 788
    <cb8>   DW_AT_decl_column : 17
    <cb9>   DW_AT_type        : <0x905>
    <cbd>   DW_AT_data_member_location: 64
 <2><cbe>: Abbrev Number: 8 (DW_TAG_member)
    <cbf>   DW_AT_name        : (indirect string, offset: 0x5cc0c): BDTR
    <cc3>   DW_AT_decl_file   : 5
    <cc4>   DW_AT_decl_line   : 789
    <cc6>   DW_AT_decl_column : 17
    <cc7>   DW_AT_type        : <0x905>
    <ccb>   DW_AT_data_member_location: 68
 <2><ccc>: Abbrev Number: 7 (DW_TAG_member)
    <ccd>   DW_AT_name        : DCR
    <cd1>   DW_AT_decl_file   : 5
    <cd2>   DW_AT_decl_line   : 790
    <cd4>   DW_AT_decl_column : 17
    <cd5>   DW_AT_type        : <0x905>
    <cd9>   DW_AT_data_member_location: 72
 <2><cda>: Abbrev Number: 8 (DW_TAG_member)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x94e45): DMAR
    <cdf>   DW_AT_decl_file   : 5
    <ce0>   DW_AT_decl_line   : 791
    <ce2>   DW_AT_decl_column : 17
    <ce3>   DW_AT_type        : <0x905>
    <ce7>   DW_AT_data_member_location: 76
 <2><ce8>: Abbrev Number: 7 (DW_TAG_member)
    <ce9>   DW_AT_name        : OR1
    <ced>   DW_AT_decl_file   : 5
    <cee>   DW_AT_decl_line   : 792
    <cf0>   DW_AT_decl_column : 17
    <cf1>   DW_AT_type        : <0x905>
    <cf5>   DW_AT_data_member_location: 80
 <2><cf6>: Abbrev Number: 8 (DW_TAG_member)
    <cf7>   DW_AT_name        : (indirect string, offset: 0xb29d5): CCMR3
    <cfb>   DW_AT_decl_file   : 5
    <cfc>   DW_AT_decl_line   : 793
    <cfe>   DW_AT_decl_column : 17
    <cff>   DW_AT_type        : <0x905>
    <d03>   DW_AT_data_member_location: 84
 <2><d04>: Abbrev Number: 8 (DW_TAG_member)
    <d05>   DW_AT_name        : (indirect string, offset: 0x23a2f): CCR5
    <d09>   DW_AT_decl_file   : 5
    <d0a>   DW_AT_decl_line   : 794
    <d0c>   DW_AT_decl_column : 17
    <d0d>   DW_AT_type        : <0x905>
    <d11>   DW_AT_data_member_location: 88
 <2><d12>: Abbrev Number: 8 (DW_TAG_member)
    <d13>   DW_AT_name        : (indirect string, offset: 0x8e054): CCR6
    <d17>   DW_AT_decl_file   : 5
    <d18>   DW_AT_decl_line   : 795
    <d1a>   DW_AT_decl_column : 17
    <d1b>   DW_AT_type        : <0x905>
    <d1f>   DW_AT_data_member_location: 92
 <2><d20>: Abbrev Number: 7 (DW_TAG_member)
    <d21>   DW_AT_name        : OR2
    <d25>   DW_AT_decl_file   : 5
    <d26>   DW_AT_decl_line   : 796
    <d28>   DW_AT_decl_column : 17
    <d29>   DW_AT_type        : <0x905>
    <d2d>   DW_AT_data_member_location: 96
 <2><d2e>: Abbrev Number: 7 (DW_TAG_member)
    <d2f>   DW_AT_name        : OR3
    <d33>   DW_AT_decl_file   : 5
    <d34>   DW_AT_decl_line   : 797
    <d36>   DW_AT_decl_column : 17
    <d37>   DW_AT_type        : <0x905>
    <d3b>   DW_AT_data_member_location: 100
 <2><d3c>: Abbrev Number: 0
 <1><d3d>: Abbrev Number: 9 (DW_TAG_typedef)
    <d3e>   DW_AT_name        : (indirect string, offset: 0xc9dee): TIM_TypeDef
    <d42>   DW_AT_decl_file   : 5
    <d43>   DW_AT_decl_line   : 798
    <d45>   DW_AT_decl_column : 3
    <d46>   DW_AT_type        : <0xbc7>
 <1><d4a>: Abbrev Number: 2 (DW_TAG_base_type)
    <d4b>   DW_AT_byte_size   : 8
    <d4c>   DW_AT_encoding    : 4	(float)
    <d4d>   DW_AT_name        : (indirect string, offset: 0x12b58): long double
 <1><d51>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <d52>   DW_AT_encoding    : 7	(unsigned)
    <d53>   DW_AT_byte_size   : 1
    <d54>   DW_AT_type        : <0x8ae>
    <d58>   DW_AT_decl_file   : 6
    <d59>   DW_AT_decl_line   : 39
    <d5a>   DW_AT_decl_column : 1
    <d5b>   DW_AT_sibling     : <0xd78>
 <2><d5f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d60>   DW_AT_name        : (indirect string, offset: 0xc98da): HAL_OK
    <d64>   DW_AT_const_value : 0
 <2><d65>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d66>   DW_AT_name        : (indirect string, offset: 0xc9b35): HAL_ERROR
    <d6a>   DW_AT_const_value : 1
 <2><d6b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d6c>   DW_AT_name        : (indirect string, offset: 0xc9809): HAL_BUSY
    <d70>   DW_AT_const_value : 2
 <2><d71>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d72>   DW_AT_name        : (indirect string, offset: 0xc9897): HAL_TIMEOUT
    <d76>   DW_AT_const_value : 3
 <2><d77>: Abbrev Number: 0
 <1><d78>: Abbrev Number: 3 (DW_TAG_typedef)
    <d79>   DW_AT_name        : (indirect string, offset: 0xc9731): HAL_StatusTypeDef
    <d7d>   DW_AT_decl_file   : 6
    <d7e>   DW_AT_decl_line   : 44
    <d7f>   DW_AT_decl_column : 3
    <d80>   DW_AT_type        : <0xd51>
 <1><d84>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <d85>   DW_AT_encoding    : 7	(unsigned)
    <d86>   DW_AT_byte_size   : 1
    <d87>   DW_AT_type        : <0x8ae>
    <d8b>   DW_AT_decl_file   : 6
    <d8c>   DW_AT_decl_line   : 50
    <d8d>   DW_AT_decl_column : 1
    <d8e>   DW_AT_sibling     : <0xd9f>
 <2><d92>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d93>   DW_AT_name        : (indirect string, offset: 0xc9c28): HAL_UNLOCKED
    <d97>   DW_AT_const_value : 0
 <2><d98>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d99>   DW_AT_name        : (indirect string, offset: 0xc9e37): HAL_LOCKED
    <d9d>   DW_AT_const_value : 1
 <2><d9e>: Abbrev Number: 0
 <1><d9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <da0>   DW_AT_name        : (indirect string, offset: 0xc9aec): HAL_LockTypeDef
    <da4>   DW_AT_decl_file   : 6
    <da5>   DW_AT_decl_line   : 53
    <da6>   DW_AT_decl_column : 3
    <da7>   DW_AT_type        : <0xd84>
 <1><dab>: Abbrev Number: 12 (DW_TAG_structure_type)
    <dac>   DW_AT_byte_size   : 28
    <dad>   DW_AT_decl_file   : 7
    <dae>   DW_AT_decl_line   : 45
    <daf>   DW_AT_decl_column : 9
    <db0>   DW_AT_sibling     : <0xe10>
 <2><db4>: Abbrev Number: 13 (DW_TAG_member)
    <db5>   DW_AT_name        : (indirect string, offset: 0xc9bb2): PLLState
    <db9>   DW_AT_decl_file   : 7
    <dba>   DW_AT_decl_line   : 47
    <dbb>   DW_AT_decl_column : 12
    <dbc>   DW_AT_type        : <0x8f9>
    <dc0>   DW_AT_data_member_location: 0
 <2><dc1>: Abbrev Number: 13 (DW_TAG_member)
    <dc2>   DW_AT_name        : (indirect string, offset: 0xc9bfc): PLLSource
    <dc6>   DW_AT_decl_file   : 7
    <dc7>   DW_AT_decl_line   : 50
    <dc8>   DW_AT_decl_column : 12
    <dc9>   DW_AT_type        : <0x8f9>
    <dcd>   DW_AT_data_member_location: 4
 <2><dce>: Abbrev Number: 13 (DW_TAG_member)
    <dcf>   DW_AT_name        : (indirect string, offset: 0xc9b83): PLLM
    <dd3>   DW_AT_decl_file   : 7
    <dd4>   DW_AT_decl_line   : 53
    <dd5>   DW_AT_decl_column : 12
    <dd6>   DW_AT_type        : <0x8f9>
    <dda>   DW_AT_data_member_location: 8
 <2><ddb>: Abbrev Number: 13 (DW_TAG_member)
    <ddc>   DW_AT_name        : (indirect string, offset: 0xc9cd9): PLLN
    <de0>   DW_AT_decl_file   : 7
    <de1>   DW_AT_decl_line   : 57
    <de2>   DW_AT_decl_column : 12
    <de3>   DW_AT_type        : <0x8f9>
    <de7>   DW_AT_data_member_location: 12
 <2><de8>: Abbrev Number: 13 (DW_TAG_member)
    <de9>   DW_AT_name        : (indirect string, offset: 0xc97eb): PLLP
    <ded>   DW_AT_decl_file   : 7
    <dee>   DW_AT_decl_line   : 61
    <def>   DW_AT_decl_column : 12
    <df0>   DW_AT_type        : <0x8f9>
    <df4>   DW_AT_data_member_location: 16
 <2><df5>: Abbrev Number: 13 (DW_TAG_member)
    <df6>   DW_AT_name        : (indirect string, offset: 0x4a969): PLLQ
    <dfa>   DW_AT_decl_file   : 7
    <dfb>   DW_AT_decl_line   : 65
    <dfc>   DW_AT_decl_column : 12
    <dfd>   DW_AT_type        : <0x8f9>
    <e01>   DW_AT_data_member_location: 20
 <2><e02>: Abbrev Number: 13 (DW_TAG_member)
    <e03>   DW_AT_name        : (indirect string, offset: 0xc9cde): PLLR
    <e07>   DW_AT_decl_file   : 7
    <e08>   DW_AT_decl_line   : 68
    <e09>   DW_AT_decl_column : 12
    <e0a>   DW_AT_type        : <0x8f9>
    <e0e>   DW_AT_data_member_location: 24
 <2><e0f>: Abbrev Number: 0
 <1><e10>: Abbrev Number: 3 (DW_TAG_typedef)
    <e11>   DW_AT_name        : (indirect string, offset: 0xc9b0e): RCC_PLLInitTypeDef
    <e15>   DW_AT_decl_file   : 7
    <e16>   DW_AT_decl_line   : 73
    <e17>   DW_AT_decl_column : 2
    <e18>   DW_AT_type        : <0xdab>
 <1><e1c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <e1d>   DW_AT_byte_size   : 68
    <e1e>   DW_AT_decl_file   : 7
    <e1f>   DW_AT_decl_line   : 78
    <e20>   DW_AT_decl_column : 9
    <e21>   DW_AT_sibling     : <0xeb5>
 <2><e25>: Abbrev Number: 13 (DW_TAG_member)
    <e26>   DW_AT_name        : (indirect string, offset: 0xc9c9f): OscillatorType
    <e2a>   DW_AT_decl_file   : 7
    <e2b>   DW_AT_decl_line   : 80
    <e2c>   DW_AT_decl_column : 12
    <e2d>   DW_AT_type        : <0x8f9>
    <e31>   DW_AT_data_member_location: 0
 <2><e32>: Abbrev Number: 13 (DW_TAG_member)
    <e33>   DW_AT_name        : (indirect string, offset: 0xc9bbb): HSEState
    <e37>   DW_AT_decl_file   : 7
    <e38>   DW_AT_decl_line   : 83
    <e39>   DW_AT_decl_column : 12
    <e3a>   DW_AT_type        : <0x8f9>
    <e3e>   DW_AT_data_member_location: 4
 <2><e3f>: Abbrev Number: 13 (DW_TAG_member)
    <e40>   DW_AT_name        : (indirect string, offset: 0xc9b3f): LSEState
    <e44>   DW_AT_decl_file   : 7
    <e45>   DW_AT_decl_line   : 86
    <e46>   DW_AT_decl_column : 12
    <e47>   DW_AT_type        : <0x8f9>
    <e4b>   DW_AT_data_member_location: 8
 <2><e4c>: Abbrev Number: 13 (DW_TAG_member)
    <e4d>   DW_AT_name        : (indirect string, offset: 0xc9991): HSIState
    <e51>   DW_AT_decl_file   : 7
    <e52>   DW_AT_decl_line   : 89
    <e53>   DW_AT_decl_column : 12
    <e54>   DW_AT_type        : <0x8f9>
    <e58>   DW_AT_data_member_location: 12
 <2><e59>: Abbrev Number: 13 (DW_TAG_member)
    <e5a>   DW_AT_name        : (indirect string, offset: 0xc9d73): HSICalibrationValue
    <e5e>   DW_AT_decl_file   : 7
    <e5f>   DW_AT_decl_line   : 92
    <e60>   DW_AT_decl_column : 12
    <e61>   DW_AT_type        : <0x8f9>
    <e65>   DW_AT_data_member_location: 16
 <2><e66>: Abbrev Number: 13 (DW_TAG_member)
    <e67>   DW_AT_name        : (indirect string, offset: 0xc98f6): LSIState
    <e6b>   DW_AT_decl_file   : 7
    <e6c>   DW_AT_decl_line   : 98
    <e6d>   DW_AT_decl_column : 12
    <e6e>   DW_AT_type        : <0x8f9>
    <e72>   DW_AT_data_member_location: 20
 <2><e73>: Abbrev Number: 13 (DW_TAG_member)
    <e74>   DW_AT_name        : (indirect string, offset: 0xc98e1): MSIState
    <e78>   DW_AT_decl_file   : 7
    <e79>   DW_AT_decl_line   : 106
    <e7a>   DW_AT_decl_column : 12
    <e7b>   DW_AT_type        : <0x8f9>
    <e7f>   DW_AT_data_member_location: 24
 <2><e80>: Abbrev Number: 13 (DW_TAG_member)
    <e81>   DW_AT_name        : (indirect string, offset: 0xc98a9): MSICalibrationValue
    <e85>   DW_AT_decl_file   : 7
    <e86>   DW_AT_decl_line   : 109
    <e87>   DW_AT_decl_column : 12
    <e88>   DW_AT_type        : <0x8f9>
    <e8c>   DW_AT_data_member_location: 28
 <2><e8d>: Abbrev Number: 13 (DW_TAG_member)
    <e8e>   DW_AT_name        : (indirect string, offset: 0xc99d1): MSIClockRange
    <e92>   DW_AT_decl_file   : 7
    <e93>   DW_AT_decl_line   : 112
    <e94>   DW_AT_decl_column : 12
    <e95>   DW_AT_type        : <0x8f9>
    <e99>   DW_AT_data_member_location: 32
 <2><e9a>: Abbrev Number: 13 (DW_TAG_member)
    <e9b>   DW_AT_name        : (indirect string, offset: 0xc9c1d): HSI48State
    <e9f>   DW_AT_decl_file   : 7
    <ea0>   DW_AT_decl_line   : 115
    <ea1>   DW_AT_decl_column : 12
    <ea2>   DW_AT_type        : <0x8f9>
    <ea6>   DW_AT_data_member_location: 36
 <2><ea7>: Abbrev Number: 14 (DW_TAG_member)
    <ea8>   DW_AT_name        : PLL
    <eac>   DW_AT_decl_file   : 7
    <ead>   DW_AT_decl_line   : 118
    <eae>   DW_AT_decl_column : 22
    <eaf>   DW_AT_type        : <0xe10>
    <eb3>   DW_AT_data_member_location: 40
 <2><eb4>: Abbrev Number: 0
 <1><eb5>: Abbrev Number: 3 (DW_TAG_typedef)
    <eb6>   DW_AT_name        : (indirect string, offset: 0xc99f5): RCC_OscInitTypeDef
    <eba>   DW_AT_decl_file   : 7
    <ebb>   DW_AT_decl_line   : 120
    <ebc>   DW_AT_decl_column : 2
    <ebd>   DW_AT_type        : <0xe1c>
 <1><ec1>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ec2>   DW_AT_byte_size   : 20
    <ec3>   DW_AT_decl_file   : 7
    <ec4>   DW_AT_decl_line   : 125
    <ec5>   DW_AT_decl_column : 9
    <ec6>   DW_AT_sibling     : <0xf0c>
 <2><eca>: Abbrev Number: 13 (DW_TAG_member)
    <ecb>   DW_AT_name        : (indirect string, offset: 0xc98bd): ClockType
    <ecf>   DW_AT_decl_file   : 7
    <ed0>   DW_AT_decl_line   : 127
    <ed1>   DW_AT_decl_column : 12
    <ed2>   DW_AT_type        : <0x8f9>
    <ed6>   DW_AT_data_member_location: 0
 <2><ed7>: Abbrev Number: 13 (DW_TAG_member)
    <ed8>   DW_AT_name        : (indirect string, offset: 0xc9b01): SYSCLKSource
    <edc>   DW_AT_decl_file   : 7
    <edd>   DW_AT_decl_line   : 130
    <ede>   DW_AT_decl_column : 12
    <edf>   DW_AT_type        : <0x8f9>
    <ee3>   DW_AT_data_member_location: 4
 <2><ee4>: Abbrev Number: 13 (DW_TAG_member)
    <ee5>   DW_AT_name        : (indirect string, offset: 0xc9ccb): AHBCLKDivider
    <ee9>   DW_AT_decl_file   : 7
    <eea>   DW_AT_decl_line   : 133
    <eeb>   DW_AT_decl_column : 12
    <eec>   DW_AT_type        : <0x8f9>
    <ef0>   DW_AT_data_member_location: 8
 <2><ef1>: Abbrev Number: 13 (DW_TAG_member)
    <ef2>   DW_AT_name        : (indirect string, offset: 0xc9771): APB1CLKDivider
    <ef6>   DW_AT_decl_file   : 7
    <ef7>   DW_AT_decl_line   : 136
    <ef8>   DW_AT_decl_column : 12
    <ef9>   DW_AT_type        : <0x8f9>
    <efd>   DW_AT_data_member_location: 12
 <2><efe>: Abbrev Number: 13 (DW_TAG_member)
    <eff>   DW_AT_name        : (indirect string, offset: 0xc999a): APB2CLKDivider
    <f03>   DW_AT_decl_file   : 7
    <f04>   DW_AT_decl_line   : 139
    <f05>   DW_AT_decl_column : 12
    <f06>   DW_AT_type        : <0x8f9>
    <f0a>   DW_AT_data_member_location: 16
 <2><f0b>: Abbrev Number: 0
 <1><f0c>: Abbrev Number: 3 (DW_TAG_typedef)
    <f0d>   DW_AT_name        : (indirect string, offset: 0xc98c7): RCC_ClkInitTypeDef
    <f11>   DW_AT_decl_file   : 7
    <f12>   DW_AT_decl_line   : 142
    <f13>   DW_AT_decl_column : 2
    <f14>   DW_AT_type        : <0xec1>
 <1><f18>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f19>   DW_AT_byte_size   : 32
    <f1a>   DW_AT_decl_file   : 8
    <f1b>   DW_AT_decl_line   : 46
    <f1c>   DW_AT_decl_column : 9
    <f1d>   DW_AT_sibling     : <0xf8a>
 <2><f21>: Abbrev Number: 13 (DW_TAG_member)
    <f22>   DW_AT_name        : (indirect string, offset: 0xc9d9a): Request
    <f26>   DW_AT_decl_file   : 8
    <f27>   DW_AT_decl_line   : 48
    <f28>   DW_AT_decl_column : 12
    <f29>   DW_AT_type        : <0x8f9>
    <f2d>   DW_AT_data_member_location: 0
 <2><f2e>: Abbrev Number: 13 (DW_TAG_member)
    <f2f>   DW_AT_name        : (indirect string, offset: 0xcf187): Direction
    <f33>   DW_AT_decl_file   : 8
    <f34>   DW_AT_decl_line   : 51
    <f35>   DW_AT_decl_column : 12
    <f36>   DW_AT_type        : <0x8f9>
    <f3a>   DW_AT_data_member_location: 4
 <2><f3b>: Abbrev Number: 13 (DW_TAG_member)
    <f3c>   DW_AT_name        : (indirect string, offset: 0xc97ca): PeriphInc
    <f40>   DW_AT_decl_file   : 8
    <f41>   DW_AT_decl_line   : 55
    <f42>   DW_AT_decl_column : 12
    <f43>   DW_AT_type        : <0x8f9>
    <f47>   DW_AT_data_member_location: 8
 <2><f48>: Abbrev Number: 13 (DW_TAG_member)
    <f49>   DW_AT_name        : (indirect string, offset: 0xc9802): MemInc
    <f4d>   DW_AT_decl_file   : 8
    <f4e>   DW_AT_decl_line   : 58
    <f4f>   DW_AT_decl_column : 12
    <f50>   DW_AT_type        : <0x8f9>
    <f54>   DW_AT_data_member_location: 12
 <2><f55>: Abbrev Number: 13 (DW_TAG_member)
    <f56>   DW_AT_name        : (indirect string, offset: 0xc99a9): PeriphDataAlignment
    <f5a>   DW_AT_decl_file   : 8
    <f5b>   DW_AT_decl_line   : 61
    <f5c>   DW_AT_decl_column : 12
    <f5d>   DW_AT_type        : <0x8f9>
    <f61>   DW_AT_data_member_location: 16
 <2><f62>: Abbrev Number: 13 (DW_TAG_member)
    <f63>   DW_AT_name        : (indirect string, offset: 0xc9da2): MemDataAlignment
    <f67>   DW_AT_decl_file   : 8
    <f68>   DW_AT_decl_line   : 64
    <f69>   DW_AT_decl_column : 12
    <f6a>   DW_AT_type        : <0x8f9>
    <f6e>   DW_AT_data_member_location: 20
 <2><f6f>: Abbrev Number: 13 (DW_TAG_member)
    <f70>   DW_AT_name        : (indirect string, offset: 0xce4ee): Mode
    <f74>   DW_AT_decl_file   : 8
    <f75>   DW_AT_decl_line   : 67
    <f76>   DW_AT_decl_column : 12
    <f77>   DW_AT_type        : <0x8f9>
    <f7b>   DW_AT_data_member_location: 24
 <2><f7c>: Abbrev Number: 13 (DW_TAG_member)
    <f7d>   DW_AT_name        : (indirect string, offset: 0xcdd71): Priority
    <f81>   DW_AT_decl_file   : 8
    <f82>   DW_AT_decl_line   : 72
    <f83>   DW_AT_decl_column : 12
    <f84>   DW_AT_type        : <0x8f9>
    <f88>   DW_AT_data_member_location: 28
 <2><f89>: Abbrev Number: 0
 <1><f8a>: Abbrev Number: 3 (DW_TAG_typedef)
    <f8b>   DW_AT_name        : (indirect string, offset: 0xc9873): DMA_InitTypeDef
    <f8f>   DW_AT_decl_file   : 8
    <f90>   DW_AT_decl_line   : 74
    <f91>   DW_AT_decl_column : 3
    <f92>   DW_AT_type        : <0xf18>
 <1><f96>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <f97>   DW_AT_encoding    : 7	(unsigned)
    <f98>   DW_AT_byte_size   : 1
    <f99>   DW_AT_type        : <0x8ae>
    <f9d>   DW_AT_decl_file   : 8
    <f9e>   DW_AT_decl_line   : 80
    <f9f>   DW_AT_decl_column : 1
    <fa0>   DW_AT_sibling     : <0xfbd>
 <2><fa4>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fa5>   DW_AT_name        : (indirect string, offset: 0xc9c35): HAL_DMA_STATE_RESET
    <fa9>   DW_AT_const_value : 0
 <2><faa>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fab>   DW_AT_name        : (indirect string, offset: 0xc9883): HAL_DMA_STATE_READY
    <faf>   DW_AT_const_value : 1
 <2><fb0>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fb1>   DW_AT_name        : (indirect string, offset: 0xc9be9): HAL_DMA_STATE_BUSY
    <fb5>   DW_AT_const_value : 2
 <2><fb6>: Abbrev Number: 11 (DW_TAG_enumerator)
    <fb7>   DW_AT_name        : (indirect string, offset: 0xc9e10): HAL_DMA_STATE_TIMEOUT
    <fbb>   DW_AT_const_value : 3
 <2><fbc>: Abbrev Number: 0
 <1><fbd>: Abbrev Number: 3 (DW_TAG_typedef)
    <fbe>   DW_AT_name        : (indirect string, offset: 0xc9b9d): HAL_DMA_StateTypeDef
    <fc2>   DW_AT_decl_file   : 8
    <fc3>   DW_AT_decl_line   : 85
    <fc4>   DW_AT_decl_column : 2
    <fc5>   DW_AT_type        : <0xf96>
 <1><fc9>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <fca>   DW_AT_type        : <0xfbd>
 <1><fce>: Abbrev Number: 15 (DW_TAG_structure_type)
    <fcf>   DW_AT_name        : (indirect string, offset: 0xc9d30): __DMA_HandleTypeDef
    <fd3>   DW_AT_byte_size   : 72
    <fd4>   DW_AT_decl_file   : 8
    <fd5>   DW_AT_decl_line   : 112
    <fd6>   DW_AT_decl_column : 16
    <fd7>   DW_AT_sibling     : <0x1078>
 <2><fdb>: Abbrev Number: 13 (DW_TAG_member)
    <fdc>   DW_AT_name        : (indirect string, offset: 0xc9cae): Instance
    <fe0>   DW_AT_decl_file   : 8
    <fe1>   DW_AT_decl_line   : 114
    <fe2>   DW_AT_decl_column : 27
    <fe3>   DW_AT_type        : <0x1078>
    <fe7>   DW_AT_data_member_location: 0
 <2><fe8>: Abbrev Number: 13 (DW_TAG_member)
    <fe9>   DW_AT_name        : (indirect string, offset: 0xcf179): Init
    <fed>   DW_AT_decl_file   : 8
    <fee>   DW_AT_decl_line   : 116
    <fef>   DW_AT_decl_column : 25
    <ff0>   DW_AT_type        : <0xf8a>
    <ff4>   DW_AT_data_member_location: 4
 <2><ff5>: Abbrev Number: 13 (DW_TAG_member)
    <ff6>   DW_AT_name        : (indirect string, offset: 0x8f189): Lock
    <ffa>   DW_AT_decl_file   : 8
    <ffb>   DW_AT_decl_line   : 118
    <ffc>   DW_AT_decl_column : 25
    <ffd>   DW_AT_type        : <0xd9f>
    <1001>   DW_AT_data_member_location: 36
 <2><1002>: Abbrev Number: 13 (DW_TAG_member)
    <1003>   DW_AT_name        : (indirect string, offset: 0xd01cf): State
    <1007>   DW_AT_decl_file   : 8
    <1008>   DW_AT_decl_line   : 120
    <1009>   DW_AT_decl_column : 30
    <100a>   DW_AT_type        : <0xfc9>
    <100e>   DW_AT_data_member_location: 37
 <2><100f>: Abbrev Number: 13 (DW_TAG_member)
    <1010>   DW_AT_name        : (indirect string, offset: 0xc9dfa): Parent
    <1014>   DW_AT_decl_file   : 8
    <1015>   DW_AT_decl_line   : 122
    <1016>   DW_AT_decl_column : 26
    <1017>   DW_AT_type        : <0x107e>
    <101b>   DW_AT_data_member_location: 40
 <2><101c>: Abbrev Number: 13 (DW_TAG_member)
    <101d>   DW_AT_name        : (indirect string, offset: 0xc9e26): XferCpltCallback
    <1021>   DW_AT_decl_file   : 8
    <1022>   DW_AT_decl_line   : 124
    <1023>   DW_AT_decl_column : 28
    <1024>   DW_AT_type        : <0x1091>
    <1028>   DW_AT_data_member_location: 44
 <2><1029>: Abbrev Number: 13 (DW_TAG_member)
    <102a>   DW_AT_name        : (indirect string, offset: 0xc9c62): XferHalfCpltCallback
    <102e>   DW_AT_decl_file   : 8
    <102f>   DW_AT_decl_line   : 126
    <1030>   DW_AT_decl_column : 28
    <1031>   DW_AT_type        : <0x1091>
    <1035>   DW_AT_data_member_location: 48
 <2><1036>: Abbrev Number: 13 (DW_TAG_member)
    <1037>   DW_AT_name        : (indirect string, offset: 0xc97f0): XferErrorCallback
    <103b>   DW_AT_decl_file   : 8
    <103c>   DW_AT_decl_line   : 128
    <103d>   DW_AT_decl_column : 28
    <103e>   DW_AT_type        : <0x1091>
    <1042>   DW_AT_data_member_location: 52
 <2><1043>: Abbrev Number: 13 (DW_TAG_member)
    <1044>   DW_AT_name        : (indirect string, offset: 0xc9dbf): XferAbortCallback
    <1048>   DW_AT_decl_file   : 8
    <1049>   DW_AT_decl_line   : 130
    <104a>   DW_AT_decl_column : 28
    <104b>   DW_AT_type        : <0x1091>
    <104f>   DW_AT_data_member_location: 56
 <2><1050>: Abbrev Number: 13 (DW_TAG_member)
    <1051>   DW_AT_name        : (indirect string, offset: 0xc9e06): ErrorCode
    <1055>   DW_AT_decl_file   : 8
    <1056>   DW_AT_decl_line   : 132
    <1057>   DW_AT_decl_column : 25
    <1058>   DW_AT_type        : <0x905>
    <105c>   DW_AT_data_member_location: 60
 <2><105d>: Abbrev Number: 13 (DW_TAG_member)
    <105e>   DW_AT_name        : (indirect string, offset: 0xc9947): DmaBaseAddress
    <1062>   DW_AT_decl_file   : 8
    <1063>   DW_AT_decl_line   : 134
    <1064>   DW_AT_decl_column : 26
    <1065>   DW_AT_type        : <0x1097>
    <1069>   DW_AT_data_member_location: 64
 <2><106a>: Abbrev Number: 13 (DW_TAG_member)
    <106b>   DW_AT_name        : (indirect string, offset: 0xc97bd): ChannelIndex
    <106f>   DW_AT_decl_file   : 8
    <1070>   DW_AT_decl_line   : 136
    <1071>   DW_AT_decl_column : 25
    <1072>   DW_AT_type        : <0x8f9>
    <1076>   DW_AT_data_member_location: 68
 <2><1077>: Abbrev Number: 0
 <1><1078>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1079>   DW_AT_byte_size   : 4
    <107a>   DW_AT_type        : <0x94d>
 <1><107e>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <107f>   DW_AT_byte_size   : 4
 <1><1080>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <1081>   DW_AT_prototyped  : 1
    <1081>   DW_AT_sibling     : <0x108b>
 <2><1085>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <1086>   DW_AT_type        : <0x108b>
 <2><108a>: Abbrev Number: 0
 <1><108b>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <108c>   DW_AT_byte_size   : 4
    <108d>   DW_AT_type        : <0xfce>
 <1><1091>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1092>   DW_AT_byte_size   : 4
    <1093>   DW_AT_type        : <0x1080>
 <1><1097>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1098>   DW_AT_byte_size   : 4
    <1099>   DW_AT_type        : <0x981>
 <1><109d>: Abbrev Number: 3 (DW_TAG_typedef)
    <109e>   DW_AT_name        : (indirect string, offset: 0xc9d32): DMA_HandleTypeDef
    <10a2>   DW_AT_decl_file   : 8
    <10a3>   DW_AT_decl_line   : 153
    <10a4>   DW_AT_decl_column : 2
    <10a5>   DW_AT_type        : <0xfce>
 <1><10a9>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <10aa>   DW_AT_byte_size   : 4
    <10ab>   DW_AT_type        : <0x109d>
 <1><10af>: Abbrev Number: 12 (DW_TAG_structure_type)
    <10b0>   DW_AT_byte_size   : 24
    <10b1>   DW_AT_decl_file   : 9
    <10b2>   DW_AT_decl_line   : 46
    <10b3>   DW_AT_decl_column : 9
    <10b4>   DW_AT_sibling     : <0x1107>
 <2><10b8>: Abbrev Number: 13 (DW_TAG_member)
    <10b9>   DW_AT_name        : (indirect string, offset: 0xcd262): Prescaler
    <10bd>   DW_AT_decl_file   : 9
    <10be>   DW_AT_decl_line   : 48
    <10bf>   DW_AT_decl_column : 12
    <10c0>   DW_AT_type        : <0x8f9>
    <10c4>   DW_AT_data_member_location: 0
 <2><10c5>: Abbrev Number: 13 (DW_TAG_member)
    <10c6>   DW_AT_name        : (indirect string, offset: 0xc9db3): CounterMode
    <10ca>   DW_AT_decl_file   : 9
    <10cb>   DW_AT_decl_line   : 51
    <10cc>   DW_AT_decl_column : 12
    <10cd>   DW_AT_type        : <0x8f9>
    <10d1>   DW_AT_data_member_location: 4
 <2><10d2>: Abbrev Number: 13 (DW_TAG_member)
    <10d3>   DW_AT_name        : (indirect string, offset: 0xd58b2): Period
    <10d7>   DW_AT_decl_file   : 9
    <10d8>   DW_AT_decl_line   : 54
    <10d9>   DW_AT_decl_column : 12
    <10da>   DW_AT_type        : <0x8f9>
    <10de>   DW_AT_data_member_location: 8
 <2><10df>: Abbrev Number: 13 (DW_TAG_member)
    <10e0>   DW_AT_name        : (indirect string, offset: 0xc9956): ClockDivision
    <10e4>   DW_AT_decl_file   : 9
    <10e5>   DW_AT_decl_line   : 58
    <10e6>   DW_AT_decl_column : 12
    <10e7>   DW_AT_type        : <0x8f9>
    <10eb>   DW_AT_data_member_location: 12
 <2><10ec>: Abbrev Number: 13 (DW_TAG_member)
    <10ed>   DW_AT_name        : (indirect string, offset: 0xc9c0b): RepetitionCounter
    <10f1>   DW_AT_decl_file   : 9
    <10f2>   DW_AT_decl_line   : 61
    <10f3>   DW_AT_decl_column : 12
    <10f4>   DW_AT_type        : <0x8f9>
    <10f8>   DW_AT_data_member_location: 16
 <2><10f9>: Abbrev Number: 13 (DW_TAG_member)
    <10fa>   DW_AT_name        : (indirect string, offset: 0xc97d9): AutoReloadPreload
    <10fe>   DW_AT_decl_file   : 9
    <10ff>   DW_AT_decl_line   : 72
    <1100>   DW_AT_decl_column : 12
    <1101>   DW_AT_type        : <0x8f9>
    <1105>   DW_AT_data_member_location: 20
 <2><1106>: Abbrev Number: 0
 <1><1107>: Abbrev Number: 3 (DW_TAG_typedef)
    <1108>   DW_AT_name        : (indirect string, offset: 0xc9c8a): TIM_Base_InitTypeDef
    <110c>   DW_AT_decl_file   : 9
    <110d>   DW_AT_decl_line   : 74
    <110e>   DW_AT_decl_column : 3
    <110f>   DW_AT_type        : <0x10af>
 <1><1113>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <1114>   DW_AT_encoding    : 7	(unsigned)
    <1115>   DW_AT_byte_size   : 1
    <1116>   DW_AT_type        : <0x8ae>
    <111a>   DW_AT_decl_file   : 9
    <111b>   DW_AT_decl_line   : 301
    <111d>   DW_AT_decl_column : 1
    <111e>   DW_AT_sibling     : <0x1141>
 <2><1122>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1123>   DW_AT_name        : (indirect string, offset: 0xc99bd): HAL_TIM_STATE_RESET
    <1127>   DW_AT_const_value : 0
 <2><1128>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1129>   DW_AT_name        : (indirect string, offset: 0xc975d): HAL_TIM_STATE_READY
    <112d>   DW_AT_const_value : 1
 <2><112e>: Abbrev Number: 11 (DW_TAG_enumerator)
    <112f>   DW_AT_name        : (indirect string, offset: 0xc9860): HAL_TIM_STATE_BUSY
    <1133>   DW_AT_const_value : 2
 <2><1134>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1135>   DW_AT_name        : (indirect string, offset: 0xc9ce3): HAL_TIM_STATE_TIMEOUT
    <1139>   DW_AT_const_value : 3
 <2><113a>: Abbrev Number: 11 (DW_TAG_enumerator)
    <113b>   DW_AT_name        : (indirect string, offset: 0xc9b21): HAL_TIM_STATE_ERROR
    <113f>   DW_AT_const_value : 4
 <2><1140>: Abbrev Number: 0
 <1><1141>: Abbrev Number: 9 (DW_TAG_typedef)
    <1142>   DW_AT_name        : (indirect string, offset: 0xc9b88): HAL_TIM_StateTypeDef
    <1146>   DW_AT_decl_file   : 9
    <1147>   DW_AT_decl_line   : 307
    <1149>   DW_AT_decl_column : 3
    <114a>   DW_AT_type        : <0x1113>
 <1><114e>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <114f>   DW_AT_type        : <0x1141>
 <1><1153>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <1154>   DW_AT_encoding    : 7	(unsigned)
    <1155>   DW_AT_byte_size   : 1
    <1156>   DW_AT_type        : <0x8ae>
    <115a>   DW_AT_decl_file   : 9
    <115b>   DW_AT_decl_line   : 313
    <115d>   DW_AT_decl_column : 1
    <115e>   DW_AT_sibling     : <0x1175>
 <2><1162>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1163>   DW_AT_name        : (indirect string, offset: 0xc97a1): HAL_TIM_CHANNEL_STATE_RESET
    <1167>   DW_AT_const_value : 0
 <2><1168>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1169>   DW_AT_name        : (indirect string, offset: 0xc9ad0): HAL_TIM_CHANNEL_STATE_READY
    <116d>   DW_AT_const_value : 1
 <2><116e>: Abbrev Number: 11 (DW_TAG_enumerator)
    <116f>   DW_AT_name        : (indirect string, offset: 0xc9b48): HAL_TIM_CHANNEL_STATE_BUSY
    <1173>   DW_AT_const_value : 2
 <2><1174>: Abbrev Number: 0
 <1><1175>: Abbrev Number: 9 (DW_TAG_typedef)
    <1176>   DW_AT_name        : (indirect string, offset: 0xc9812): HAL_TIM_ChannelStateTypeDef
    <117a>   DW_AT_decl_file   : 9
    <117b>   DW_AT_decl_line   : 317
    <117d>   DW_AT_decl_column : 3
    <117e>   DW_AT_type        : <0x1153>
 <1><1182>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1183>   DW_AT_type        : <0x1175>
 <1><1187>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <1188>   DW_AT_encoding    : 7	(unsigned)
    <1189>   DW_AT_byte_size   : 1
    <118a>   DW_AT_type        : <0x8ae>
    <118e>   DW_AT_decl_file   : 9
    <118f>   DW_AT_decl_line   : 323
    <1191>   DW_AT_decl_column : 1
    <1192>   DW_AT_sibling     : <0x11a9>
 <2><1196>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1197>   DW_AT_name        : (indirect string, offset: 0xc9743): HAL_DMA_BURST_STATE_RESET
    <119b>   DW_AT_const_value : 0
 <2><119c>: Abbrev Number: 11 (DW_TAG_enumerator)
    <119d>   DW_AT_name        : (indirect string, offset: 0xc9a08): HAL_DMA_BURST_STATE_READY
    <11a1>   DW_AT_const_value : 1
 <2><11a2>: Abbrev Number: 11 (DW_TAG_enumerator)
    <11a3>   DW_AT_name        : (indirect string, offset: 0xc9c49): HAL_DMA_BURST_STATE_BUSY
    <11a7>   DW_AT_const_value : 2
 <2><11a8>: Abbrev Number: 0
 <1><11a9>: Abbrev Number: 9 (DW_TAG_typedef)
    <11aa>   DW_AT_name        : (indirect string, offset: 0xc992a): HAL_TIM_DMABurstStateTypeDef
    <11ae>   DW_AT_decl_file   : 9
    <11af>   DW_AT_decl_line   : 327
    <11b1>   DW_AT_decl_column : 3
    <11b2>   DW_AT_type        : <0x1187>
 <1><11b6>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <11b7>   DW_AT_type        : <0x11a9>
 <1><11bb>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <11bc>   DW_AT_encoding    : 7	(unsigned)
    <11bd>   DW_AT_byte_size   : 1
    <11be>   DW_AT_type        : <0x8ae>
    <11c2>   DW_AT_decl_file   : 9
    <11c3>   DW_AT_decl_line   : 333
    <11c5>   DW_AT_decl_column : 1
    <11c6>   DW_AT_sibling     : <0x11f5>
 <2><11ca>: Abbrev Number: 11 (DW_TAG_enumerator)
    <11cb>   DW_AT_name        : (indirect string, offset: 0xc9a35): HAL_TIM_ACTIVE_CHANNEL_1
    <11cf>   DW_AT_const_value : 1
 <2><11d0>: Abbrev Number: 11 (DW_TAG_enumerator)
    <11d1>   DW_AT_name        : (indirect string, offset: 0xc9a4e): HAL_TIM_ACTIVE_CHANNEL_2
    <11d5>   DW_AT_const_value : 2
 <2><11d6>: Abbrev Number: 11 (DW_TAG_enumerator)
    <11d7>   DW_AT_name        : (indirect string, offset: 0xc9a67): HAL_TIM_ACTIVE_CHANNEL_3
    <11db>   DW_AT_const_value : 4
 <2><11dc>: Abbrev Number: 11 (DW_TAG_enumerator)
    <11dd>   DW_AT_name        : (indirect string, offset: 0xc9a80): HAL_TIM_ACTIVE_CHANNEL_4
    <11e1>   DW_AT_const_value : 8
 <2><11e2>: Abbrev Number: 11 (DW_TAG_enumerator)
    <11e3>   DW_AT_name        : (indirect string, offset: 0xc9a99): HAL_TIM_ACTIVE_CHANNEL_5
    <11e7>   DW_AT_const_value : 16
 <2><11e8>: Abbrev Number: 11 (DW_TAG_enumerator)
    <11e9>   DW_AT_name        : (indirect string, offset: 0xc9ab2): HAL_TIM_ACTIVE_CHANNEL_6
    <11ed>   DW_AT_const_value : 32
 <2><11ee>: Abbrev Number: 11 (DW_TAG_enumerator)
    <11ef>   DW_AT_name        : (indirect string, offset: 0xc9964): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <11f3>   DW_AT_const_value : 0
 <2><11f4>: Abbrev Number: 0
 <1><11f5>: Abbrev Number: 9 (DW_TAG_typedef)
    <11f6>   DW_AT_name        : (indirect string, offset: 0xc99df): HAL_TIM_ActiveChannel
    <11fa>   DW_AT_decl_file   : 9
    <11fb>   DW_AT_decl_line   : 341
    <11fd>   DW_AT_decl_column : 3
    <11fe>   DW_AT_type        : <0x11bb>
 <1><1202>: Abbrev Number: 6 (DW_TAG_structure_type)
    <1203>   DW_AT_byte_size   : 76
    <1204>   DW_AT_decl_file   : 9
    <1205>   DW_AT_decl_line   : 349
    <1207>   DW_AT_decl_column : 9
    <1208>   DW_AT_sibling     : <0x128b>
 <2><120c>: Abbrev Number: 8 (DW_TAG_member)
    <120d>   DW_AT_name        : (indirect string, offset: 0xc9cae): Instance
    <1211>   DW_AT_decl_file   : 9
    <1212>   DW_AT_decl_line   : 352
    <1214>   DW_AT_decl_column : 39
    <1215>   DW_AT_type        : <0x128b>
    <1219>   DW_AT_data_member_location: 0
 <2><121a>: Abbrev Number: 8 (DW_TAG_member)
    <121b>   DW_AT_name        : (indirect string, offset: 0xcf179): Init
    <121f>   DW_AT_decl_file   : 9
    <1220>   DW_AT_decl_line   : 353
    <1222>   DW_AT_decl_column : 38
    <1223>   DW_AT_type        : <0x1107>
    <1227>   DW_AT_data_member_location: 4
 <2><1228>: Abbrev Number: 8 (DW_TAG_member)
    <1229>   DW_AT_name        : (indirect string, offset: 0xc99ed): Channel
    <122d>   DW_AT_decl_file   : 9
    <122e>   DW_AT_decl_line   : 354
    <1230>   DW_AT_decl_column : 38
    <1231>   DW_AT_type        : <0x11f5>
    <1235>   DW_AT_data_member_location: 28
 <2><1236>: Abbrev Number: 8 (DW_TAG_member)
    <1237>   DW_AT_name        : (indirect string, offset: 0xc9afc): hdma
    <123b>   DW_AT_decl_file   : 9
    <123c>   DW_AT_decl_line   : 355
    <123e>   DW_AT_decl_column : 39
    <123f>   DW_AT_type        : <0x1291>
    <1243>   DW_AT_data_member_location: 32
 <2><1244>: Abbrev Number: 8 (DW_TAG_member)
    <1245>   DW_AT_name        : (indirect string, offset: 0x8f189): Lock
    <1249>   DW_AT_decl_file   : 9
    <124a>   DW_AT_decl_line   : 357
    <124c>   DW_AT_decl_column : 38
    <124d>   DW_AT_type        : <0xd9f>
    <1251>   DW_AT_data_member_location: 60
 <2><1252>: Abbrev Number: 8 (DW_TAG_member)
    <1253>   DW_AT_name        : (indirect string, offset: 0xd01cf): State
    <1257>   DW_AT_decl_file   : 9
    <1258>   DW_AT_decl_line   : 358
