Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x405 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xc52e2): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x8a51f): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa6a37): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/TUT01/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x10a01): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5cdf9): long long int

 <2><181>: Abbrev Number: 11 (DW_TAG_enumerator)
    <182>   DW_AT_name        : (indirect string, offset: 0xca84b): osPriorityAboveNormal2
    <186>   DW_AT_const_value : 34
 <2><187>: Abbrev Number: 11 (DW_TAG_enumerator)
    <188>   DW_AT_name        : (indirect string, offset: 0xca862): osPriorityAboveNormal3
    <18c>   DW_AT_const_value : 35
 <2><18d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <18e>   DW_AT_name        : (indirect string, offset: 0xca879): osPriorityAboveNormal4
    <192>   DW_AT_const_value : 36
 <2><193>: Abbrev Number: 11 (DW_TAG_enumerator)
    <194>   DW_AT_name        : (indirect string, offset: 0xb36b0): osPriorityAboveNormal5
    <198>   DW_AT_const_value : 37
 <2><199>: Abbrev Number: 11 (DW_TAG_enumerator)
    <19a>   DW_AT_name        : (indirect string, offset: 0xca8a6): osPriorityAboveNormal6
    <19e>   DW_AT_const_value : 38
 <2><19f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1a0>   DW_AT_name        : (indirect string, offset: 0xca8bd): osPriorityAboveNormal7
    <1a4>   DW_AT_const_value : 39
 <2><1a5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1a6>   DW_AT_name        : (indirect string, offset: 0x484c1): osPriorityHigh
    <1aa>   DW_AT_const_value : 40
 <2><1ab>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1ac>   DW_AT_name        : (indirect string, offset: 0x86f8f): osPriorityHigh1
    <1b0>   DW_AT_const_value : 41
 <2><1b1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1b2>   DW_AT_name        : (indirect string, offset: 0x86f9f): osPriorityHigh2
    <1b6>   DW_AT_const_value : 42
 <2><1b7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x86faf): osPriorityHigh3
    <1bc>   DW_AT_const_value : 43
 <2><1bd>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1be>   DW_AT_name        : (indirect string, offset: 0x86fbf): osPriorityHigh4
    <1c2>   DW_AT_const_value : 44
 <2><1c3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x438e): osPriorityHigh5
    <1c8>   DW_AT_const_value : 45
 <2><1c9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1ca>   DW_AT_name        : (indirect string, offset: 0x87002): osPriorityHigh6
    <1ce>   DW_AT_const_value : 46
 <2><1cf>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x87012): osPriorityHigh7
    <1d4>   DW_AT_const_value : 47
 <2><1d5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1d6>   DW_AT_name        : (indirect string, offset: 0xb7bf3): osPriorityRealtime
    <1da>   DW_AT_const_value : 48
 <2><1db>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x7fce8): osPriorityRealtime1
    <1e0>   DW_AT_const_value : 49
 <2><1e1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x7fcfc): osPriorityRealtime2
    <1e6>   DW_AT_const_value : 50
 <2><1e7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x7fd10): osPriorityRealtime3
    <1ec>   DW_AT_const_value : 51
 <2><1ed>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1ee>   DW_AT_name        : (indirect string, offset: 0x7fd24): osPriorityRealtime4
    <1f2>   DW_AT_const_value : 52
 <2><1f3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x7fd38): osPriorityRealtime5
    <1f8>   DW_AT_const_value : 53
 <2><1f9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1fa>   DW_AT_name        : (indirect string, offset: 0x7fd4c): osPriorityRealtime6
    <1fe>   DW_AT_const_value : 54
 <2><1ff>: Abbrev Number: 11 (DW_TAG_enumerator)
    <200>   DW_AT_name        : (indirect string, offset: 0x7fd60): osPriorityRealtime7
    <204>   DW_AT_const_value : 55
 <2><205>: Abbrev Number: 11 (DW_TAG_enumerator)
    <206>   DW_AT_name        : (indirect string, offset: 0xd08): osPriorityISR
    <20a>   DW_AT_const_value : 56
 <2><20b>: Abbrev Number: 12 (DW_TAG_enumerator)
    <20c>   DW_AT_name        : (indirect string, offset: 0xb31e0): osPriorityError
    <210>   DW_AT_const_value : -1
 <2><211>: Abbrev Number: 13 (DW_TAG_enumerator)
    <212>   DW_AT_name        : (indirect string, offset: 0xc0e90): osPriorityReserved
    <216>   DW_AT_const_value : 0x7fffffff
 <2><21a>: Abbrev Number: 0
 <1><21b>: Abbrev Number: 4 (DW_TAG_typedef)
    <21c>   DW_AT_name        : (indirect string, offset: 0x959c7): osPriority_t
    <220>   DW_AT_decl_file   : 4
    <221>   DW_AT_decl_line   : 136
    <222>   DW_AT_decl_column : 3
    <223>   DW_AT_type        : <0xcb>
 <1><227>: Abbrev Number: 4 (DW_TAG_typedef)
    <228>   DW_AT_name        : (indirect string, offset: 0x6e701): osThreadFunc_t
    <22c>   DW_AT_decl_file   : 4
    <22d>   DW_AT_decl_line   : 139
    <22e>   DW_AT_decl_column : 16
    <22f>   DW_AT_type        : <0xa6>
 <1><233>: Abbrev Number: 4 (DW_TAG_typedef)
    <234>   DW_AT_name        : (indirect string, offset: 0x24e03): osThreadId_t
    <238>   DW_AT_decl_file   : 4
    <239>   DW_AT_decl_line   : 189
    <23a>   DW_AT_decl_column : 15
    <23b>   DW_AT_type        : <0xb7>
 <1><23f>: Abbrev Number: 4 (DW_TAG_typedef)
    <240>   DW_AT_name        : (indirect string, offset: 0x88bd4): TZ_ModuleId_t
    <244>   DW_AT_decl_file   : 4
    <245>   DW_AT_decl_line   : 213
    <246>   DW_AT_decl_column : 18
    <247>   DW_AT_type        : <0x9a>
 <1><24b>: Abbrev Number: 14 (DW_TAG_structure_type)
    <24c>   DW_AT_byte_size   : 36
    <24d>   DW_AT_decl_file   : 4
    <24e>   DW_AT_decl_line   : 218
    <24f>   DW_AT_decl_column : 9
    <250>   DW_AT_sibling     : <0x2ca>
 <2><254>: Abbrev Number: 15 (DW_TAG_member)
    <255>   DW_AT_name        : (indirect string, offset: 0xb5a5a): name
    <259>   DW_AT_decl_file   : 4
    <25a>   DW_AT_decl_line   : 219
    <25b>   DW_AT_decl_column : 33
    <25c>   DW_AT_type        : <0xc5>
    <260>   DW_AT_data_member_location: 0
 <2><261>: Abbrev Number: 15 (DW_TAG_member)
    <262>   DW_AT_name        : (indirect string, offset: 0x85147): attr_bits
    <266>   DW_AT_decl_file   : 4
    <267>   DW_AT_decl_line   : 220
    <268>   DW_AT_decl_column : 28
    <269>   DW_AT_type        : <0x9a>
    <26d>   DW_AT_data_member_location: 4
 <2><26e>: Abbrev Number: 15 (DW_TAG_member)
    <26f>   DW_AT_name        : (indirect string, offset: 0x276c7): cb_mem
    <273>   DW_AT_decl_file   : 4
    <274>   DW_AT_decl_line   : 221
    <275>   DW_AT_decl_column : 30
    <276>   DW_AT_type        : <0xb7>
    <27a>   DW_AT_data_member_location: 8
 <2><27b>: Abbrev Number: 15 (DW_TAG_member)
    <27c>   DW_AT_name        : (indirect string, offset: 0xc00eb): cb_size
    <280>   DW_AT_decl_file   : 4
    <281>   DW_AT_decl_line   : 222
    <282>   DW_AT_decl_column : 30
    <283>   DW_AT_type        : <0x9a>
    <287>   DW_AT_data_member_location: 12
 <2><288>: Abbrev Number: 15 (DW_TAG_member)
    <289>   DW_AT_name        : (indirect string, offset: 0xb8503): stack_mem
    <28d>   DW_AT_decl_file   : 4
    <28e>   DW_AT_decl_line   : 223
    <28f>   DW_AT_decl_column : 27
    <290>   DW_AT_type        : <0xb7>
    <294>   DW_AT_data_member_location: 16
 <2><295>: Abbrev Number: 15 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x7fdc5): stack_size
    <29a>   DW_AT_decl_file   : 4
    <29b>   DW_AT_decl_line   : 224
    <29c>   DW_AT_decl_column : 27
    <29d>   DW_AT_type        : <0x9a>
    <2a1>   DW_AT_data_member_location: 20
 <2><2a2>: Abbrev Number: 15 (DW_TAG_member)
    <2a3>   DW_AT_name        : (indirect string, offset: 0x508e3): priority
    <2a7>   DW_AT_decl_file   : 4
    <2a8>   DW_AT_decl_line   : 225
    <2a9>   DW_AT_decl_column : 29
    <2aa>   DW_AT_type        : <0x21b>
    <2ae>   DW_AT_data_member_location: 24
 <2><2af>: Abbrev Number: 15 (DW_TAG_member)
    <2b0>   DW_AT_name        : (indirect string, offset: 0x56a6f): tz_module
    <2b4>   DW_AT_decl_file   : 4
    <2b5>   DW_AT_decl_line   : 226
    <2b6>   DW_AT_decl_column : 28
    <2b7>   DW_AT_type        : <0x23f>
    <2bb>   DW_AT_data_member_location: 28
 <2><2bc>: Abbrev Number: 15 (DW_TAG_member)
    <2bd>   DW_AT_name        : (indirect string, offset: 0xb62db): reserved
    <2c1>   DW_AT_decl_file   : 4
    <2c2>   DW_AT_decl_line   : 227
    <2c3>   DW_AT_decl_column : 29
    <2c4>   DW_AT_type        : <0x9a>
    <2c8>   DW_AT_data_member_location: 32
 <2><2c9>: Abbrev Number: 0
 <1><2ca>: Abbrev Number: 4 (DW_TAG_typedef)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x1fecf): osThreadAttr_t
    <2cf>   DW_AT_decl_file   : 4
    <2d0>   DW_AT_decl_line   : 228
    <2d1>   DW_AT_decl_column : 3
    <2d2>   DW_AT_type        : <0x24b>
 <1><2d6>: Abbrev Number: 9 (DW_TAG_const_type)
    <2d7>   DW_AT_type        : <0x2ca>
 <1><2db>: Abbrev Number: 16 (DW_TAG_array_type)
    <2dc>   DW_AT_type        : <0x233>
    <2e0>   DW_AT_sibling     : <0x2eb>
 <2><2e4>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <2e5>   DW_AT_type        : <0x30>
    <2e9>   DW_AT_upper_bound : 1
 <2><2ea>: Abbrev Number: 0
 <1><2eb>: Abbrev Number: 18 (DW_TAG_variable)
    <2ec>   DW_AT_name        : (indirect string, offset: 0x4baa5): producerHandles
    <2f0>   DW_AT_decl_file   : 1
    <2f1>   DW_AT_decl_line   : 62
    <2f2>   DW_AT_decl_column : 14
    <2f3>   DW_AT_type        : <0x2db>
    <2f7>   DW_AT_external    : 1
    <2f7>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><2fd>: Abbrev Number: 18 (DW_TAG_variable)
    <2fe>   DW_AT_name        : (indirect string, offset: 0x1dec7): consumerHandle
    <302>   DW_AT_decl_file   : 1
    <303>   DW_AT_decl_line   : 63
    <304>   DW_AT_decl_column : 14
    <305>   DW_AT_type        : <0x233>
    <309>   DW_AT_external    : 1
    <309>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><30f>: Abbrev Number: 18 (DW_TAG_variable)
    <310>   DW_AT_name        : (indirect string, offset: 0x50e37): defaultTaskHandle
    <314>   DW_AT_decl_file   : 1
    <315>   DW_AT_decl_line   : 67
    <316>   DW_AT_decl_column : 14
    <317>   DW_AT_type        : <0x233>
    <31b>   DW_AT_external    : 1
    <31b>   DW_AT_location    : 5 byte block: 3 9c 0 0 20 	(DW_OP_addr: 2000009c)
 <1><321>: Abbrev Number: 18 (DW_TAG_variable)
    <322>   DW_AT_name        : (indirect string, offset: 0x5a3be): defaultTask_attributes
    <326>   DW_AT_decl_file   : 1
    <327>   DW_AT_decl_line   : 68
    <328>   DW_AT_decl_column : 22
    <329>   DW_AT_type        : <0x2d6>
    <32d>   DW_AT_external    : 1
    <32d>   DW_AT_location    : 5 byte block: 3 80 84 0 8 	(DW_OP_addr: 8008480)
 <1><333>: Abbrev Number: 19 (DW_TAG_subprogram)
    <334>   DW_AT_external    : 1
    <334>   DW_AT_name        : (indirect string, offset: 0x174e1): osThreadExit
    <338>   DW_AT_decl_file   : 4
    <339>   DW_AT_decl_line   : 411
    <33b>   DW_AT_decl_column : 18
    <33c>   DW_AT_prototyped  : 1
    <33c>   DW_AT_noreturn    : 1
    <33c>   DW_AT_declaration : 1
 <1><33c>: Abbrev Number: 20 (DW_TAG_subprogram)
    <33d>   DW_AT_external    : 1
    <33d>   DW_AT_name        : (indirect string, offset: 0xa820): ConsumerTask
    <341>   DW_AT_decl_file   : 5
    <342>   DW_AT_decl_line   : 37
    <343>   DW_AT_decl_column : 6
    <344>   DW_AT_prototyped  : 1
    <344>   DW_AT_declaration : 1
    <344>   DW_AT_sibling     : <0x34e>
 <2><348>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <349>   DW_AT_type        : <0xb7>
 <2><34d>: Abbrev Number: 0
 <1><34e>: Abbrev Number: 20 (DW_TAG_subprogram)
    <34f>   DW_AT_external    : 1
    <34f>   DW_AT_name        : (indirect string, offset: 0xc0117): ProducerTask
    <353>   DW_AT_decl_file   : 5
    <354>   DW_AT_decl_line   : 36
    <355>   DW_AT_decl_column : 6
    <356>   DW_AT_prototyped  : 1
    <356>   DW_AT_declaration : 1
    <356>   DW_AT_sibling     : <0x360>
 <2><35a>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <35b>   DW_AT_type        : <0xb7>
 <2><35f>: Abbrev Number: 0
 <1><360>: Abbrev Number: 21 (DW_TAG_subprogram)
    <361>   DW_AT_external    : 1
    <361>   DW_AT_name        : (indirect string, offset: 0x713bb): osThreadNew
    <365>   DW_AT_decl_file   : 4
    <366>   DW_AT_decl_line   : 349
    <368>   DW_AT_decl_column : 14
    <369>   DW_AT_prototyped  : 1
    <369>   DW_AT_type        : <0x233>
    <36d>   DW_AT_declaration : 1
    <36d>   DW_AT_sibling     : <0x381>
 <2><371>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <372>   DW_AT_type        : <0x227>
 <2><376>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <377>   DW_AT_type        : <0xb7>
 <2><37b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <37c>   DW_AT_type        : <0x381>
 <2><380>: Abbrev Number: 0
 <1><381>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <382>   DW_AT_byte_size   : 4
    <383>   DW_AT_type        : <0x2d6>
 <1><387>: Abbrev Number: 20 (DW_TAG_subprogram)
    <388>   DW_AT_external    : 1
    <388>   DW_AT_name        : (indirect string, offset: 0x1f51f): SemInit
    <38c>   DW_AT_decl_file   : 5
    <38d>   DW_AT_decl_line   : 28
    <38e>   DW_AT_decl_column : 6
    <38f>   DW_AT_prototyped  : 1
    <38f>   DW_AT_declaration : 1
    <38f>   DW_AT_sibling     : <0x399>
 <2><393>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <394>   DW_AT_type        : <0x8e>
 <2><398>: Abbrev Number: 0
 <1><399>: Abbrev Number: 22 (DW_TAG_subprogram)
    <39a>   DW_AT_external    : 1
    <39a>   DW_AT_name        : (indirect string, offset: 0x2c9eb): StartDefaultTask
    <39e>   DW_AT_decl_file   : 1
    <39f>   DW_AT_decl_line   : 136
    <3a0>   DW_AT_decl_column : 6
    <3a1>   DW_AT_prototyped  : 1
    <3a1>   DW_AT_low_pc      : 0x80005b0
    <3a5>   DW_AT_high_pc     : 0xa4
    <3a9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3ab>   DW_AT_GNU_all_tail_call_sites: 1
    <3ab>   DW_AT_sibling     : <0x3f6>
 <2><3af>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <3b0>   DW_AT_name        : (indirect string, offset: 0x2b381): argument
    <3b4>   DW_AT_decl_file   : 1
    <3b5>   DW_AT_decl_line   : 136
    <3b6>   DW_AT_decl_column : 29
    <3b7>   DW_AT_type        : <0xb7>
    <3bb>   DW_AT_location    : 3 byte block: 91 9c 7f 	(DW_OP_fbreg: -100)
 <2><3bf>: Abbrev Number: 24 (DW_TAG_variable)
    <3c0>   DW_AT_name        : (indirect string, offset: 0xb531c): producerAttributes
    <3c4>   DW_AT_decl_file   : 1
    <3c5>   DW_AT_decl_line   : 139
    <3c6>   DW_AT_decl_column : 16
    <3c7>   DW_AT_type        : <0x2ca>
    <3cb>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><3ce>: Abbrev Number: 24 (DW_TAG_variable)
    <3cf>   DW_AT_name        : (indirect string, offset: 0x6fdc5): consumerAttributes
    <3d3>   DW_AT_decl_file   : 1
    <3d4>   DW_AT_decl_line   : 144
    <3d5>   DW_AT_decl_column : 16
    <3d6>   DW_AT_type        : <0x2ca>
    <3da>   DW_AT_location    : 3 byte block: 91 a4 7f 	(DW_OP_fbreg: -92)
 <2><3de>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <3df>   DW_AT_low_pc      : 0x80005f0
    <3e3>   DW_AT_high_pc     : 0x34
 <3><3e7>: Abbrev Number: 26 (DW_TAG_variable)
    <3e8>   DW_AT_name        : i
    <3ea>   DW_AT_decl_file   : 1
    <3eb>   DW_AT_decl_line   : 152
    <3ec>   DW_AT_decl_column : 16
    <3ed>   DW_AT_type        : <0x8e>
    <3f1>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <3><3f4>: Abbrev Number: 0
 <2><3f5>: Abbrev Number: 0
 <1><3f6>: Abbrev Number: 27 (DW_TAG_subprogram)
    <3f7>   DW_AT_external    : 1
    <3f7>   DW_AT_name        : (indirect string, offset: 0xa3401): MX_FREERTOS_Init
    <3fb>   DW_AT_decl_file   : 1
    <3fc>   DW_AT_decl_line   : 88
    <3fd>   DW_AT_decl_column : 6
    <3fe>   DW_AT_prototyped  : 1
    <3fe>   DW_AT_low_pc      : 0x8000584
    <402>   DW_AT_high_pc     : 0x2c
    <406>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <408>   DW_AT_GNU_all_tail_call_sites: 1
 <1><408>: Abbrev Number: 0
  Compilation Unit @ offset 0x409:
   Length:        0x4ce (32-bit)
   Version:       4
   Abbrev Offset: 0x18a
   Pointer Size:  4
 <0><414>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <415>   DW_AT_producer    : (indirect string, offset: 0xc52e2): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <419>   DW_AT_language    : 12	(ANSI C99)
    <41a>   DW_AT_name        : (indirect string, offset: 0xcbb10): ../Core/Src/gpio.c
    <41e>   DW_AT_comp_dir    : (indirect string, offset: 0xa6a37): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/TUT01/Debug
    <422>   DW_AT_ranges      : 0x18
    <426>   DW_AT_low_pc      : 0x0
    <42a>   DW_AT_stmt_list   : 0xb39
    <42e>   DW_AT_GNU_macros  : 0x2027a
 <1><432>: Abbrev Number: 2 (DW_TAG_base_type)
    <433>   DW_AT_byte_size   : 1
    <434>   DW_AT_encoding    : 6	(signed char)
    <435>   DW_AT_name        : (indirect string, offset: 0x66240): signed char
 <1><439>: Abbrev Number: 2 (DW_TAG_base_type)
    <43a>   DW_AT_byte_size   : 1
    <43b>   DW_AT_encoding    : 8	(unsigned char)
    <43c>   DW_AT_name        : (indirect string, offset: 0xc3ef7): unsigned char
 <1><440>: Abbrev Number: 2 (DW_TAG_base_type)
    <441>   DW_AT_byte_size   : 2
    <442>   DW_AT_encoding    : 5	(signed)
    <443>   DW_AT_name        : (indirect string, offset: 0x9707a): short int
 <1><447>: Abbrev Number: 3 (DW_TAG_typedef)
    <448>   DW_AT_name        : (indirect string, offset: 0xcbc45): __uint16_t
    <44c>   DW_AT_decl_file   : 2
    <44d>   DW_AT_decl_line   : 57
    <44e>   DW_AT_decl_column : 25
    <44f>   DW_AT_type        : <0x453>
 <1><453>: Abbrev Number: 2 (DW_TAG_base_type)
    <454>   DW_AT_byte_size   : 2
    <455>   DW_AT_encoding    : 7	(unsigned)
    <456>   DW_AT_name        : (indirect string, offset: 0xc25e9): short unsigned int
 <1><45a>: Abbrev Number: 2 (DW_TAG_base_type)
    <45b>   DW_AT_byte_size   : 4
    <45c>   DW_AT_encoding    : 5	(signed)
    <45d>   DW_AT_name        : (indirect string, offset: 0x1143e): long int
 <1><461>: Abbrev Number: 3 (DW_TAG_typedef)
    <462>   DW_AT_name        : (indirect string, offset: 0x81c0e): __uint32_t
    <466>   DW_AT_decl_file   : 2
    <467>   DW_AT_decl_line   : 79
    <468>   DW_AT_decl_column : 25
    <469>   DW_AT_type        : <0x46d>
 <1><46d>: Abbrev Number: 2 (DW_TAG_base_type)
    <46e>   DW_AT_byte_size   : 4
    <46f>   DW_AT_encoding    : 7	(unsigned)
    <470>   DW_AT_name        : (indirect string, offset: 0x4dc0a): long unsigned int
 <1><474>: Abbrev Number: 2 (DW_TAG_base_type)
    <475>   DW_AT_byte_size   : 8
    <476>   DW_AT_encoding    : 5	(signed)
    <477>   DW_AT_name        : (indirect string, offset: 0x5cdf9): long long int
 <1><47b>: Abbrev Number: 2 (DW_TAG_base_type)
    <47c>   DW_AT_byte_size   : 8
    <47d>   DW_AT_encoding    : 7	(unsigned)
    <47e>   DW_AT_name        : (indirect string, offset: 0x2a108): long long unsigned int
 <1><482>: Abbrev Number: 4 (DW_TAG_base_type)
    <483>   DW_AT_byte_size   : 4
    <484>   DW_AT_encoding    : 5	(signed)
    <485>   DW_AT_name        : int
 <1><489>: Abbrev Number: 2 (DW_TAG_base_type)
    <48a>   DW_AT_byte_size   : 4
    <48b>   DW_AT_encoding    : 7	(unsigned)
    <48c>   DW_AT_name        : (indirect string, offset: 0x10a01): unsigned int
 <1><490>: Abbrev Number: 3 (DW_TAG_typedef)
    <491>   DW_AT_name        : (indirect string, offset: 0x94192): uint16_t
    <495>   DW_AT_decl_file   : 3
    <496>   DW_AT_decl_line   : 36
    <497>   DW_AT_decl_column : 20
    <498>   DW_AT_type        : <0x447>
 <1><49c>: Abbrev Number: 3 (DW_TAG_typedef)
    <49d>   DW_AT_name        : (indirect string, offset: 0x93741): uint32_t
    <4a1>   DW_AT_decl_file   : 3
    <4a2>   DW_AT_decl_line   : 48
    <4a3>   DW_AT_decl_column : 20
    <4a4>   DW_AT_type        : <0x461>
 <1><4a8>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <4a9>   DW_AT_type        : <0x49c>
 <1><4ad>: Abbrev Number: 6 (DW_TAG_structure_type)
    <4ae>   DW_AT_byte_size   : 44
    <4af>   DW_AT_decl_file   : 4
    <4b0>   DW_AT_decl_line   : 451
    <4b2>   DW_AT_decl_column : 9
    <4b3>   DW_AT_sibling     : <0x544>
 <2><4b7>: Abbrev Number: 7 (DW_TAG_member)
    <4b8>   DW_AT_name        : (indirect string, offset: 0xcba9c): MODER
    <4bc>   DW_AT_decl_file   : 4
    <4bd>   DW_AT_decl_line   : 453
    <4bf>   DW_AT_decl_column : 17
    <4c0>   DW_AT_type        : <0x4a8>
    <4c4>   DW_AT_data_member_location: 0
 <2><4c5>: Abbrev Number: 7 (DW_TAG_member)
    <4c6>   DW_AT_name        : (indirect string, offset: 0xcbc0a): OTYPER
    <4ca>   DW_AT_decl_file   : 4
    <4cb>   DW_AT_decl_line   : 454
    <4cd>   DW_AT_decl_column : 17
    <4ce>   DW_AT_type        : <0x4a8>
    <4d2>   DW_AT_data_member_location: 4
 <2><4d3>: Abbrev Number: 7 (DW_TAG_member)
    <4d4>   DW_AT_name        : (indirect string, offset: 0xcbc55): OSPEEDR
    <4d8>   DW_AT_decl_file   : 4
    <4d9>   DW_AT_decl_line   : 455
    <4db>   DW_AT_decl_column : 17
    <4dc>   DW_AT_type        : <0x4a8>
    <4e0>   DW_AT_data_member_location: 8
 <2><4e1>: Abbrev Number: 7 (DW_TAG_member)
    <4e2>   DW_AT_name        : (indirect string, offset: 0xcbbe9): PUPDR
    <4e6>   DW_AT_decl_file   : 4
    <4e7>   DW_AT_decl_line   : 456
    <4e9>   DW_AT_decl_column : 17
    <4ea>   DW_AT_type        : <0x4a8>
    <4ee>   DW_AT_data_member_location: 12
 <2><4ef>: Abbrev Number: 8 (DW_TAG_member)
    <4f0>   DW_AT_name        : IDR
    <4f4>   DW_AT_decl_file   : 4
    <4f5>   DW_AT_decl_line   : 457
    <4f7>   DW_AT_decl_column : 17
    <4f8>   DW_AT_type        : <0x4a8>
    <4fc>   DW_AT_data_member_location: 16
 <2><4fd>: Abbrev Number: 8 (DW_TAG_member)
    <4fe>   DW_AT_name        : ODR
    <502>   DW_AT_decl_file   : 4
    <503>   DW_AT_decl_line   : 458
    <505>   DW_AT_decl_column : 17
    <506>   DW_AT_type        : <0x4a8>
    <50a>   DW_AT_data_member_location: 20
 <2><50b>: Abbrev Number: 7 (DW_TAG_member)
    <50c>   DW_AT_name        : (indirect string, offset: 0xcbb46): BSRR
    <510>   DW_AT_decl_file   : 4
    <511>   DW_AT_decl_line   : 459
    <513>   DW_AT_decl_column : 17
    <514>   DW_AT_type        : <0x4a8>
    <518>   DW_AT_data_member_location: 24
 <2><519>: Abbrev Number: 7 (DW_TAG_member)
    <51a>   DW_AT_name        : (indirect string, offset: 0xcbc50): LCKR
    <51e>   DW_AT_decl_file   : 4
    <51f>   DW_AT_decl_line   : 460
    <521>   DW_AT_decl_column : 17
    <522>   DW_AT_type        : <0x4a8>
    <526>   DW_AT_data_member_location: 28
 <2><527>: Abbrev Number: 8 (DW_TAG_member)
    <528>   DW_AT_name        : AFR
    <52c>   DW_AT_decl_file   : 4
    <52d>   DW_AT_decl_line   : 461
    <52f>   DW_AT_decl_column : 17
    <530>   DW_AT_type        : <0x554>
    <534>   DW_AT_data_member_location: 32
 <2><535>: Abbrev Number: 8 (DW_TAG_member)
    <536>   DW_AT_name        : BRR
    <53a>   DW_AT_decl_file   : 4
    <53b>   DW_AT_decl_line   : 462
    <53d>   DW_AT_decl_column : 17
    <53e>   DW_AT_type        : <0x4a8>
    <542>   DW_AT_data_member_location: 40
 <2><543>: Abbrev Number: 0
 <1><544>: Abbrev Number: 9 (DW_TAG_array_type)
    <545>   DW_AT_type        : <0x4a8>
    <549>   DW_AT_sibling     : <0x554>
 <2><54d>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <54e>   DW_AT_type        : <0x489>
    <552>   DW_AT_upper_bound : 1
 <2><553>: Abbrev Number: 0
 <1><554>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <555>   DW_AT_type        : <0x544>
 <1><559>: Abbrev Number: 11 (DW_TAG_typedef)
    <55a>   DW_AT_name        : (indirect string, offset: 0xcbcaf): GPIO_TypeDef
    <55e>   DW_AT_decl_file   : 4
    <55f>   DW_AT_decl_line   : 464
    <561>   DW_AT_decl_column : 3
    <562>   DW_AT_type        : <0x4ad>
 <1><566>: Abbrev Number: 6 (DW_TAG_structure_type)
    <567>   DW_AT_byte_size   : 156
    <568>   DW_AT_decl_file   : 4
    <569>   DW_AT_decl_line   : 590
    <56b>   DW_AT_decl_column : 9
    <56c>   DW_AT_sibling     : <0x792>
 <2><570>: Abbrev Number: 8 (DW_TAG_member)
    <571>   DW_AT_name        : CR
    <574>   DW_AT_decl_file   : 4
    <575>   DW_AT_decl_line   : 592
    <577>   DW_AT_decl_column : 17
    <578>   DW_AT_type        : <0x4a8>
    <57c>   DW_AT_data_member_location: 0
 <2><57d>: Abbrev Number: 7 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0xcbbfc): ICSCR
    <582>   DW_AT_decl_file   : 4
    <583>   DW_AT_decl_line   : 593
    <585>   DW_AT_decl_column : 17
    <586>   DW_AT_type        : <0x4a8>
    <58a>   DW_AT_data_member_location: 4
 <2><58b>: Abbrev Number: 7 (DW_TAG_member)
    <58c>   DW_AT_name        : (indirect string, offset: 0xcbb6b): CFGR
    <590>   DW_AT_decl_file   : 4
    <591>   DW_AT_decl_line   : 594
    <593>   DW_AT_decl_column : 17
    <594>   DW_AT_type        : <0x4a8>
    <598>   DW_AT_data_member_location: 8
 <2><599>: Abbrev Number: 7 (DW_TAG_member)
    <59a>   DW_AT_name        : (indirect string, offset: 0xcbc02): PLLCFGR
    <59e>   DW_AT_decl_file   : 4
    <59f>   DW_AT_decl_line   : 595
    <5a1>   DW_AT_decl_column : 17
    <5a2>   DW_AT_type        : <0x4a8>
    <5a6>   DW_AT_data_member_location: 12
 <2><5a7>: Abbrev Number: 7 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0xcbb64): PLLSAI1CFGR
    <5ac>   DW_AT_decl_file   : 4
    <5ad>   DW_AT_decl_line   : 596
    <5af>   DW_AT_decl_column : 17
    <5b0>   DW_AT_type        : <0x4a8>
    <5b4>   DW_AT_data_member_location: 16
 <2><5b5>: Abbrev Number: 7 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0x7ac9f): RESERVED
    <5ba>   DW_AT_decl_file   : 4
    <5bb>   DW_AT_decl_line   : 597
    <5bd>   DW_AT_decl_column : 17
    <5be>   DW_AT_type        : <0x49c>
    <5c2>   DW_AT_data_member_location: 20
 <2><5c3>: Abbrev Number: 7 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0xcbaae): CIER
    <5c8>   DW_AT_decl_file   : 4
    <5c9>   DW_AT_decl_line   : 598
    <5cb>   DW_AT_decl_column : 17
    <5cc>   DW_AT_type        : <0x4a8>
    <5d0>   DW_AT_data_member_location: 24
 <2><5d1>: Abbrev Number: 7 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0xcbab3): CIFR
    <5d6>   DW_AT_decl_file   : 4
    <5d7>   DW_AT_decl_line   : 599
    <5d9>   DW_AT_decl_column : 17
    <5da>   DW_AT_type        : <0x4a8>
    <5de>   DW_AT_data_member_location: 28
 <2><5df>: Abbrev Number: 7 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0xcbaa9): CICR
    <5e4>   DW_AT_decl_file   : 4
    <5e5>   DW_AT_decl_line   : 600
    <5e7>   DW_AT_decl_column : 17
    <5e8>   DW_AT_type        : <0x4a8>
    <5ec>   DW_AT_data_member_location: 32
 <2><5ed>: Abbrev Number: 7 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0xcbc73): RESERVED0
    <5f2>   DW_AT_decl_file   : 4
    <5f3>   DW_AT_decl_line   : 601
    <5f5>   DW_AT_decl_column : 17
    <5f6>   DW_AT_type        : <0x49c>
    <5fa>   DW_AT_data_member_location: 36
 <2><5fb>: Abbrev Number: 7 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0xcbc22): AHB1RSTR
    <600>   DW_AT_decl_file   : 4
    <601>   DW_AT_decl_line   : 602
    <603>   DW_AT_decl_column : 17
    <604>   DW_AT_type        : <0x4a8>
    <608>   DW_AT_data_member_location: 40
 <2><609>: Abbrev Number: 7 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0xcbb07): AHB2RSTR
    <60e>   DW_AT_decl_file   : 4
    <60f>   DW_AT_decl_line   : 603
    <611>   DW_AT_decl_column : 17
    <612>   DW_AT_type        : <0x4a8>
    <616>   DW_AT_data_member_location: 44
 <2><617>: Abbrev Number: 7 (DW_TAG_member)
    <618>   DW_AT_name        : (indirect string, offset: 0xcbb83): AHB3RSTR
    <61c>   DW_AT_decl_file   : 4
    <61d>   DW_AT_decl_line   : 604
    <61f>   DW_AT_decl_column : 17
    <620>   DW_AT_type        : <0x4a8>
    <624>   DW_AT_data_member_location: 48
 <2><625>: Abbrev Number: 7 (DW_TAG_member)
    <626>   DW_AT_name        : (indirect string, offset: 0xcbc7d): RESERVED1
    <62a>   DW_AT_decl_file   : 4
    <62b>   DW_AT_decl_line   : 605
    <62d>   DW_AT_decl_column : 17
    <62e>   DW_AT_type        : <0x49c>
    <632>   DW_AT_data_member_location: 52
 <2><633>: Abbrev Number: 7 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0xcbb23): APB1RSTR1
    <638>   DW_AT_decl_file   : 4
    <639>   DW_AT_decl_line   : 606
    <63b>   DW_AT_decl_column : 17
    <63c>   DW_AT_type        : <0x4a8>
    <640>   DW_AT_data_member_location: 56
 <2><641>: Abbrev Number: 7 (DW_TAG_member)
    <642>   DW_AT_name        : (indirect string, offset: 0xcbb2d): APB1RSTR2
    <646>   DW_AT_decl_file   : 4
    <647>   DW_AT_decl_line   : 607
    <649>   DW_AT_decl_column : 17
    <64a>   DW_AT_type        : <0x4a8>
    <64e>   DW_AT_data_member_location: 60
 <2><64f>: Abbrev Number: 7 (DW_TAG_member)
    <650>   DW_AT_name        : (indirect string, offset: 0xcbb7a): APB2RSTR
    <654>   DW_AT_decl_file   : 4
    <655>   DW_AT_decl_line   : 608
    <657>   DW_AT_decl_column : 17
    <658>   DW_AT_type        : <0x4a8>
    <65c>   DW_AT_data_member_location: 64
 <2><65d>: Abbrev Number: 7 (DW_TAG_member)
    <65e>   DW_AT_name        : (indirect string, offset: 0xcbc87): RESERVED2
    <662>   DW_AT_decl_file   : 4
    <663>   DW_AT_decl_line   : 609
    <665>   DW_AT_decl_column : 17
    <666>   DW_AT_type        : <0x49c>
    <66a>   DW_AT_data_member_location: 68
 <2><66b>: Abbrev Number: 7 (DW_TAG_member)
    <66c>   DW_AT_name        : (indirect string, offset: 0xcbae0): AHB1ENR
    <670>   DW_AT_decl_file   : 4
    <671>   DW_AT_decl_line   : 610
    <673>   DW_AT_decl_column : 17
    <674>   DW_AT_type        : <0x4a8>
    <678>   DW_AT_data_member_location: 72
 <2><679>: Abbrev Number: 7 (DW_TAG_member)
    <67a>   DW_AT_name        : (indirect string, offset: 0xcbb50): AHB2ENR
    <67e>   DW_AT_decl_file   : 4
    <67f>   DW_AT_decl_line   : 611
    <681>   DW_AT_decl_column : 17
    <682>   DW_AT_type        : <0x4a8>
    <686>   DW_AT_data_member_location: 76
 <2><687>: Abbrev Number: 7 (DW_TAG_member)
    <688>   DW_AT_name        : (indirect string, offset: 0xcbb8c): AHB3ENR
    <68c>   DW_AT_decl_file   : 4
    <68d>   DW_AT_decl_line   : 612
    <68f>   DW_AT_decl_column : 17
    <690>   DW_AT_type        : <0x4a8>
    <694>   DW_AT_data_member_location: 80
 <2><695>: Abbrev Number: 7 (DW_TAG_member)
    <696>   DW_AT_name        : (indirect string, offset: 0xcbc91): RESERVED3
    <69a>   DW_AT_decl_file   : 4
    <69b>   DW_AT_decl_line   : 613
    <69d>   DW_AT_decl_column : 17
    <69e>   DW_AT_type        : <0x49c>
    <6a2>   DW_AT_data_member_location: 84
 <2><6a3>: Abbrev Number: 7 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0xcbab8): APB1ENR1
    <6a8>   DW_AT_decl_file   : 4
    <6a9>   DW_AT_decl_line   : 614
    <6ab>   DW_AT_decl_column : 17
    <6ac>   DW_AT_type        : <0x4a8>
    <6b0>   DW_AT_data_member_location: 88
 <2><6b1>: Abbrev Number: 7 (DW_TAG_member)
    <6b2>   DW_AT_name        : (indirect string, offset: 0xcbac1): APB1ENR2
    <6b6>   DW_AT_decl_file   : 4
    <6b7>   DW_AT_decl_line   : 615
    <6b9>   DW_AT_decl_column : 17
    <6ba>   DW_AT_type        : <0x4a8>
    <6be>   DW_AT_data_member_location: 92
 <2><6bf>: Abbrev Number: 7 (DW_TAG_member)
    <6c0>   DW_AT_name        : (indirect string, offset: 0xcbbb4): APB2ENR
    <6c4>   DW_AT_decl_file   : 4
    <6c5>   DW_AT_decl_line   : 616
    <6c7>   DW_AT_decl_column : 17
    <6c8>   DW_AT_type        : <0x4a8>
    <6cc>   DW_AT_data_member_location: 96
 <2><6cd>: Abbrev Number: 7 (DW_TAG_member)
    <6ce>   DW_AT_name        : (indirect string, offset: 0xcbbc7): RESERVED4
    <6d2>   DW_AT_decl_file   : 4
    <6d3>   DW_AT_decl_line   : 617
    <6d5>   DW_AT_decl_column : 17
    <6d6>   DW_AT_type        : <0x49c>
    <6da>   DW_AT_data_member_location: 100
 <2><6db>: Abbrev Number: 7 (DW_TAG_member)
    <6dc>   DW_AT_name        : (indirect string, offset: 0xcbb9e): AHB1SMENR
    <6e0>   DW_AT_decl_file   : 4
    <6e1>   DW_AT_decl_line   : 618
    <6e3>   DW_AT_decl_column : 17
    <6e4>   DW_AT_type        : <0x4a8>
    <6e8>   DW_AT_data_member_location: 104
 <2><6e9>: Abbrev Number: 7 (DW_TAG_member)
    <6ea>   DW_AT_name        : (indirect string, offset: 0xcbc5d): AHB2SMENR
    <6ee>   DW_AT_decl_file   : 4
    <6ef>   DW_AT_decl_line   : 619
    <6f1>   DW_AT_decl_column : 17
    <6f2>   DW_AT_type        : <0x4a8>
    <6f6>   DW_AT_data_member_location: 108
 <2><6f7>: Abbrev Number: 7 (DW_TAG_member)
    <6f8>   DW_AT_name        : (indirect string, offset: 0xcbb70): AHB3SMENR
    <6fc>   DW_AT_decl_file   : 4
    <6fd>   DW_AT_decl_line   : 620
    <6ff>   DW_AT_decl_column : 17
    <700>   DW_AT_type        : <0x4a8>
    <704>   DW_AT_data_member_location: 112
 <2><705>: Abbrev Number: 7 (DW_TAG_member)
    <706>   DW_AT_name        : (indirect string, offset: 0xcbc9b): RESERVED5
    <70a>   DW_AT_decl_file   : 4
    <70b>   DW_AT_decl_line   : 621
    <70d>   DW_AT_decl_column : 17
    <70e>   DW_AT_type        : <0x49c>
    <712>   DW_AT_data_member_location: 116
 <2><713>: Abbrev Number: 7 (DW_TAG_member)
    <714>   DW_AT_name        : (indirect string, offset: 0xcbaca): APB1SMENR1
    <718>   DW_AT_decl_file   : 4
    <719>   DW_AT_decl_line   : 622
    <71b>   DW_AT_decl_column : 17
    <71c>   DW_AT_type        : <0x4a8>
    <720>   DW_AT_data_member_location: 120
 <2><721>: Abbrev Number: 7 (DW_TAG_member)
    <722>   DW_AT_name        : (indirect string, offset: 0xcbad5): APB1SMENR2
    <726>   DW_AT_decl_file   : 4
    <727>   DW_AT_decl_line   : 623
    <729>   DW_AT_decl_column : 17
    <72a>   DW_AT_type        : <0x4a8>
    <72e>   DW_AT_data_member_location: 124
 <2><72f>: Abbrev Number: 7 (DW_TAG_member)
    <730>   DW_AT_name        : (indirect string, offset: 0xcbc3b): APB2SMENR
    <734>   DW_AT_decl_file   : 4
    <735>   DW_AT_decl_line   : 624
    <737>   DW_AT_decl_column : 17
    <738>   DW_AT_type        : <0x4a8>
    <73c>   DW_AT_data_member_location: 128
 <2><73d>: Abbrev Number: 7 (DW_TAG_member)
    <73e>   DW_AT_name        : (indirect string, offset: 0xcbbd1): RESERVED6
    <742>   DW_AT_decl_file   : 4
    <743>   DW_AT_decl_line   : 625
    <745>   DW_AT_decl_column : 17
    <746>   DW_AT_type        : <0x49c>
    <74a>   DW_AT_data_member_location: 132
 <2><74b>: Abbrev Number: 7 (DW_TAG_member)
    <74c>   DW_AT_name        : (indirect string, offset: 0xcbb5e): CCIPR
    <750>   DW_AT_decl_file   : 4
    <751>   DW_AT_decl_line   : 626
    <753>   DW_AT_decl_column : 17
    <754>   DW_AT_type        : <0x4a8>
    <758>   DW_AT_data_member_location: 136
 <2><759>: Abbrev Number: 7 (DW_TAG_member)
    <75a>   DW_AT_name        : (indirect string, offset: 0xcbca5): RESERVED7
    <75e>   DW_AT_decl_file   : 4
    <75f>   DW_AT_decl_line   : 627
    <761>   DW_AT_decl_column : 17
    <762>   DW_AT_type        : <0x49c>
    <766>   DW_AT_data_member_location: 140
 <2><767>: Abbrev Number: 7 (DW_TAG_member)
    <768>   DW_AT_name        : (indirect string, offset: 0xcbb4b): BDCR
    <76c>   DW_AT_decl_file   : 4
    <76d>   DW_AT_decl_line   : 628
    <76f>   DW_AT_decl_column : 17
    <770>   DW_AT_type        : <0x4a8>
    <774>   DW_AT_data_member_location: 144
 <2><775>: Abbrev Number: 8 (DW_TAG_member)
    <776>   DW_AT_name        : CSR
    <77a>   DW_AT_decl_file   : 4
    <77b>   DW_AT_decl_line   : 629
    <77d>   DW_AT_decl_column : 17
    <77e>   DW_AT_type        : <0x4a8>
    <782>   DW_AT_data_member_location: 148
 <2><783>: Abbrev Number: 7 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0xcbb58): CRRCR
    <788>   DW_AT_decl_file   : 4
    <789>   DW_AT_decl_line   : 630
    <78b>   DW_AT_decl_column : 17
    <78c>   DW_AT_type        : <0x4a8>
    <790>   DW_AT_data_member_location: 152
 <2><791>: Abbrev Number: 0
 <1><792>: Abbrev Number: 11 (DW_TAG_typedef)
    <793>   DW_AT_name        : (indirect string, offset: 0xcbba8): RCC_TypeDef
    <797>   DW_AT_decl_file   : 4
    <798>   DW_AT_decl_line   : 631
    <79a>   DW_AT_decl_column : 3
    <79b>   DW_AT_type        : <0x566>
 <1><79f>: Abbrev Number: 2 (DW_TAG_base_type)
    <7a0>   DW_AT_byte_size   : 8
    <7a1>   DW_AT_encoding    : 4	(float)
    <7a2>   DW_AT_name        : (indirect string, offset: 0x12bef): long double
 <1><7a6>: Abbrev Number: 12 (DW_TAG_structure_type)
    <7a7>   DW_AT_byte_size   : 20
    <7a8>   DW_AT_decl_file   : 5
    <7a9>   DW_AT_decl_line   : 46
    <7aa>   DW_AT_decl_column : 9
    <7ab>   DW_AT_sibling     : <0x7f1>
 <2><7af>: Abbrev Number: 13 (DW_TAG_member)
    <7b0>   DW_AT_name        : Pin
    <7b4>   DW_AT_decl_file   : 5
    <7b5>   DW_AT_decl_line   : 48
    <7b6>   DW_AT_decl_column : 12
    <7b7>   DW_AT_type        : <0x49c>
    <7bb>   DW_AT_data_member_location: 0
 <2><7bc>: Abbrev Number: 14 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0xcf1ef): Mode
    <7c1>   DW_AT_decl_file   : 5
    <7c2>   DW_AT_decl_line   : 51
    <7c3>   DW_AT_decl_column : 12
    <7c4>   DW_AT_type        : <0x49c>
    <7c8>   DW_AT_data_member_location: 4
 <2><7c9>: Abbrev Number: 14 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0xcbbbc): Pull
    <7ce>   DW_AT_decl_file   : 5
    <7cf>   DW_AT_decl_line   : 54
    <7d0>   DW_AT_decl_column : 12
    <7d1>   DW_AT_type        : <0x49c>
    <7d5>   DW_AT_data_member_location: 8
 <2><7d6>: Abbrev Number: 14 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xcbbc1): Speed
    <7db>   DW_AT_decl_file   : 5
    <7dc>   DW_AT_decl_line   : 57
    <7dd>   DW_AT_decl_column : 12
    <7de>   DW_AT_type        : <0x49c>
    <7e2>   DW_AT_data_member_location: 12
 <2><7e3>: Abbrev Number: 14 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xcbb94): Alternate
    <7e8>   DW_AT_decl_file   : 5
    <7e9>   DW_AT_decl_line   : 60
    <7ea>   DW_AT_decl_column : 12
    <7eb>   DW_AT_type        : <0x49c>
    <7ef>   DW_AT_data_member_location: 16
 <2><7f0>: Abbrev Number: 0
 <1><7f1>: Abbrev Number: 3 (DW_TAG_typedef)
    <7f2>   DW_AT_name        : (indirect string, offset: 0xcbc11): GPIO_InitTypeDef
    <7f6>   DW_AT_decl_file   : 5
    <7f7>   DW_AT_decl_line   : 62
    <7f8>   DW_AT_decl_column : 3
    <7f9>   DW_AT_type        : <0x7a6>
 <1><7fd>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <7fe>   DW_AT_encoding    : 7	(unsigned)
    <7ff>   DW_AT_byte_size   : 1
    <800>   DW_AT_type        : <0x439>
    <804>   DW_AT_decl_file   : 5
    <805>   DW_AT_decl_line   : 68
    <806>   DW_AT_decl_column : 1
    <807>   DW_AT_sibling     : <0x818>
 <2><80b>: Abbrev Number: 16 (DW_TAG_enumerator)
    <80c>   DW_AT_name        : (indirect string, offset: 0xcbb37): GPIO_PIN_RESET
    <810>   DW_AT_const_value : 0
 <2><811>: Abbrev Number: 16 (DW_TAG_enumerator)
    <812>   DW_AT_name        : (indirect string, offset: 0xcbae8): GPIO_PIN_SET
    <816>   DW_AT_const_value : 1
 <2><817>: Abbrev Number: 0
 <1><818>: Abbrev Number: 3 (DW_TAG_typedef)
    <819>   DW_AT_name        : (indirect string, offset: 0xcbcbc): GPIO_PinState
    <81d>   DW_AT_decl_file   : 5
    <81e>   DW_AT_decl_line   : 71
    <81f>   DW_AT_decl_column : 3
    <820>   DW_AT_type        : <0x7fd>
 <1><824>: Abbrev Number: 17 (DW_TAG_subprogram)
    <825>   DW_AT_external    : 1
    <825>   DW_AT_name        : (indirect string, offset: 0xcbbdb): HAL_GPIO_Init
    <829>   DW_AT_decl_file   : 5
    <82a>   DW_AT_decl_line   : 283
    <82c>   DW_AT_decl_column : 19
    <82d>   DW_AT_prototyped  : 1
    <82d>   DW_AT_declaration : 1
    <82d>   DW_AT_sibling     : <0x83c>
 <2><831>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <832>   DW_AT_type        : <0x83c>
 <2><836>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <837>   DW_AT_type        : <0x842>
 <2><83b>: Abbrev Number: 0
 <1><83c>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <83d>   DW_AT_byte_size   : 4
    <83e>   DW_AT_type        : <0x559>
 <1><842>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <843>   DW_AT_byte_size   : 4
    <844>   DW_AT_type        : <0x7f1>
 <1><848>: Abbrev Number: 17 (DW_TAG_subprogram)
    <849>   DW_AT_external    : 1
    <849>   DW_AT_name        : (indirect string, offset: 0xcbaf5): HAL_GPIO_WritePin
    <84d>   DW_AT_decl_file   : 5
    <84e>   DW_AT_decl_line   : 296
    <850>   DW_AT_decl_column : 19
    <851>   DW_AT_prototyped  : 1
    <851>   DW_AT_declaration : 1
    <851>   DW_AT_sibling     : <0x865>
 <2><855>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <856>   DW_AT_type        : <0x83c>
 <2><85a>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <85b>   DW_AT_type        : <0x490>
 <2><85f>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <860>   DW_AT_type        : <0x818>
 <2><864>: Abbrev Number: 0
 <1><865>: Abbrev Number: 20 (DW_TAG_subprogram)
    <866>   DW_AT_external    : 1
    <866>   DW_AT_name        : (indirect string, offset: 0xcbbef): MX_GPIO_Init
    <86a>   DW_AT_decl_file   : 1
    <86b>   DW_AT_decl_line   : 42
    <86c>   DW_AT_decl_column : 6
    <86d>   DW_AT_prototyped  : 1
    <86d>   DW_AT_low_pc      : 0x8000654
    <871>   DW_AT_high_pc     : 0x94
    <875>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <877>   DW_AT_GNU_all_tail_call_sites: 1
 <2><877>: Abbrev Number: 21 (DW_TAG_variable)
    <878>   DW_AT_name        : (indirect string, offset: 0xcbc2b): GPIO_InitStruct
    <87c>   DW_AT_decl_file   : 1
    <87d>   DW_AT_decl_line   : 45
    <87e>   DW_AT_decl_column : 20
    <87f>   DW_AT_type        : <0x7f1>
    <883>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><886>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <887>   DW_AT_low_pc      : 0x800066a
    <88b>   DW_AT_high_pc     : 0x18
    <88f>   DW_AT_sibling     : <0x8a3>
 <3><893>: Abbrev Number: 21 (DW_TAG_variable)
    <894>   DW_AT_name        : (indirect string, offset: 0xcbaa2): tmpreg
    <898>   DW_AT_decl_file   : 1
    <899>   DW_AT_decl_line   : 48
    <89a>   DW_AT_decl_column : 3
    <89b>   DW_AT_type        : <0x4a8>
    <89f>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><8a2>: Abbrev Number: 0
 <2><8a3>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <8a4>   DW_AT_low_pc      : 0x8000682
    <8a8>   DW_AT_high_pc     : 0x18
    <8ac>   DW_AT_sibling     : <0x8c0>
 <3><8b0>: Abbrev Number: 21 (DW_TAG_variable)
    <8b1>   DW_AT_name        : (indirect string, offset: 0xcbaa2): tmpreg
    <8b5>   DW_AT_decl_file   : 1
    <8b6>   DW_AT_decl_line   : 49
    <8b7>   DW_AT_decl_column : 3
    <8b8>   DW_AT_type        : <0x4a8>
    <8bc>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><8bf>: Abbrev Number: 0
 <2><8c0>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <8c1>   DW_AT_low_pc      : 0x800069a
    <8c5>   DW_AT_high_pc     : 0x18
 <3><8c9>: Abbrev Number: 21 (DW_TAG_variable)
    <8ca>   DW_AT_name        : (indirect string, offset: 0xcbaa2): tmpreg
    <8ce>   DW_AT_decl_file   : 1
    <8cf>   DW_AT_decl_line   : 50
    <8d0>   DW_AT_decl_column : 3
    <8d1>   DW_AT_type        : <0x4a8>
    <8d5>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><8d8>: Abbrev Number: 0
 <2><8d9>: Abbrev Number: 0
 <1><8da>: Abbrev Number: 0
  Compilation Unit @ offset 0x8db:
   Length:        0xc05 (32-bit)
   Version:       4
   Abbrev Offset: 0x2d0
   Pointer Size:  4
 <0><8e6>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <8e7>   DW_AT_producer    : (indirect string, offset: 0xc52e2): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <8eb>   DW_AT_language    : 12	(ANSI C99)
    <8ec>   DW_AT_name        : (indirect string, offset: 0xcc370): ../Core/Src/main.c
    <8f0>   DW_AT_comp_dir    : (indirect string, offset: 0xa6a37): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/TUT01/Debug
    <8f4>   DW_AT_ranges      : 0x28
    <8f8>   DW_AT_low_pc      : 0x0
    <8fc>   DW_AT_stmt_list   : 0x126d
    <900>   DW_AT_GNU_macros  : 0x2046c
 <1><904>: Abbrev Number: 2 (DW_TAG_base_type)
    <905>   DW_AT_byte_size   : 1
    <906>   DW_AT_encoding    : 6	(signed char)
    <907>   DW_AT_name        : (indirect string, offset: 0x66240): signed char
 <1><90b>: Abbrev Number: 2 (DW_TAG_base_type)
    <90c>   DW_AT_byte_size   : 1
    <90d>   DW_AT_encoding    : 8	(unsigned char)
    <90e>   DW_AT_name        : (indirect string, offset: 0xc3ef7): unsigned char
 <1><912>: Abbrev Number: 2 (DW_TAG_base_type)
    <913>   DW_AT_byte_size   : 2
    <914>   DW_AT_encoding    : 5	(signed)
    <915>   DW_AT_name        : (indirect string, offset: 0x9707a): short int
 <1><919>: Abbrev Number: 2 (DW_TAG_base_type)
    <91a>   DW_AT_byte_size   : 2
    <91b>   DW_AT_encoding    : 7	(unsigned)
    <91c>   DW_AT_name        : (indirect string, offset: 0xc25e9): short unsigned int
 <1><920>: Abbrev Number: 2 (DW_TAG_base_type)
    <921>   DW_AT_byte_size   : 4
    <922>   DW_AT_encoding    : 5	(signed)
    <923>   DW_AT_name        : (indirect string, offset: 0x1143e): long int
 <1><927>: Abbrev Number: 3 (DW_TAG_typedef)
    <928>   DW_AT_name        : (indirect string, offset: 0x81c0e): __uint32_t
    <92c>   DW_AT_decl_file   : 3
    <92d>   DW_AT_decl_line   : 79
    <92e>   DW_AT_decl_column : 25
    <92f>   DW_AT_type        : <0x933>
 <1><933>: Abbrev Number: 2 (DW_TAG_base_type)
    <934>   DW_AT_byte_size   : 4
    <935>   DW_AT_encoding    : 7	(unsigned)
    <936>   DW_AT_name        : (indirect string, offset: 0x4dc0a): long unsigned int
 <1><93a>: Abbrev Number: 2 (DW_TAG_base_type)
    <93b>   DW_AT_byte_size   : 8
    <93c>   DW_AT_encoding    : 5	(signed)
    <93d>   DW_AT_name        : (indirect string, offset: 0x5cdf9): long long int
 <1><941>: Abbrev Number: 2 (DW_TAG_base_type)
    <942>   DW_AT_byte_size   : 8
    <943>   DW_AT_encoding    : 7	(unsigned)
    <944>   DW_AT_name        : (indirect string, offset: 0x2a108): long long unsigned int
 <1><948>: Abbrev Number: 4 (DW_TAG_base_type)
    <949>   DW_AT_byte_size   : 4
    <94a>   DW_AT_encoding    : 5	(signed)
    <94b>   DW_AT_name        : int
 <1><94f>: Abbrev Number: 2 (DW_TAG_base_type)
    <950>   DW_AT_byte_size   : 4
    <951>   DW_AT_encoding    : 7	(unsigned)
    <952>   DW_AT_name        : (indirect string, offset: 0x10a01): unsigned int
 <1><956>: Abbrev Number: 3 (DW_TAG_typedef)
    <957>   DW_AT_name        : (indirect string, offset: 0x93741): uint32_t
    <95b>   DW_AT_decl_file   : 4
    <95c>   DW_AT_decl_line   : 48
    <95d>   DW_AT_decl_column : 20
    <95e>   DW_AT_type        : <0x927>
 <1><962>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <963>   DW_AT_type        : <0x956>
 <1><967>: Abbrev Number: 6 (DW_TAG_structure_type)
    <968>   DW_AT_byte_size   : 16
    <969>   DW_AT_decl_file   : 5
    <96a>   DW_AT_decl_line   : 360
    <96c>   DW_AT_decl_column : 9
    <96d>   DW_AT_sibling     : <0x9aa>
 <2><971>: Abbrev Number: 7 (DW_TAG_member)
    <972>   DW_AT_name        : CCR
    <976>   DW_AT_decl_file   : 5
    <977>   DW_AT_decl_line   : 362
    <979>   DW_AT_decl_column : 17
    <97a>   DW_AT_type        : <0x962>
    <97e>   DW_AT_data_member_location: 0
 <2><97f>: Abbrev Number: 8 (DW_TAG_member)
    <980>   DW_AT_name        : (indirect string, offset: 0xcbe68): CNDTR
    <984>   DW_AT_decl_file   : 5
    <985>   DW_AT_decl_line   : 363
    <987>   DW_AT_decl_column : 17
    <988>   DW_AT_type        : <0x962>
    <98c>   DW_AT_data_member_location: 4
 <2><98d>: Abbrev Number: 8 (DW_TAG_member)
    <98e>   DW_AT_name        : (indirect string, offset: 0xcc3ea): CPAR
    <992>   DW_AT_decl_file   : 5
    <993>   DW_AT_decl_line   : 364
    <995>   DW_AT_decl_column : 17
    <996>   DW_AT_type        : <0x962>
    <99a>   DW_AT_data_member_location: 8
 <2><99b>: Abbrev Number: 8 (DW_TAG_member)
    <99c>   DW_AT_name        : (indirect string, offset: 0xcc004): CMAR
    <9a0>   DW_AT_decl_file   : 5
    <9a1>   DW_AT_decl_line   : 365
    <9a3>   DW_AT_decl_column : 17
    <9a4>   DW_AT_type        : <0x962>
    <9a8>   DW_AT_data_member_location: 12
 <2><9a9>: Abbrev Number: 0
 <1><9aa>: Abbrev Number: 9 (DW_TAG_typedef)
    <9ab>   DW_AT_name        : (indirect string, offset: 0xcc3c3): DMA_Channel_TypeDef
    <9af>   DW_AT_decl_file   : 5
    <9b0>   DW_AT_decl_line   : 366
    <9b2>   DW_AT_decl_column : 3
    <9b3>   DW_AT_type        : <0x967>
 <1><9b7>: Abbrev Number: 6 (DW_TAG_structure_type)
    <9b8>   DW_AT_byte_size   : 8
    <9b9>   DW_AT_decl_file   : 5
    <9ba>   DW_AT_decl_line   : 368
    <9bc>   DW_AT_decl_column : 9
    <9bd>   DW_AT_sibling     : <0x9de>
 <2><9c1>: Abbrev Number: 7 (DW_TAG_member)
    <9c2>   DW_AT_name        : ISR
    <9c6>   DW_AT_decl_file   : 5
    <9c7>   DW_AT_decl_line   : 370
    <9c9>   DW_AT_decl_column : 17
    <9ca>   DW_AT_type        : <0x962>
    <9ce>   DW_AT_data_member_location: 0
 <2><9cf>: Abbrev Number: 8 (DW_TAG_member)
    <9d0>   DW_AT_name        : (indirect string, offset: 0xcc1ea): IFCR
    <9d4>   DW_AT_decl_file   : 5
    <9d5>   DW_AT_decl_line   : 371
    <9d7>   DW_AT_decl_column : 17
    <9d8>   DW_AT_type        : <0x962>
    <9dc>   DW_AT_data_member_location: 4
 <2><9dd>: Abbrev Number: 0
 <1><9de>: Abbrev Number: 9 (DW_TAG_typedef)
    <9df>   DW_AT_name        : (indirect string, offset: 0xcbecf): DMA_TypeDef
    <9e3>   DW_AT_decl_file   : 5
    <9e4>   DW_AT_decl_line   : 372
    <9e6>   DW_AT_decl_column : 3
    <9e7>   DW_AT_type        : <0x9b7>
 <1><9eb>: Abbrev Number: 6 (DW_TAG_structure_type)
    <9ec>   DW_AT_byte_size   : 156
    <9ed>   DW_AT_decl_file   : 5
    <9ee>   DW_AT_decl_line   : 590
    <9f0>   DW_AT_decl_column : 9
    <9f1>   DW_AT_sibling     : <0xc17>
 <2><9f5>: Abbrev Number: 7 (DW_TAG_member)
    <9f6>   DW_AT_name        : CR
    <9f9>   DW_AT_decl_file   : 5
    <9fa>   DW_AT_decl_line   : 592
    <9fc>   DW_AT_decl_column : 17
    <9fd>   DW_AT_type        : <0x962>
    <a01>   DW_AT_data_member_location: 0
 <2><a02>: Abbrev Number: 8 (DW_TAG_member)
    <a03>   DW_AT_name        : (indirect string, offset: 0xcbbfc): ICSCR
    <a07>   DW_AT_decl_file   : 5
    <a08>   DW_AT_decl_line   : 593
    <a0a>   DW_AT_decl_column : 17
    <a0b>   DW_AT_type        : <0x962>
    <a0f>   DW_AT_data_member_location: 4
 <2><a10>: Abbrev Number: 8 (DW_TAG_member)
    <a11>   DW_AT_name        : (indirect string, offset: 0xcbb6b): CFGR
    <a15>   DW_AT_decl_file   : 5
    <a16>   DW_AT_decl_line   : 594
    <a18>   DW_AT_decl_column : 17
    <a19>   DW_AT_type        : <0x962>
    <a1d>   DW_AT_data_member_location: 8
 <2><a1e>: Abbrev Number: 8 (DW_TAG_member)
    <a1f>   DW_AT_name        : (indirect string, offset: 0xcbc02): PLLCFGR
    <a23>   DW_AT_decl_file   : 5
    <a24>   DW_AT_decl_line   : 595
    <a26>   DW_AT_decl_column : 17
    <a27>   DW_AT_type        : <0x962>
    <a2b>   DW_AT_data_member_location: 12
 <2><a2c>: Abbrev Number: 8 (DW_TAG_member)
    <a2d>   DW_AT_name        : (indirect string, offset: 0xcbb64): PLLSAI1CFGR
    <a31>   DW_AT_decl_file   : 5
    <a32>   DW_AT_decl_line   : 596
    <a34>   DW_AT_decl_column : 17
    <a35>   DW_AT_type        : <0x962>
    <a39>   DW_AT_data_member_location: 16
 <2><a3a>: Abbrev Number: 8 (DW_TAG_member)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x7ac9f): RESERVED
    <a3f>   DW_AT_decl_file   : 5
    <a40>   DW_AT_decl_line   : 597
    <a42>   DW_AT_decl_column : 17
    <a43>   DW_AT_type        : <0x956>
    <a47>   DW_AT_data_member_location: 20
 <2><a48>: Abbrev Number: 8 (DW_TAG_member)
    <a49>   DW_AT_name        : (indirect string, offset: 0xcbaae): CIER
    <a4d>   DW_AT_decl_file   : 5
    <a4e>   DW_AT_decl_line   : 598
    <a50>   DW_AT_decl_column : 17
    <a51>   DW_AT_type        : <0x962>
    <a55>   DW_AT_data_member_location: 24
 <2><a56>: Abbrev Number: 8 (DW_TAG_member)
    <a57>   DW_AT_name        : (indirect string, offset: 0xcbab3): CIFR
    <a5b>   DW_AT_decl_file   : 5
    <a5c>   DW_AT_decl_line   : 599
    <a5e>   DW_AT_decl_column : 17
    <a5f>   DW_AT_type        : <0x962>
    <a63>   DW_AT_data_member_location: 28
 <2><a64>: Abbrev Number: 8 (DW_TAG_member)
    <a65>   DW_AT_name        : (indirect string, offset: 0xcbaa9): CICR
    <a69>   DW_AT_decl_file   : 5
    <a6a>   DW_AT_decl_line   : 600
    <a6c>   DW_AT_decl_column : 17
    <a6d>   DW_AT_type        : <0x962>
    <a71>   DW_AT_data_member_location: 32
 <2><a72>: Abbrev Number: 8 (DW_TAG_member)
    <a73>   DW_AT_name        : (indirect string, offset: 0xcbc73): RESERVED0
    <a77>   DW_AT_decl_file   : 5
    <a78>   DW_AT_decl_line   : 601
    <a7a>   DW_AT_decl_column : 17
    <a7b>   DW_AT_type        : <0x956>
    <a7f>   DW_AT_data_member_location: 36
 <2><a80>: Abbrev Number: 8 (DW_TAG_member)
    <a81>   DW_AT_name        : (indirect string, offset: 0xcbc22): AHB1RSTR
    <a85>   DW_AT_decl_file   : 5
    <a86>   DW_AT_decl_line   : 602
    <a88>   DW_AT_decl_column : 17
    <a89>   DW_AT_type        : <0x962>
    <a8d>   DW_AT_data_member_location: 40
 <2><a8e>: Abbrev Number: 8 (DW_TAG_member)
    <a8f>   DW_AT_name        : (indirect string, offset: 0xcbb07): AHB2RSTR
    <a93>   DW_AT_decl_file   : 5
    <a94>   DW_AT_decl_line   : 603
    <a96>   DW_AT_decl_column : 17
    <a97>   DW_AT_type        : <0x962>
    <a9b>   DW_AT_data_member_location: 44
 <2><a9c>: Abbrev Number: 8 (DW_TAG_member)
    <a9d>   DW_AT_name        : (indirect string, offset: 0xcbb83): AHB3RSTR
    <aa1>   DW_AT_decl_file   : 5
    <aa2>   DW_AT_decl_line   : 604
    <aa4>   DW_AT_decl_column : 17
    <aa5>   DW_AT_type        : <0x962>
    <aa9>   DW_AT_data_member_location: 48
 <2><aaa>: Abbrev Number: 8 (DW_TAG_member)
    <aab>   DW_AT_name        : (indirect string, offset: 0xcbc7d): RESERVED1
    <aaf>   DW_AT_decl_file   : 5
    <ab0>   DW_AT_decl_line   : 605
    <ab2>   DW_AT_decl_column : 17
    <ab3>   DW_AT_type        : <0x956>
    <ab7>   DW_AT_data_member_location: 52
 <2><ab8>: Abbrev Number: 8 (DW_TAG_member)
    <ab9>   DW_AT_name        : (indirect string, offset: 0xcbb23): APB1RSTR1
    <abd>   DW_AT_decl_file   : 5
    <abe>   DW_AT_decl_line   : 606
    <ac0>   DW_AT_decl_column : 17
    <ac1>   DW_AT_type        : <0x962>
    <ac5>   DW_AT_data_member_location: 56
 <2><ac6>: Abbrev Number: 8 (DW_TAG_member)
    <ac7>   DW_AT_name        : (indirect string, offset: 0xcbb2d): APB1RSTR2
    <acb>   DW_AT_decl_file   : 5
    <acc>   DW_AT_decl_line   : 607
    <ace>   DW_AT_decl_column : 17
    <acf>   DW_AT_type        : <0x962>
    <ad3>   DW_AT_data_member_location: 60
 <2><ad4>: Abbrev Number: 8 (DW_TAG_member)
    <ad5>   DW_AT_name        : (indirect string, offset: 0xcbb7a): APB2RSTR
    <ad9>   DW_AT_decl_file   : 5
    <ada>   DW_AT_decl_line   : 608
    <adc>   DW_AT_decl_column : 17
    <add>   DW_AT_type        : <0x962>
    <ae1>   DW_AT_data_member_location: 64
 <2><ae2>: Abbrev Number: 8 (DW_TAG_member)
    <ae3>   DW_AT_name        : (indirect string, offset: 0xcbc87): RESERVED2
    <ae7>   DW_AT_decl_file   : 5
    <ae8>   DW_AT_decl_line   : 609
    <aea>   DW_AT_decl_column : 17
    <aeb>   DW_AT_type        : <0x956>
    <aef>   DW_AT_data_member_location: 68
 <2><af0>: Abbrev Number: 8 (DW_TAG_member)
    <af1>   DW_AT_name        : (indirect string, offset: 0xcbae0): AHB1ENR
    <af5>   DW_AT_decl_file   : 5
    <af6>   DW_AT_decl_line   : 610
    <af8>   DW_AT_decl_column : 17
    <af9>   DW_AT_type        : <0x962>
    <afd>   DW_AT_data_member_location: 72
 <2><afe>: Abbrev Number: 8 (DW_TAG_member)
    <aff>   DW_AT_name        : (indirect string, offset: 0xcbb50): AHB2ENR
    <b03>   DW_AT_decl_file   : 5
    <b04>   DW_AT_decl_line   : 611
    <b06>   DW_AT_decl_column : 17
    <b07>   DW_AT_type        : <0x962>
    <b0b>   DW_AT_data_member_location: 76
 <2><b0c>: Abbrev Number: 8 (DW_TAG_member)
    <b0d>   DW_AT_name        : (indirect string, offset: 0xcbb8c): AHB3ENR
    <b11>   DW_AT_decl_file   : 5
    <b12>   DW_AT_decl_line   : 612
    <b14>   DW_AT_decl_column : 17
    <b15>   DW_AT_type        : <0x962>
    <b19>   DW_AT_data_member_location: 80
 <2><b1a>: Abbrev Number: 8 (DW_TAG_member)
    <b1b>   DW_AT_name        : (indirect string, offset: 0xcbc91): RESERVED3
    <b1f>   DW_AT_decl_file   : 5
    <b20>   DW_AT_decl_line   : 613
    <b22>   DW_AT_decl_column : 17
    <b23>   DW_AT_type        : <0x956>
    <b27>   DW_AT_data_member_location: 84
 <2><b28>: Abbrev Number: 8 (DW_TAG_member)
    <b29>   DW_AT_name        : (indirect string, offset: 0xcbab8): APB1ENR1
    <b2d>   DW_AT_decl_file   : 5
    <b2e>   DW_AT_decl_line   : 614
    <b30>   DW_AT_decl_column : 17
    <b31>   DW_AT_type        : <0x962>
    <b35>   DW_AT_data_member_location: 88
 <2><b36>: Abbrev Number: 8 (DW_TAG_member)
    <b37>   DW_AT_name        : (indirect string, offset: 0xcbac1): APB1ENR2
    <b3b>   DW_AT_decl_file   : 5
    <b3c>   DW_AT_decl_line   : 615
    <b3e>   DW_AT_decl_column : 17
    <b3f>   DW_AT_type        : <0x962>
    <b43>   DW_AT_data_member_location: 92
 <2><b44>: Abbrev Number: 8 (DW_TAG_member)
    <b45>   DW_AT_name        : (indirect string, offset: 0xcbbb4): APB2ENR
    <b49>   DW_AT_decl_file   : 5
    <b4a>   DW_AT_decl_line   : 616
    <b4c>   DW_AT_decl_column : 17
    <b4d>   DW_AT_type        : <0x962>
    <b51>   DW_AT_data_member_location: 96
 <2><b52>: Abbrev Number: 8 (DW_TAG_member)
    <b53>   DW_AT_name        : (indirect string, offset: 0xcbbc7): RESERVED4
    <b57>   DW_AT_decl_file   : 5
    <b58>   DW_AT_decl_line   : 617
    <b5a>   DW_AT_decl_column : 17
    <b5b>   DW_AT_type        : <0x956>
    <b5f>   DW_AT_data_member_location: 100
 <2><b60>: Abbrev Number: 8 (DW_TAG_member)
    <b61>   DW_AT_name        : (indirect string, offset: 0xcbb9e): AHB1SMENR
    <b65>   DW_AT_decl_file   : 5
    <b66>   DW_AT_decl_line   : 618
    <b68>   DW_AT_decl_column : 17
    <b69>   DW_AT_type        : <0x962>
    <b6d>   DW_AT_data_member_location: 104
 <2><b6e>: Abbrev Number: 8 (DW_TAG_member)
    <b6f>   DW_AT_name        : (indirect string, offset: 0xcbc5d): AHB2SMENR
    <b73>   DW_AT_decl_file   : 5
    <b74>   DW_AT_decl_line   : 619
    <b76>   DW_AT_decl_column : 17
    <b77>   DW_AT_type        : <0x962>
    <b7b>   DW_AT_data_member_location: 108
 <2><b7c>: Abbrev Number: 8 (DW_TAG_member)
    <b7d>   DW_AT_name        : (indirect string, offset: 0xcbb70): AHB3SMENR
    <b81>   DW_AT_decl_file   : 5
    <b82>   DW_AT_decl_line   : 620
    <b84>   DW_AT_decl_column : 17
    <b85>   DW_AT_type        : <0x962>
    <b89>   DW_AT_data_member_location: 112
 <2><b8a>: Abbrev Number: 8 (DW_TAG_member)
    <b8b>   DW_AT_name        : (indirect string, offset: 0xcbc9b): RESERVED5
    <b8f>   DW_AT_decl_file   : 5
    <b90>   DW_AT_decl_line   : 621
    <b92>   DW_AT_decl_column : 17
    <b93>   DW_AT_type        : <0x956>
    <b97>   DW_AT_data_member_location: 116
 <2><b98>: Abbrev Number: 8 (DW_TAG_member)
    <b99>   DW_AT_name        : (indirect string, offset: 0xcbaca): APB1SMENR1
    <b9d>   DW_AT_decl_file   : 5
    <b9e>   DW_AT_decl_line   : 622
    <ba0>   DW_AT_decl_column : 17
    <ba1>   DW_AT_type        : <0x962>
    <ba5>   DW_AT_data_member_location: 120
 <2><ba6>: Abbrev Number: 8 (DW_TAG_member)
    <ba7>   DW_AT_name        : (indirect string, offset: 0xcbad5): APB1SMENR2
    <bab>   DW_AT_decl_file   : 5
    <bac>   DW_AT_decl_line   : 623
    <bae>   DW_AT_decl_column : 17
    <baf>   DW_AT_type        : <0x962>
    <bb3>   DW_AT_data_member_location: 124
 <2><bb4>: Abbrev Number: 8 (DW_TAG_member)
    <bb5>   DW_AT_name        : (indirect string, offset: 0xcbc3b): APB2SMENR
    <bb9>   DW_AT_decl_file   : 5
    <bba>   DW_AT_decl_line   : 624
    <bbc>   DW_AT_decl_column : 17
    <bbd>   DW_AT_type        : <0x962>
    <bc1>   DW_AT_data_member_location: 128
 <2><bc2>: Abbrev Number: 8 (DW_TAG_member)
    <bc3>   DW_AT_name        : (indirect string, offset: 0xcbbd1): RESERVED6
    <bc7>   DW_AT_decl_file   : 5
    <bc8>   DW_AT_decl_line   : 625
    <bca>   DW_AT_decl_column : 17
    <bcb>   DW_AT_type        : <0x956>
    <bcf>   DW_AT_data_member_location: 132
 <2><bd0>: Abbrev Number: 8 (DW_TAG_member)
    <bd1>   DW_AT_name        : (indirect string, offset: 0xcbb5e): CCIPR
    <bd5>   DW_AT_decl_file   : 5
    <bd6>   DW_AT_decl_line   : 626
    <bd8>   DW_AT_decl_column : 17
    <bd9>   DW_AT_type        : <0x962>
    <bdd>   DW_AT_data_member_location: 136
 <2><bde>: Abbrev Number: 8 (DW_TAG_member)
    <bdf>   DW_AT_name        : (indirect string, offset: 0xcbca5): RESERVED7
    <be3>   DW_AT_decl_file   : 5
    <be4>   DW_AT_decl_line   : 627
    <be6>   DW_AT_decl_column : 17
    <be7>   DW_AT_type        : <0x956>
    <beb>   DW_AT_data_member_location: 140
 <2><bec>: Abbrev Number: 8 (DW_TAG_member)
    <bed>   DW_AT_name        : (indirect string, offset: 0xcbb4b): BDCR
    <bf1>   DW_AT_decl_file   : 5
    <bf2>   DW_AT_decl_line   : 628
    <bf4>   DW_AT_decl_column : 17
    <bf5>   DW_AT_type        : <0x962>
    <bf9>   DW_AT_data_member_location: 144
 <2><bfa>: Abbrev Number: 7 (DW_TAG_member)
    <bfb>   DW_AT_name        : CSR
    <bff>   DW_AT_decl_file   : 5
    <c00>   DW_AT_decl_line   : 629
    <c02>   DW_AT_decl_column : 17
    <c03>   DW_AT_type        : <0x962>
    <c07>   DW_AT_data_member_location: 148
 <2><c08>: Abbrev Number: 8 (DW_TAG_member)
    <c09>   DW_AT_name        : (indirect string, offset: 0xcbb58): CRRCR
    <c0d>   DW_AT_decl_file   : 5
    <c0e>   DW_AT_decl_line   : 630
    <c10>   DW_AT_decl_column : 17
    <c11>   DW_AT_type        : <0x962>
    <c15>   DW_AT_data_member_location: 152
 <2><c16>: Abbrev Number: 0
 <1><c17>: Abbrev Number: 9 (DW_TAG_typedef)
    <c18>   DW_AT_name        : (indirect string, offset: 0xcbba8): RCC_TypeDef
    <c1c>   DW_AT_decl_file   : 5
    <c1d>   DW_AT_decl_line   : 631
    <c1f>   DW_AT_decl_column : 3
    <c20>   DW_AT_type        : <0x9eb>
 <1><c24>: Abbrev Number: 6 (DW_TAG_structure_type)
    <c25>   DW_AT_byte_size   : 104
    <c26>   DW_AT_decl_file   : 5
    <c27>   DW_AT_decl_line   : 770
    <c29>   DW_AT_decl_column : 9
    <c2a>   DW_AT_sibling     : <0xd9a>
 <2><c2e>: Abbrev Number: 7 (DW_TAG_member)
    <c2f>   DW_AT_name        : CR1
    <c33>   DW_AT_decl_file   : 5
    <c34>   DW_AT_decl_line   : 772
    <c36>   DW_AT_decl_column : 17
    <c37>   DW_AT_type        : <0x962>
    <c3b>   DW_AT_data_member_location: 0
 <2><c3c>: Abbrev Number: 7 (DW_TAG_member)
    <c3d>   DW_AT_name        : CR2
    <c41>   DW_AT_decl_file   : 5
    <c42>   DW_AT_decl_line   : 773
    <c44>   DW_AT_decl_column : 17
    <c45>   DW_AT_type        : <0x962>
    <c49>   DW_AT_data_member_location: 4
 <2><c4a>: Abbrev Number: 8 (DW_TAG_member)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x543a): SMCR
    <c4f>   DW_AT_decl_file   : 5
    <c50>   DW_AT_decl_line   : 774
    <c52>   DW_AT_decl_column : 17
    <c53>   DW_AT_type        : <0x962>
    <c57>   DW_AT_data_member_location: 8
 <2><c58>: Abbrev Number: 8 (DW_TAG_member)
    <c59>   DW_AT_name        : (indirect string, offset: 0x41007): DIER
    <c5d>   DW_AT_decl_file   : 5
    <c5e>   DW_AT_decl_line   : 775
    <c60>   DW_AT_decl_column : 17
    <c61>   DW_AT_type        : <0x962>
    <c65>   DW_AT_data_member_location: 12
 <2><c66>: Abbrev Number: 7 (DW_TAG_member)
    <c67>   DW_AT_name        : SR
    <c6a>   DW_AT_decl_file   : 5
    <c6b>   DW_AT_decl_line   : 776
    <c6d>   DW_AT_decl_column : 17
    <c6e>   DW_AT_type        : <0x962>
    <c72>   DW_AT_data_member_location: 16
 <2><c73>: Abbrev Number: 7 (DW_TAG_member)
    <c74>   DW_AT_name        : EGR
    <c78>   DW_AT_decl_file   : 5
    <c79>   DW_AT_decl_line   : 777
    <c7b>   DW_AT_decl_column : 17
    <c7c>   DW_AT_type        : <0x962>
    <c80>   DW_AT_data_member_location: 20
 <2><c81>: Abbrev Number: 8 (DW_TAG_member)
    <c82>   DW_AT_name        : (indirect string, offset: 0x270d7): CCMR1
    <c86>   DW_AT_decl_file   : 5
    <c87>   DW_AT_decl_line   : 778
    <c89>   DW_AT_decl_column : 17
    <c8a>   DW_AT_type        : <0x962>
    <c8e>   DW_AT_data_member_location: 24
 <2><c8f>: Abbrev Number: 8 (DW_TAG_member)
    <c90>   DW_AT_name        : (indirect string, offset: 0x512bd): CCMR2
    <c94>   DW_AT_decl_file   : 5
    <c95>   DW_AT_decl_line   : 779
    <c97>   DW_AT_decl_column : 17
    <c98>   DW_AT_type        : <0x962>
    <c9c>   DW_AT_data_member_location: 28
 <2><c9d>: Abbrev Number: 8 (DW_TAG_member)
    <c9e>   DW_AT_name        : (indirect string, offset: 0x30d09): CCER
    <ca2>   DW_AT_decl_file   : 5
    <ca3>   DW_AT_decl_line   : 780
    <ca5>   DW_AT_decl_column : 17
    <ca6>   DW_AT_type        : <0x962>
    <caa>   DW_AT_data_member_location: 32
 <2><cab>: Abbrev Number: 7 (DW_TAG_member)
    <cac>   DW_AT_name        : CNT
    <cb0>   DW_AT_decl_file   : 5
    <cb1>   DW_AT_decl_line   : 781
    <cb3>   DW_AT_decl_column : 17
    <cb4>   DW_AT_type        : <0x962>
    <cb8>   DW_AT_data_member_location: 36
 <2><cb9>: Abbrev Number: 7 (DW_TAG_member)
    <cba>   DW_AT_name        : PSC
    <cbe>   DW_AT_decl_file   : 5
    <cbf>   DW_AT_decl_line   : 782
    <cc1>   DW_AT_decl_column : 17
    <cc2>   DW_AT_type        : <0x962>
    <cc6>   DW_AT_data_member_location: 40
 <2><cc7>: Abbrev Number: 7 (DW_TAG_member)
    <cc8>   DW_AT_name        : ARR
    <ccc>   DW_AT_decl_file   : 5
    <ccd>   DW_AT_decl_line   : 783
    <ccf>   DW_AT_decl_column : 17
    <cd0>   DW_AT_type        : <0x962>
    <cd4>   DW_AT_data_member_location: 44
 <2><cd5>: Abbrev Number: 7 (DW_TAG_member)
    <cd6>   DW_AT_name        : RCR
    <cda>   DW_AT_decl_file   : 5
    <cdb>   DW_AT_decl_line   : 784
    <cdd>   DW_AT_decl_column : 17
    <cde>   DW_AT_type        : <0x962>
    <ce2>   DW_AT_data_member_location: 48
 <2><ce3>: Abbrev Number: 8 (DW_TAG_member)
    <ce4>   DW_AT_name        : (indirect string, offset: 0x18270): CCR1
    <ce8>   DW_AT_decl_file   : 5
    <ce9>   DW_AT_decl_line   : 785
    <ceb>   DW_AT_decl_column : 17
    <cec>   DW_AT_type        : <0x962>
    <cf0>   DW_AT_data_member_location: 52
 <2><cf1>: Abbrev Number: 8 (DW_TAG_member)
    <cf2>   DW_AT_name        : (indirect string, offset: 0x551ad): CCR2
    <cf6>   DW_AT_decl_file   : 5
    <cf7>   DW_AT_decl_line   : 786
    <cf9>   DW_AT_decl_column : 17
    <cfa>   DW_AT_type        : <0x962>
    <cfe>   DW_AT_data_member_location: 56
 <2><cff>: Abbrev Number: 8 (DW_TAG_member)
    <d00>   DW_AT_name        : (indirect string, offset: 0x39778): CCR3
    <d04>   DW_AT_decl_file   : 5
    <d05>   DW_AT_decl_line   : 787
    <d07>   DW_AT_decl_column : 17
    <d08>   DW_AT_type        : <0x962>
    <d0c>   DW_AT_data_member_location: 60
 <2><d0d>: Abbrev Number: 8 (DW_TAG_member)
    <d0e>   DW_AT_name        : (indirect string, offset: 0xce22): CCR4
    <d12>   DW_AT_decl_file   : 5
    <d13>   DW_AT_decl_line   : 788
    <d15>   DW_AT_decl_column : 17
    <d16>   DW_AT_type        : <0x962>
    <d1a>   DW_AT_data_member_location: 64
 <2><d1b>: Abbrev Number: 8 (DW_TAG_member)
    <d1c>   DW_AT_name        : (indirect string, offset: 0x5db23): BDTR
    <d20>   DW_AT_decl_file   : 5
    <d21>   DW_AT_decl_line   : 789
    <d23>   DW_AT_decl_column : 17
    <d24>   DW_AT_type        : <0x962>
    <d28>   DW_AT_data_member_location: 68
 <2><d29>: Abbrev Number: 7 (DW_TAG_member)
    <d2a>   DW_AT_name        : DCR
    <d2e>   DW_AT_decl_file   : 5
    <d2f>   DW_AT_decl_line   : 790
    <d31>   DW_AT_decl_column : 17
    <d32>   DW_AT_type        : <0x962>
    <d36>   DW_AT_data_member_location: 72
 <2><d37>: Abbrev Number: 8 (DW_TAG_member)
    <d38>   DW_AT_name        : (indirect string, offset: 0x969c2): DMAR
    <d3c>   DW_AT_decl_file   : 5
    <d3d>   DW_AT_decl_line   : 791
    <d3f>   DW_AT_decl_column : 17
    <d40>   DW_AT_type        : <0x962>
    <d44>   DW_AT_data_member_location: 76
 <2><d45>: Abbrev Number: 7 (DW_TAG_member)
    <d46>   DW_AT_name        : OR1
    <d4a>   DW_AT_decl_file   : 5
    <d4b>   DW_AT_decl_line   : 792
    <d4d>   DW_AT_decl_column : 17
    <d4e>   DW_AT_type        : <0x962>
    <d52>   DW_AT_data_member_location: 80
 <2><d53>: Abbrev Number: 8 (DW_TAG_member)
    <d54>   DW_AT_name        : (indirect string, offset: 0xb4bb7): CCMR3
    <d58>   DW_AT_decl_file   : 5
    <d59>   DW_AT_decl_line   : 793
    <d5b>   DW_AT_decl_column : 17
    <d5c>   DW_AT_type        : <0x962>
    <d60>   DW_AT_data_member_location: 84
 <2><d61>: Abbrev Number: 8 (DW_TAG_member)
    <d62>   DW_AT_name        : (indirect string, offset: 0x23cbb): CCR5
    <d66>   DW_AT_decl_file   : 5
    <d67>   DW_AT_decl_line   : 794
    <d69>   DW_AT_decl_column : 17
    <d6a>   DW_AT_type        : <0x962>
    <d6e>   DW_AT_data_member_location: 88
 <2><d6f>: Abbrev Number: 8 (DW_TAG_member)
    <d70>   DW_AT_name        : (indirect string, offset: 0x8fb28): CCR6
    <d74>   DW_AT_decl_file   : 5
    <d75>   DW_AT_decl_line   : 795
    <d77>   DW_AT_decl_column : 17
    <d78>   DW_AT_type        : <0x962>
    <d7c>   DW_AT_data_member_location: 92
 <2><d7d>: Abbrev Number: 7 (DW_TAG_member)
    <d7e>   DW_AT_name        : OR2
    <d82>   DW_AT_decl_file   : 5
    <d83>   DW_AT_decl_line   : 796
    <d85>   DW_AT_decl_column : 17
    <d86>   DW_AT_type        : <0x962>
    <d8a>   DW_AT_data_member_location: 96
 <2><d8b>: Abbrev Number: 7 (DW_TAG_member)
    <d8c>   DW_AT_name        : OR3
    <d90>   DW_AT_decl_file   : 5
    <d91>   DW_AT_decl_line   : 797
    <d93>   DW_AT_decl_column : 17
    <d94>   DW_AT_type        : <0x962>
    <d98>   DW_AT_data_member_location: 100
 <2><d99>: Abbrev Number: 0
 <1><d9a>: Abbrev Number: 9 (DW_TAG_typedef)
    <d9b>   DW_AT_name        : (indirect string, offset: 0xcc3d7): TIM_TypeDef
    <d9f>   DW_AT_decl_file   : 5
    <da0>   DW_AT_decl_line   : 798
    <da2>   DW_AT_decl_column : 3
    <da3>   DW_AT_type        : <0xc24>
 <1><da7>: Abbrev Number: 2 (DW_TAG_base_type)
    <da8>   DW_AT_byte_size   : 8
    <da9>   DW_AT_encoding    : 4	(float)
    <daa>   DW_AT_name        : (indirect string, offset: 0x12bef): long double
 <1><dae>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <daf>   DW_AT_encoding    : 7	(unsigned)
    <db0>   DW_AT_byte_size   : 1
    <db1>   DW_AT_type        : <0x90b>
    <db5>   DW_AT_decl_file   : 6
    <db6>   DW_AT_decl_line   : 39
    <db7>   DW_AT_decl_column : 1
    <db8>   DW_AT_sibling     : <0xdd5>
 <2><dbc>: Abbrev Number: 11 (DW_TAG_enumerator)
    <dbd>   DW_AT_name        : (indirect string, offset: 0xcbe9f): HAL_OK
    <dc1>   DW_AT_const_value : 0
 <2><dc2>: Abbrev Number: 11 (DW_TAG_enumerator)
    <dc3>   DW_AT_name        : (indirect string, offset: 0xcc109): HAL_ERROR
    <dc7>   DW_AT_const_value : 1
 <2><dc8>: Abbrev Number: 11 (DW_TAG_enumerator)
    <dc9>   DW_AT_name        : (indirect string, offset: 0xcbdb2): HAL_BUSY
    <dcd>   DW_AT_const_value : 2
 <2><dce>: Abbrev Number: 11 (DW_TAG_enumerator)
    <dcf>   DW_AT_name        : (indirect string, offset: 0xcbe5c): HAL_TIMEOUT
    <dd3>   DW_AT_const_value : 3
 <2><dd4>: Abbrev Number: 0
 <1><dd5>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd6>   DW_AT_name        : (indirect string, offset: 0xcbcca): HAL_StatusTypeDef
    <dda>   DW_AT_decl_file   : 6
    <ddb>   DW_AT_decl_line   : 44
    <ddc>   DW_AT_decl_column : 3
    <ddd>   DW_AT_type        : <0xdae>
 <1><de1>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <de2>   DW_AT_encoding    : 7	(unsigned)
    <de3>   DW_AT_byte_size   : 1
    <de4>   DW_AT_type        : <0x90b>
    <de8>   DW_AT_decl_file   : 6
    <de9>   DW_AT_decl_line   : 50
    <dea>   DW_AT_decl_column : 1
    <deb>   DW_AT_sibling     : <0xdfc>
 <2><def>: Abbrev Number: 11 (DW_TAG_enumerator)
    <df0>   DW_AT_name        : (indirect string, offset: 0xcc20c): HAL_UNLOCKED
    <df4>   DW_AT_const_value : 0
 <2><df5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <df6>   DW_AT_name        : (indirect string, offset: 0xcc420): HAL_LOCKED
    <dfa>   DW_AT_const_value : 1
 <2><dfb>: Abbrev Number: 0
 <1><dfc>: Abbrev Number: 3 (DW_TAG_typedef)
    <dfd>   DW_AT_name        : (indirect string, offset: 0xcc0c0): HAL_LockTypeDef
    <e01>   DW_AT_decl_file   : 6
    <e02>   DW_AT_decl_line   : 53
    <e03>   DW_AT_decl_column : 3
    <e04>   DW_AT_type        : <0xde1>
 <1><e08>: Abbrev Number: 12 (DW_TAG_structure_type)
    <e09>   DW_AT_byte_size   : 28
    <e0a>   DW_AT_decl_file   : 7
    <e0b>   DW_AT_decl_line   : 45
    <e0c>   DW_AT_decl_column : 9
    <e0d>   DW_AT_sibling     : <0xe6d>
 <2><e11>: Abbrev Number: 13 (DW_TAG_member)
    <e12>   DW_AT_name        : (indirect string, offset: 0xcc196): PLLState
    <e16>   DW_AT_decl_file   : 7
    <e17>   DW_AT_decl_line   : 47
    <e18>   DW_AT_decl_column : 12
    <e19>   DW_AT_type        : <0x956>
    <e1d>   DW_AT_data_member_location: 0
 <2><e1e>: Abbrev Number: 13 (DW_TAG_member)
    <e1f>   DW_AT_name        : (indirect string, offset: 0xcc1e0): PLLSource
    <e23>   DW_AT_decl_file   : 7
    <e24>   DW_AT_decl_line   : 50
    <e25>   DW_AT_decl_column : 12
    <e26>   DW_AT_type        : <0x956>
    <e2a>   DW_AT_data_member_location: 4
 <2><e2b>: Abbrev Number: 13 (DW_TAG_member)
    <e2c>   DW_AT_name        : (indirect string, offset: 0xcc157): PLLM
    <e30>   DW_AT_decl_file   : 7
    <e31>   DW_AT_decl_line   : 53
    <e32>   DW_AT_decl_column : 12
    <e33>   DW_AT_type        : <0x956>
    <e37>   DW_AT_data_member_location: 8
 <2><e38>: Abbrev Number: 13 (DW_TAG_member)
    <e39>   DW_AT_name        : (indirect string, offset: 0xcc2c2): PLLN
    <e3d>   DW_AT_decl_file   : 7
    <e3e>   DW_AT_decl_line   : 57
    <e3f>   DW_AT_decl_column : 12
    <e40>   DW_AT_type        : <0x956>
    <e44>   DW_AT_data_member_location: 12
 <2><e45>: Abbrev Number: 13 (DW_TAG_member)
    <e46>   DW_AT_name        : (indirect string, offset: 0xcbd84): PLLP
    <e4a>   DW_AT_decl_file   : 7
    <e4b>   DW_AT_decl_line   : 61
    <e4c>   DW_AT_decl_column : 12
    <e4d>   DW_AT_type        : <0x956>
    <e51>   DW_AT_data_member_location: 16
 <2><e52>: Abbrev Number: 13 (DW_TAG_member)
    <e53>   DW_AT_name        : (indirect string, offset: 0x4b607): PLLQ
    <e57>   DW_AT_decl_file   : 7
    <e58>   DW_AT_decl_line   : 65
    <e59>   DW_AT_decl_column : 12
    <e5a>   DW_AT_type        : <0x956>
    <e5e>   DW_AT_data_member_location: 20
 <2><e5f>: Abbrev Number: 13 (DW_TAG_member)
    <e60>   DW_AT_name        : (indirect string, offset: 0xcc2c7): PLLR
    <e64>   DW_AT_decl_file   : 7
    <e65>   DW_AT_decl_line   : 68
    <e66>   DW_AT_decl_column : 12
    <e67>   DW_AT_type        : <0x956>
    <e6b>   DW_AT_data_member_location: 24
 <2><e6c>: Abbrev Number: 0
 <1><e6d>: Abbrev Number: 3 (DW_TAG_typedef)
    <e6e>   DW_AT_name        : (indirect string, offset: 0xcc0e2): RCC_PLLInitTypeDef
    <e72>   DW_AT_decl_file   : 7
    <e73>   DW_AT_decl_line   : 73
    <e74>   DW_AT_decl_column : 2
    <e75>   DW_AT_type        : <0xe08>
 <1><e79>: Abbrev Number: 12 (DW_TAG_structure_type)
    <e7a>   DW_AT_byte_size   : 68
    <e7b>   DW_AT_decl_file   : 7
    <e7c>   DW_AT_decl_line   : 78
    <e7d>   DW_AT_decl_column : 9
    <e7e>   DW_AT_sibling     : <0xf12>
 <2><e82>: Abbrev Number: 13 (DW_TAG_member)
    <e83>   DW_AT_name        : (indirect string, offset: 0xcc288): OscillatorType
    <e87>   DW_AT_decl_file   : 7
    <e88>   DW_AT_decl_line   : 80
    <e89>   DW_AT_decl_column : 12
    <e8a>   DW_AT_type        : <0x956>
    <e8e>   DW_AT_data_member_location: 0
 <2><e8f>: Abbrev Number: 13 (DW_TAG_member)
    <e90>   DW_AT_name        : (indirect string, offset: 0xcc19f): HSEState
    <e94>   DW_AT_decl_file   : 7
    <e95>   DW_AT_decl_line   : 83
    <e96>   DW_AT_decl_column : 12
    <e97>   DW_AT_type        : <0x956>
    <e9b>   DW_AT_data_member_location: 4
 <2><e9c>: Abbrev Number: 13 (DW_TAG_member)
    <e9d>   DW_AT_name        : (indirect string, offset: 0xcc113): LSEState
    <ea1>   DW_AT_decl_file   : 7
    <ea2>   DW_AT_decl_line   : 86
    <ea3>   DW_AT_decl_column : 12
    <ea4>   DW_AT_type        : <0x956>
    <ea8>   DW_AT_data_member_location: 8
 <2><ea9>: Abbrev Number: 13 (DW_TAG_member)
    <eaa>   DW_AT_name        : (indirect string, offset: 0xcbf54): HSIState
    <eae>   DW_AT_decl_file   : 7
    <eaf>   DW_AT_decl_line   : 89
    <eb0>   DW_AT_decl_column : 12
    <eb1>   DW_AT_type        : <0x956>
    <eb5>   DW_AT_data_member_location: 12
 <2><eb6>: Abbrev Number: 13 (DW_TAG_member)
    <eb7>   DW_AT_name        : (indirect string, offset: 0xcc35c): HSICalibrationValue
    <ebb>   DW_AT_decl_file   : 7
    <ebc>   DW_AT_decl_line   : 92
    <ebd>   DW_AT_decl_column : 12
    <ebe>   DW_AT_type        : <0x956>
    <ec2>   DW_AT_data_member_location: 16
 <2><ec3>: Abbrev Number: 13 (DW_TAG_member)
    <ec4>   DW_AT_name        : (indirect string, offset: 0xcbec6): LSIState
    <ec8>   DW_AT_decl_file   : 7
    <ec9>   DW_AT_decl_line   : 98
    <eca>   DW_AT_decl_column : 12
    <ecb>   DW_AT_type        : <0x956>
    <ecf>   DW_AT_data_member_location: 20
 <2><ed0>: Abbrev Number: 13 (DW_TAG_member)
    <ed1>   DW_AT_name        : (indirect string, offset: 0xcbea6): MSIState
    <ed5>   DW_AT_decl_file   : 7
    <ed6>   DW_AT_decl_line   : 106
    <ed7>   DW_AT_decl_column : 12
    <ed8>   DW_AT_type        : <0x956>
    <edc>   DW_AT_data_member_location: 24
 <2><edd>: Abbrev Number: 13 (DW_TAG_member)
    <ede>   DW_AT_name        : (indirect string, offset: 0xcbe6e): MSICalibrationValue
    <ee2>   DW_AT_decl_file   : 7
    <ee3>   DW_AT_decl_line   : 109
    <ee4>   DW_AT_decl_column : 12
    <ee5>   DW_AT_type        : <0x956>
    <ee9>   DW_AT_data_member_location: 28
 <2><eea>: Abbrev Number: 13 (DW_TAG_member)
    <eeb>   DW_AT_name        : (indirect string, offset: 0xcbfa5): MSIClockRange
    <eef>   DW_AT_decl_file   : 7
    <ef0>   DW_AT_decl_line   : 112
    <ef1>   DW_AT_decl_column : 12
    <ef2>   DW_AT_type        : <0x956>
    <ef6>   DW_AT_data_member_location: 32
 <2><ef7>: Abbrev Number: 13 (DW_TAG_member)
    <ef8>   DW_AT_name        : (indirect string, offset: 0xcc201): HSI48State
    <efc>   DW_AT_decl_file   : 7
    <efd>   DW_AT_decl_line   : 115
    <efe>   DW_AT_decl_column : 12
    <eff>   DW_AT_type        : <0x956>
    <f03>   DW_AT_data_member_location: 36
 <2><f04>: Abbrev Number: 14 (DW_TAG_member)
    <f05>   DW_AT_name        : PLL
    <f09>   DW_AT_decl_file   : 7
    <f0a>   DW_AT_decl_line   : 118
    <f0b>   DW_AT_decl_column : 22
    <f0c>   DW_AT_type        : <0xe6d>
    <f10>   DW_AT_data_member_location: 40
 <2><f11>: Abbrev Number: 0
 <1><f12>: Abbrev Number: 3 (DW_TAG_typedef)
    <f13>   DW_AT_name        : (indirect string, offset: 0xcbfc9): RCC_OscInitTypeDef
    <f17>   DW_AT_decl_file   : 7
    <f18>   DW_AT_decl_line   : 120
    <f19>   DW_AT_decl_column : 2
    <f1a>   DW_AT_type        : <0xe79>
 <1><f1e>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f1f>   DW_AT_byte_size   : 20
    <f20>   DW_AT_decl_file   : 7
    <f21>   DW_AT_decl_line   : 125
    <f22>   DW_AT_decl_column : 9
    <f23>   DW_AT_sibling     : <0xf69>
 <2><f27>: Abbrev Number: 13 (DW_TAG_member)
    <f28>   DW_AT_name        : (indirect string, offset: 0xcbe82): ClockType
    <f2c>   DW_AT_decl_file   : 7
    <f2d>   DW_AT_decl_line   : 127
    <f2e>   DW_AT_decl_column : 12
    <f2f>   DW_AT_type        : <0x956>
    <f33>   DW_AT_data_member_location: 0
 <2><f34>: Abbrev Number: 13 (DW_TAG_member)
    <f35>   DW_AT_name        : (indirect string, offset: 0xcc0d5): SYSCLKSource
    <f39>   DW_AT_decl_file   : 7
    <f3a>   DW_AT_decl_line   : 130
    <f3b>   DW_AT_decl_column : 12
    <f3c>   DW_AT_type        : <0x956>
    <f40>   DW_AT_data_member_location: 4
 <2><f41>: Abbrev Number: 13 (DW_TAG_member)
    <f42>   DW_AT_name        : (indirect string, offset: 0xcc2b4): AHBCLKDivider
    <f46>   DW_AT_decl_file   : 7
    <f47>   DW_AT_decl_line   : 133
    <f48>   DW_AT_decl_column : 12
    <f49>   DW_AT_type        : <0x956>
    <f4d>   DW_AT_data_member_location: 8
 <2><f4e>: Abbrev Number: 13 (DW_TAG_member)
    <f4f>   DW_AT_name        : (indirect string, offset: 0xcbd0a): APB1CLKDivider
    <f53>   DW_AT_decl_file   : 7
    <f54>   DW_AT_decl_line   : 136
    <f55>   DW_AT_decl_column : 12
    <f56>   DW_AT_type        : <0x956>
    <f5a>   DW_AT_data_member_location: 12
 <2><f5b>: Abbrev Number: 13 (DW_TAG_member)
    <f5c>   DW_AT_name        : (indirect string, offset: 0xcbf5d): APB2CLKDivider
    <f60>   DW_AT_decl_file   : 7
    <f61>   DW_AT_decl_line   : 139
    <f62>   DW_AT_decl_column : 12
    <f63>   DW_AT_type        : <0x956>
    <f67>   DW_AT_data_member_location: 16
 <2><f68>: Abbrev Number: 0
 <1><f69>: Abbrev Number: 3 (DW_TAG_typedef)
    <f6a>   DW_AT_name        : (indirect string, offset: 0xcbe8c): RCC_ClkInitTypeDef
    <f6e>   DW_AT_decl_file   : 7
    <f6f>   DW_AT_decl_line   : 142
    <f70>   DW_AT_decl_column : 2
    <f71>   DW_AT_type        : <0xf1e>
 <1><f75>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f76>   DW_AT_byte_size   : 32
    <f77>   DW_AT_decl_file   : 8
    <f78>   DW_AT_decl_line   : 46
    <f79>   DW_AT_decl_column : 9
    <f7a>   DW_AT_sibling     : <0xfe7>
 <2><f7e>: Abbrev Number: 13 (DW_TAG_member)
    <f7f>   DW_AT_name        : (indirect string, offset: 0xcc383): Request
    <f83>   DW_AT_decl_file   : 8
    <f84>   DW_AT_decl_line   : 48
    <f85>   DW_AT_decl_column : 12
    <f86>   DW_AT_type        : <0x956>
    <f8a>   DW_AT_data_member_location: 0
 <2><f8b>: Abbrev Number: 13 (DW_TAG_member)
    <f8c>   DW_AT_name        : (indirect string, offset: 0xcfe88): Direction
    <f90>   DW_AT_decl_file   : 8
    <f91>   DW_AT_decl_line   : 51
    <f92>   DW_AT_decl_column : 12
    <f93>   DW_AT_type        : <0x956>
    <f97>   DW_AT_data_member_location: 4
 <2><f98>: Abbrev Number: 13 (DW_TAG_member)
    <f99>   DW_AT_name        : (indirect string, offset: 0xcbd63): PeriphInc
    <f9d>   DW_AT_decl_file   : 8
    <f9e>   DW_AT_decl_line   : 55
    <f9f>   DW_AT_decl_column : 12
    <fa0>   DW_AT_type        : <0x956>
    <fa4>   DW_AT_data_member_location: 8
 <2><fa5>: Abbrev Number: 13 (DW_TAG_member)
    <fa6>   DW_AT_name        : (indirect string, offset: 0xcbd9b): MemInc
    <faa>   DW_AT_decl_file   : 8
    <fab>   DW_AT_decl_line   : 58
    <fac>   DW_AT_decl_column : 12
    <fad>   DW_AT_type        : <0x956>
    <fb1>   DW_AT_data_member_location: 12
 <2><fb2>: Abbrev Number: 13 (DW_TAG_member)
    <fb3>   DW_AT_name        : (indirect string, offset: 0xcbf6c): PeriphDataAlignment
    <fb7>   DW_AT_decl_file   : 8
    <fb8>   DW_AT_decl_line   : 61
    <fb9>   DW_AT_decl_column : 12
    <fba>   DW_AT_type        : <0x956>
    <fbe>   DW_AT_data_member_location: 16
 <2><fbf>: Abbrev Number: 13 (DW_TAG_member)
    <fc0>   DW_AT_name        : (indirect string, offset: 0xcc38b): MemDataAlignment
    <fc4>   DW_AT_decl_file   : 8
    <fc5>   DW_AT_decl_line   : 64
    <fc6>   DW_AT_decl_column : 12
    <fc7>   DW_AT_type        : <0x956>
    <fcb>   DW_AT_data_member_location: 20
 <2><fcc>: Abbrev Number: 13 (DW_TAG_member)
    <fcd>   DW_AT_name        : (indirect string, offset: 0xcf1ef): Mode
    <fd1>   DW_AT_decl_file   : 8
    <fd2>   DW_AT_decl_line   : 67
    <fd3>   DW_AT_decl_column : 12
    <fd4>   DW_AT_type        : <0x956>
    <fd8>   DW_AT_data_member_location: 24
 <2><fd9>: Abbrev Number: 13 (DW_TAG_member)
    <fda>   DW_AT_name        : (indirect string, offset: 0xcecb1): Priority
    <fde>   DW_AT_decl_file   : 8
    <fdf>   DW_AT_decl_line   : 72
    <fe0>   DW_AT_decl_column : 12
    <fe1>   DW_AT_type        : <0x956>
    <fe5>   DW_AT_data_member_location: 28
 <2><fe6>: Abbrev Number: 0
 <1><fe7>: Abbrev Number: 3 (DW_TAG_typedef)
    <fe8>   DW_AT_name        : (indirect string, offset: 0xcbe2d): DMA_InitTypeDef
    <fec>   DW_AT_decl_file   : 8
    <fed>   DW_AT_decl_line   : 74
    <fee>   DW_AT_decl_column : 3
    <fef>   DW_AT_type        : <0xf75>
 <1><ff3>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <ff4>   DW_AT_encoding    : 7	(unsigned)
    <ff5>   DW_AT_byte_size   : 1
    <ff6>   DW_AT_type        : <0x90b>
    <ffa>   DW_AT_decl_file   : 8
    <ffb>   DW_AT_decl_line   : 80
    <ffc>   DW_AT_decl_column : 1
    <ffd>   DW_AT_sibling     : <0x101a>
 <2><1001>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1002>   DW_AT_name        : (indirect string, offset: 0xcc219): HAL_DMA_STATE_RESET
    <1006>   DW_AT_const_value : 0
 <2><1007>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1008>   DW_AT_name        : (indirect string, offset: 0xcbe48): HAL_DMA_STATE_READY
    <100c>   DW_AT_const_value : 1
 <2><100d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <100e>   DW_AT_name        : (indirect string, offset: 0xcc1cd): HAL_DMA_STATE_BUSY
    <1012>   DW_AT_const_value : 2
 <2><1013>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1014>   DW_AT_name        : (indirect string, offset: 0xcc3f9): HAL_DMA_STATE_TIMEOUT
    <1018>   DW_AT_const_value : 3
 <2><1019>: Abbrev Number: 0
 <1><101a>: Abbrev Number: 3 (DW_TAG_typedef)
    <101b>   DW_AT_name        : (indirect string, offset: 0xcc181): HAL_DMA_StateTypeDef
    <101f>   DW_AT_decl_file   : 8
    <1020>   DW_AT_decl_line   : 85
    <1021>   DW_AT_decl_column : 2
    <1022>   DW_AT_type        : <0xff3>
 <1><1026>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1027>   DW_AT_type        : <0x101a>
 <1><102b>: Abbrev Number: 15 (DW_TAG_structure_type)
    <102c>   DW_AT_name        : (indirect string, offset: 0xcc319): __DMA_HandleTypeDef
    <1030>   DW_AT_byte_size   : 72
    <1031>   DW_AT_decl_file   : 8
    <1032>   DW_AT_decl_line   : 112
    <1033>   DW_AT_decl_column : 16
    <1034>   DW_AT_sibling     : <0x10d5>
 <2><1038>: Abbrev Number: 13 (DW_TAG_member)
    <1039>   DW_AT_name        : (indirect string, offset: 0xcc297): Instance
    <103d>   DW_AT_decl_file   : 8
    <103e>   DW_AT_decl_line   : 114
    <103f>   DW_AT_decl_column : 27
    <1040>   DW_AT_type        : <0x10d5>
    <1044>   DW_AT_data_member_location: 0
 <2><1045>: Abbrev Number: 13 (DW_TAG_member)
    <1046>   DW_AT_name        : (indirect string, offset: 0xcfe7a): Init
    <104a>   DW_AT_decl_file   : 8
    <104b>   DW_AT_decl_line   : 116
    <104c>   DW_AT_decl_column : 25
    <104d>   DW_AT_type        : <0xfe7>
    <1051>   DW_AT_data_member_location: 4
 <2><1052>: Abbrev Number: 13 (DW_TAG_member)
    <1053>   DW_AT_name        : (indirect string, offset: 0x90c85): Lock
    <1057>   DW_AT_decl_file   : 8
    <1058>   DW_AT_decl_line   : 118
    <1059>   DW_AT_decl_column : 25
    <105a>   DW_AT_type        : <0xdfc>
    <105e>   DW_AT_data_member_location: 36
 <2><105f>: Abbrev Number: 13 (DW_TAG_member)
    <1060>   DW_AT_name        : (indirect string, offset: 0xd0f05): State
    <1064>   DW_AT_decl_file   : 8
    <1065>   DW_AT_decl_line   : 120
    <1066>   DW_AT_decl_column : 30
    <1067>   DW_AT_type        : <0x1026>
    <106b>   DW_AT_data_member_location: 37
 <2><106c>: Abbrev Number: 13 (DW_TAG_member)
    <106d>   DW_AT_name        : (indirect string, offset: 0xcc3e3): Parent
    <1071>   DW_AT_decl_file   : 8
    <1072>   DW_AT_decl_line   : 122
    <1073>   DW_AT_decl_column : 26
    <1074>   DW_AT_type        : <0x10db>
    <1078>   DW_AT_data_member_location: 40
 <2><1079>: Abbrev Number: 13 (DW_TAG_member)
    <107a>   DW_AT_name        : (indirect string, offset: 0xcc40f): XferCpltCallback
    <107e>   DW_AT_decl_file   : 8
    <107f>   DW_AT_decl_line   : 124
    <1080>   DW_AT_decl_column : 28
    <1081>   DW_AT_type        : <0x10ee>
    <1085>   DW_AT_data_member_location: 44
 <2><1086>: Abbrev Number: 13 (DW_TAG_member)
    <1087>   DW_AT_name        : (indirect string, offset: 0xcc24b): XferHalfCpltCallback
    <108b>   DW_AT_decl_file   : 8
    <108c>   DW_AT_decl_line   : 126
    <108d>   DW_AT_decl_column : 28
    <108e>   DW_AT_type        : <0x10ee>
    <1092>   DW_AT_data_member_location: 48
 <2><1093>: Abbrev Number: 13 (DW_TAG_member)
    <1094>   DW_AT_name        : (indirect string, offset: 0xcbd89): XferErrorCallback
    <1098>   DW_AT_decl_file   : 8
    <1099>   DW_AT_decl_line   : 128
    <109a>   DW_AT_decl_column : 28
    <109b>   DW_AT_type        : <0x10ee>
    <109f>   DW_AT_data_member_location: 52
 <2><10a0>: Abbrev Number: 13 (DW_TAG_member)
    <10a1>   DW_AT_name        : (indirect string, offset: 0xcc3a8): XferAbortCallback
    <10a5>   DW_AT_decl_file   : 8
    <10a6>   DW_AT_decl_line   : 130
    <10a7>   DW_AT_decl_column : 28
    <10a8>   DW_AT_type        : <0x10ee>
    <10ac>   DW_AT_data_member_location: 56
 <2><10ad>: Abbrev Number: 13 (DW_TAG_member)
    <10ae>   DW_AT_name        : (indirect string, offset: 0xcc3ef): ErrorCode
    <10b2>   DW_AT_decl_file   : 8
    <10b3>   DW_AT_decl_line   : 132
    <10b4>   DW_AT_decl_column : 25
    <10b5>   DW_AT_type        : <0x962>
    <10b9>   DW_AT_data_member_location: 60
 <2><10ba>: Abbrev Number: 13 (DW_TAG_member)
    <10bb>   DW_AT_name        : (indirect string, offset: 0xcbf0a): DmaBaseAddress
    <10bf>   DW_AT_decl_file   : 8
    <10c0>   DW_AT_decl_line   : 134
    <10c1>   DW_AT_decl_column : 26
    <10c2>   DW_AT_type        : <0x10f4>
    <10c6>   DW_AT_data_member_location: 64
 <2><10c7>: Abbrev Number: 13 (DW_TAG_member)
    <10c8>   DW_AT_name        : (indirect string, offset: 0xcbd56): ChannelIndex
    <10cc>   DW_AT_decl_file   : 8
    <10cd>   DW_AT_decl_line   : 136
    <10ce>   DW_AT_decl_column : 25
    <10cf>   DW_AT_type        : <0x956>
    <10d3>   DW_AT_data_member_location: 68
 <2><10d4>: Abbrev Number: 0
 <1><10d5>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <10d6>   DW_AT_byte_size   : 4
    <10d7>   DW_AT_type        : <0x9aa>
 <1><10db>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <10dc>   DW_AT_byte_size   : 4
 <1><10dd>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <10de>   DW_AT_prototyped  : 1
    <10de>   DW_AT_sibling     : <0x10e8>
 <2><10e2>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <10e3>   DW_AT_type        : <0x10e8>
 <2><10e7>: Abbrev Number: 0
 <1><10e8>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <10e9>   DW_AT_byte_size   : 4
    <10ea>   DW_AT_type        : <0x102b>
 <1><10ee>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <10ef>   DW_AT_byte_size   : 4
    <10f0>   DW_AT_type        : <0x10dd>
 <1><10f4>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <10f5>   DW_AT_byte_size   : 4
    <10f6>   DW_AT_type        : <0x9de>
 <1><10fa>: Abbrev Number: 3 (DW_TAG_typedef)
    <10fb>   DW_AT_name        : (indirect string, offset: 0xcc31b): DMA_HandleTypeDef
    <10ff>   DW_AT_decl_file   : 8
    <1100>   DW_AT_decl_line   : 153
    <1101>   DW_AT_decl_column : 2
    <1102>   DW_AT_type        : <0x102b>
 <1><1106>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1107>   DW_AT_byte_size   : 4
    <1108>   DW_AT_type        : <0x10fa>
 <1><110c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <110d>   DW_AT_byte_size   : 24
    <110e>   DW_AT_decl_file   : 9
    <110f>   DW_AT_decl_line   : 46
    <1110>   DW_AT_decl_column : 9
    <1111>   DW_AT_sibling     : <0x1164>
 <2><1115>: Abbrev Number: 13 (DW_TAG_member)
    <1116>   DW_AT_name        : (indirect string, offset: 0xccc90): Prescaler
    <111a>   DW_AT_decl_file   : 9
    <111b>   DW_AT_decl_line   : 48
    <111c>   DW_AT_decl_column : 12
    <111d>   DW_AT_type        : <0x956>
    <1121>   DW_AT_data_member_location: 0
 <2><1122>: Abbrev Number: 13 (DW_TAG_member)
    <1123>   DW_AT_name        : (indirect string, offset: 0xcc39c): CounterMode
    <1127>   DW_AT_decl_file   : 9
    <1128>   DW_AT_decl_line   : 51
    <1129>   DW_AT_decl_column : 12
    <112a>   DW_AT_type        : <0x956>
    <112e>   DW_AT_data_member_location: 4
 <2><112f>: Abbrev Number: 13 (DW_TAG_member)
    <1130>   DW_AT_name        : (indirect string, offset: 0xd6b17): Period
    <1134>   DW_AT_decl_file   : 9
    <1135>   DW_AT_decl_line   : 54
    <1136>   DW_AT_decl_column : 12
    <1137>   DW_AT_type        : <0x956>
    <113b>   DW_AT_data_member_location: 8
 <2><113c>: Abbrev Number: 13 (DW_TAG_member)
    <113d>   DW_AT_name        : (indirect string, offset: 0xcbf19): ClockDivision
    <1141>   DW_AT_decl_file   : 9
    <1142>   DW_AT_decl_line   : 58
    <1143>   DW_AT_decl_column : 12
    <1144>   DW_AT_type        : <0x956>
    <1148>   DW_AT_data_member_location: 12
 <2><1149>: Abbrev Number: 13 (DW_TAG_member)
    <114a>   DW_AT_name        : (indirect string, offset: 0xcc1ef): RepetitionCounter
    <114e>   DW_AT_decl_file   : 9
    <114f>   DW_AT_decl_line   : 61
    <1150>   DW_AT_decl_column : 12
    <1151>   DW_AT_type        : <0x956>
    <1155>   DW_AT_data_member_location: 16
 <2><1156>: Abbrev Number: 13 (DW_TAG_member)
    <1157>   DW_AT_name        : (indirect string, offset: 0xcbd72): AutoReloadPreload
    <115b>   DW_AT_decl_file   : 9
    <115c>   DW_AT_decl_line   : 72
    <115d>   DW_AT_decl_column : 12
    <115e>   DW_AT_type        : <0x956>
    <1162>   DW_AT_data_member_location: 20
 <2><1163>: Abbrev Number: 0
 <1><1164>: Abbrev Number: 3 (DW_TAG_typedef)
    <1165>   DW_AT_name        : (indirect string, offset: 0xcc273): TIM_Base_InitTypeDef
    <1169>   DW_AT_decl_file   : 9
    <116a>   DW_AT_decl_line   : 74
    <116b>   DW_AT_decl_column : 3
    <116c>   DW_AT_type        : <0x110c>
 <1><1170>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <1171>   DW_AT_encoding    : 7	(unsigned)
    <1172>   DW_AT_byte_size   : 1
    <1173>   DW_AT_type        : <0x90b>
    <1177>   DW_AT_decl_file   : 9
    <1178>   DW_AT_decl_line   : 301
    <117a>   DW_AT_decl_column : 1
    <117b>   DW_AT_sibling     : <0x119e>
 <2><117f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1180>   DW_AT_name        : (indirect string, offset: 0xcbf91): HAL_TIM_STATE_RESET
    <1184>   DW_AT_const_value : 0
 <2><1185>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1186>   DW_AT_name        : (indirect string, offset: 0xcbcf6): HAL_TIM_STATE_READY
    <118a>   DW_AT_const_value : 1
 <2><118b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <118c>   DW_AT_name        : (indirect string, offset: 0xcbe09): HAL_TIM_STATE_BUSY
    <1190>   DW_AT_const_value : 2
 <2><1191>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1192>   DW_AT_name        : (indirect string, offset: 0xcc2cc): HAL_TIM_STATE_TIMEOUT
    <1196>   DW_AT_const_value : 3
 <2><1197>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1198>   DW_AT_name        : (indirect string, offset: 0xcc0f5): HAL_TIM_STATE_ERROR
    <119c>   DW_AT_const_value : 4
 <2><119d>: Abbrev Number: 0
 <1><119e>: Abbrev Number: 9 (DW_TAG_typedef)
    <119f>   DW_AT_name        : (indirect string, offset: 0xcc16c): HAL_TIM_StateTypeDef
    <11a3>   DW_AT_decl_file   : 9
    <11a4>   DW_AT_decl_line   : 307
    <11a6>   DW_AT_decl_column : 3
    <11a7>   DW_AT_type        : <0x1170>
 <1><11ab>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <11ac>   DW_AT_type        : <0x119e>
 <1><11b0>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <11b1>   DW_AT_encoding    : 7	(unsigned)
    <11b2>   DW_AT_byte_size   : 1
    <11b3>   DW_AT_type        : <0x90b>
    <11b7>   DW_AT_decl_file   : 9
    <11b8>   DW_AT_decl_line   : 313
    <11ba>   DW_AT_decl_column : 1
    <11bb>   DW_AT_sibling     : <0x11d2>
 <2><11bf>: Abbrev Number: 11 (DW_TAG_enumerator)
    <11c0>   DW_AT_name        : (indirect string, offset: 0xcbd3a): HAL_TIM_CHANNEL_STATE_RESET
    <11c4>   DW_AT_const_value : 0
 <2><11c5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <11c6>   DW_AT_name        : (indirect string, offset: 0xcc0a4): HAL_TIM_CHANNEL_STATE_READY
    <11ca>   DW_AT_const_value : 1
 <2><11cb>: Abbrev Number: 11 (DW_TAG_enumerator)
    <11cc>   DW_AT_name        : (indirect string, offset: 0xcc11c): HAL_TIM_CHANNEL_STATE_BUSY
    <11d0>   DW_AT_const_value : 2
 <2><11d1>: Abbrev Number: 0
