Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xc5e (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xc5fa5): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x8ae5d): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x840f5): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/RTOS_Tutorial_Part3/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x8d4d): size_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 209
    <37>   DW_AT_decl_column : 23
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 4 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 4
    <3e>   DW_AT_encoding    : 7	(unsigned)
    <3f>   DW_AT_name        : (indirect string, offset: 0x10c01): unsigned int
 <1><43>: Abbrev Number: 4 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 8
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x5d43c): long long int
 <1><4a>: Abbrev Number: 4 (DW_TAG_base_type)
    <4b>   DW_AT_byte_size   : 8
    <4c>   DW_AT_encoding    : 4	(float)
    <4d>   DW_AT_name        : (indirect string, offset: 0x12e14): long double
 <1><51>: Abbrev Number: 4 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 1
    <53>   DW_AT_encoding    : 6	(signed char)
    <54>   DW_AT_name        : (indirect string, offset: 0x668ab): signed char
 <1><58>: Abbrev Number: 3 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x3aca5): __uint8_t
    <5d>   DW_AT_decl_file   : 3
    <5e>   DW_AT_decl_line   : 43
    <5f>   DW_AT_decl_column : 24
    <60>   DW_AT_type        : <0x64>
 <1><64>: Abbrev Number: 4 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 1
    <66>   DW_AT_encoding    : 8	(unsigned char)
    <67>   DW_AT_name        : (indirect string, offset: 0xc4bd7): unsigned char
 <1><6b>: Abbrev Number: 4 (DW_TAG_base_type)
    <6c>   DW_AT_byte_size   : 2
    <6d>   DW_AT_encoding    : 5	(signed)
    <6e>   DW_AT_name        : (indirect string, offset: 0x97979): short int
 <1><72>: Abbrev Number: 3 (DW_TAG_typedef)
    <73>   DW_AT_name        : (indirect string, offset: 0xa658c): __uint16_t
    <77>   DW_AT_decl_file   : 3
    <78>   DW_AT_decl_line   : 57
    <79>   DW_AT_decl_column : 25
    <7a>   DW_AT_type        : <0x7e>
 <1><7e>: Abbrev Number: 4 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 2
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0xc3334): short unsigned int
 <1><85>: Abbrev Number: 4 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : (indirect string, offset: 0x1163e): long int
 <1><8c>: Abbrev Number: 3 (DW_TAG_typedef)
    <8d>   DW_AT_name        : (indirect string, offset: 0x8248a): __uint32_t
    <91>   DW_AT_decl_file   : 3
    <92>   DW_AT_decl_line   : 79
    <93>   DW_AT_decl_column : 25
    <94>   DW_AT_type        : <0x98>
 <1><98>: Abbrev Number: 4 (DW_TAG_base_type)
    <99>   DW_AT_byte_size   : 4
    <9a>   DW_AT_encoding    : 7	(unsigned)
    <9b>   DW_AT_name        : (indirect string, offset: 0x4e2c5): long unsigned int
 <1><9f>: Abbrev Number: 4 (DW_TAG_base_type)
    <a0>   DW_AT_byte_size   : 8
    <a1>   DW_AT_encoding    : 7	(unsigned)
    <a2>   DW_AT_name        : (indirect string, offset: 0x2a392): long long unsigned int
 <1><a6>: Abbrev Number: 3 (DW_TAG_typedef)
    <a7>   DW_AT_name        : (indirect string, offset: 0x3aca7): uint8_t
    <ab>   DW_AT_decl_file   : 4
    <ac>   DW_AT_decl_line   : 24
    <ad>   DW_AT_decl_column : 19
    <ae>   DW_AT_type        : <0x58>
 <1><b2>: Abbrev Number: 5 (DW_TAG_const_type)
    <b3>   DW_AT_type        : <0xa6>
 <1><b7>: Abbrev Number: 3 (DW_TAG_typedef)
    <b8>   DW_AT_name        : (indirect string, offset: 0x94b21): uint16_t
    <bc>   DW_AT_decl_file   : 4
    <bd>   DW_AT_decl_line   : 36
    <be>   DW_AT_decl_column : 20
    <bf>   DW_AT_type        : <0x72>
 <1><c3>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <c4>   DW_AT_type        : <0xb7>
 <1><c8>: Abbrev Number: 3 (DW_TAG_typedef)
    <c9>   DW_AT_name        : (indirect string, offset: 0x940d0): uint32_t
    <cd>   DW_AT_decl_file   : 4
    <ce>   DW_AT_decl_line   : 48
    <cf>   DW_AT_decl_column : 20
    <d0>   DW_AT_type        : <0x8c>
 <1><d4>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <d5>   DW_AT_type        : <0xc8>
 <1><d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <da>   DW_AT_byte_size   : 4
    <db>   DW_AT_type        : <0xdf>
 <1><df>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <e0>   DW_AT_prototyped  : 1
    <e0>   DW_AT_sibling     : <0xea>
 <2><e4>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <e5>   DW_AT_type        : <0xea>
 <2><e9>: Abbrev Number: 0
 <1><ea>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <eb>   DW_AT_byte_size   : 4
 <1><ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed>   DW_AT_byte_size   : 4
    <ee>   DW_AT_type        : <0xa6>
 <1><f2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f3>   DW_AT_byte_size   : 4
    <f4>   DW_AT_type        : <0xf8>
 <1><f8>: Abbrev Number: 4 (DW_TAG_base_type)
    <f9>   DW_AT_byte_size   : 1
    <fa>   DW_AT_encoding    : 8	(unsigned char)
    <fb>   DW_AT_name        : (indirect string, offset: 0x4157d): char
 <1><ff>: Abbrev Number: 5 (DW_TAG_const_type)
    <100>   DW_AT_type        : <0xf8>
 <1><104>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <105>   DW_AT_byte_size   : 4
    <106>   DW_AT_type        : <0xff>
 <1><10a>: Abbrev Number: 11 (DW_TAG_structure_type)
    <10b>   DW_AT_byte_size   : 16
    <10c>   DW_AT_decl_file   : 5
    <10d>   DW_AT_decl_line   : 360
    <10f>   DW_AT_decl_column : 9
    <110>   DW_AT_sibling     : <0x14d>
 <2><114>: Abbrev Number: 12 (DW_TAG_member)
    <115>   DW_AT_name        : CCR
    <119>   DW_AT_decl_file   : 5
    <11a>   DW_AT_decl_line   : 362
    <11c>   DW_AT_decl_column : 17
    <11d>   DW_AT_type        : <0xd4>
    <121>   DW_AT_data_member_location: 0
 <2><122>: Abbrev Number: 13 (DW_TAG_member)
    <123>   DW_AT_name        : (indirect string, offset: 0x858d5): CNDTR
    <127>   DW_AT_decl_file   : 5
    <128>   DW_AT_decl_line   : 363
    <12a>   DW_AT_decl_column : 17
    <12b>   DW_AT_type        : <0xd4>
    <12f>   DW_AT_data_member_location: 4
 <2><130>: Abbrev Number: 13 (DW_TAG_member)
    <131>   DW_AT_name        : (indirect string, offset: 0xc4db9): CPAR
    <135>   DW_AT_decl_file   : 5
    <136>   DW_AT_decl_line   : 364
    <138>   DW_AT_decl_column : 17
    <139>   DW_AT_type        : <0xd4>
    <13d>   DW_AT_data_member_location: 8
 <2><13e>: Abbrev Number: 13 (DW_TAG_member)
    <13f>   DW_AT_name        : (indirect string, offset: 0x713e8): CMAR
    <143>   DW_AT_decl_file   : 5
    <144>   DW_AT_decl_line   : 365
    <146>   DW_AT_decl_column : 17
    <147>   DW_AT_type        : <0xd4>
    <14b>   DW_AT_data_member_location: 12
 <2><14c>: Abbrev Number: 0
 <1><14d>: Abbrev Number: 14 (DW_TAG_typedef)
    <14e>   DW_AT_name        : (indirect string, offset: 0xbff8e): DMA_Channel_TypeDef
    <152>   DW_AT_decl_file   : 5
    <153>   DW_AT_decl_line   : 366
    <155>   DW_AT_decl_column : 3
    <156>   DW_AT_type        : <0x10a>
 <1><15a>: Abbrev Number: 11 (DW_TAG_structure_type)
    <15b>   DW_AT_byte_size   : 8
    <15c>   DW_AT_decl_file   : 5
    <15d>   DW_AT_decl_line   : 368
    <15f>   DW_AT_decl_column : 9
    <160>   DW_AT_sibling     : <0x181>
 <2><164>: Abbrev Number: 12 (DW_TAG_member)
    <165>   DW_AT_name        : ISR
    <169>   DW_AT_decl_file   : 5
    <16a>   DW_AT_decl_line   : 370
    <16c>   DW_AT_decl_column : 17
    <16d>   DW_AT_type        : <0xd4>
    <171>   DW_AT_data_member_location: 0
 <2><172>: Abbrev Number: 13 (DW_TAG_member)
    <173>   DW_AT_name        : (indirect string, offset: 0x8efd1): IFCR
    <177>   DW_AT_decl_file   : 5
    <178>   DW_AT_decl_line   : 371
    <17a>   DW_AT_decl_column : 17
    <17b>   DW_AT_type        : <0xd4>
    <17f>   DW_AT_data_member_location: 4
 <2><180>: Abbrev Number: 0
 <1><181>: Abbrev Number: 14 (DW_TAG_typedef)
    <182>   DW_AT_name        : (indirect string, offset: 0x4a332): DMA_TypeDef
    <186>   DW_AT_decl_file   : 5
    <187>   DW_AT_decl_line   : 372
    <189>   DW_AT_decl_column : 3
    <18a>   DW_AT_type        : <0x15a>
 <1><18e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <18f>   DW_AT_byte_size   : 44
    <190>   DW_AT_decl_file   : 5
    <191>   DW_AT_decl_line   : 451
    <193>   DW_AT_decl_column : 9
    <194>   DW_AT_sibling     : <0x225>
 <2><198>: Abbrev Number: 13 (DW_TAG_member)
    <199>   DW_AT_name        : (indirect string, offset: 0x1586): MODER
    <19d>   DW_AT_decl_file   : 5
    <19e>   DW_AT_decl_line   : 453
    <1a0>   DW_AT_decl_column : 17
    <1a1>   DW_AT_type        : <0xd4>
    <1a5>   DW_AT_data_member_location: 0
 <2><1a6>: Abbrev Number: 13 (DW_TAG_member)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x9da9d): OTYPER
    <1ab>   DW_AT_decl_file   : 5
    <1ac>   DW_AT_decl_line   : 454
    <1ae>   DW_AT_decl_column : 17
    <1af>   DW_AT_type        : <0xd4>
    <1b3>   DW_AT_data_member_location: 4
 <2><1b4>: Abbrev Number: 13 (DW_TAG_member)
    <1b5>   DW_AT_name        : (indirect string, offset: 0xb1343): OSPEEDR
    <1b9>   DW_AT_decl_file   : 5
    <1ba>   DW_AT_decl_line   : 455
    <1bc>   DW_AT_decl_column : 17
    <1bd>   DW_AT_type        : <0xd4>
    <1c1>   DW_AT_data_member_location: 8
 <2><1c2>: Abbrev Number: 13 (DW_TAG_member)
    <1c3>   DW_AT_name        : (indirect string, offset: 0x845e3): PUPDR
    <1c7>   DW_AT_decl_file   : 5
    <1c8>   DW_AT_decl_line   : 456
    <1ca>   DW_AT_decl_column : 17
    <1cb>   DW_AT_type        : <0xd4>
    <1cf>   DW_AT_data_member_location: 12
 <2><1d0>: Abbrev Number: 12 (DW_TAG_member)
    <1d1>   DW_AT_name        : IDR
    <1d5>   DW_AT_decl_file   : 5
    <1d6>   DW_AT_decl_line   : 457
    <1d8>   DW_AT_decl_column : 17
    <1d9>   DW_AT_type        : <0xd4>
    <1dd>   DW_AT_data_member_location: 16
 <2><1de>: Abbrev Number: 12 (DW_TAG_member)
    <1df>   DW_AT_name        : ODR
    <1e3>   DW_AT_decl_file   : 5
    <1e4>   DW_AT_decl_line   : 458
    <1e6>   DW_AT_decl_column : 17
    <1e7>   DW_AT_type        : <0xd4>
    <1eb>   DW_AT_data_member_location: 20
 <2><1ec>: Abbrev Number: 13 (DW_TAG_member)
    <1ed>   DW_AT_name        : (indirect string, offset: 0x2d637): BSRR
    <1f1>   DW_AT_decl_file   : 5
    <1f2>   DW_AT_decl_line   : 459
    <1f4>   DW_AT_decl_column : 17
    <1f5>   DW_AT_type        : <0xd4>
    <1f9>   DW_AT_data_member_location: 24
 <2><1fa>: Abbrev Number: 13 (DW_TAG_member)
    <1fb>   DW_AT_name        : (indirect string, offset: 0xaebf6): LCKR
    <1ff>   DW_AT_decl_file   : 5
    <200>   DW_AT_decl_line   : 460
    <202>   DW_AT_decl_column : 17
    <203>   DW_AT_type        : <0xd4>
    <207>   DW_AT_data_member_location: 28
 <2><208>: Abbrev Number: 12 (DW_TAG_member)
    <209>   DW_AT_name        : AFR
    <20d>   DW_AT_decl_file   : 5
    <20e>   DW_AT_decl_line   : 461
    <210>   DW_AT_decl_column : 17
    <211>   DW_AT_type        : <0x235>
    <215>   DW_AT_data_member_location: 32
 <2><216>: Abbrev Number: 12 (DW_TAG_member)
    <217>   DW_AT_name        : BRR
    <21b>   DW_AT_decl_file   : 5
    <21c>   DW_AT_decl_line   : 462
    <21e>   DW_AT_decl_column : 17
    <21f>   DW_AT_type        : <0xd4>
    <223>   DW_AT_data_member_location: 40
 <2><224>: Abbrev Number: 0
 <1><225>: Abbrev Number: 15 (DW_TAG_array_type)
    <226>   DW_AT_type        : <0xd4>
    <22a>   DW_AT_sibling     : <0x235>
 <2><22e>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <22f>   DW_AT_type        : <0x3c>
    <233>   DW_AT_upper_bound : 1
 <2><234>: Abbrev Number: 0
 <1><235>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <236>   DW_AT_type        : <0x225>
 <1><23a>: Abbrev Number: 14 (DW_TAG_typedef)
    <23b>   DW_AT_name        : (indirect string, offset: 0xc5e9e): GPIO_TypeDef
    <23f>   DW_AT_decl_file   : 5
    <240>   DW_AT_decl_line   : 464
    <242>   DW_AT_decl_column : 3
    <243>   DW_AT_type        : <0x18e>
 <1><247>: Abbrev Number: 11 (DW_TAG_structure_type)
    <248>   DW_AT_byte_size   : 44
    <249>   DW_AT_decl_file   : 5
    <24a>   DW_AT_decl_line   : 827
    <24c>   DW_AT_decl_column : 9
    <24d>   DW_AT_sibling     : <0x324>
 <2><251>: Abbrev Number: 12 (DW_TAG_member)
    <252>   DW_AT_name        : CR1
    <256>   DW_AT_decl_file   : 5
    <257>   DW_AT_decl_line   : 829
    <259>   DW_AT_decl_column : 17
    <25a>   DW_AT_type        : <0xd4>
    <25e>   DW_AT_data_member_location: 0
 <2><25f>: Abbrev Number: 12 (DW_TAG_member)
    <260>   DW_AT_name        : CR2
    <264>   DW_AT_decl_file   : 5
    <265>   DW_AT_decl_line   : 830
    <267>   DW_AT_decl_column : 17
    <268>   DW_AT_type        : <0xd4>
    <26c>   DW_AT_data_member_location: 4
 <2><26d>: Abbrev Number: 12 (DW_TAG_member)
    <26e>   DW_AT_name        : CR3
    <272>   DW_AT_decl_file   : 5
    <273>   DW_AT_decl_line   : 831
    <275>   DW_AT_decl_column : 17
    <276>   DW_AT_type        : <0xd4>
    <27a>   DW_AT_data_member_location: 8
 <2><27b>: Abbrev Number: 12 (DW_TAG_member)
    <27c>   DW_AT_name        : BRR
    <280>   DW_AT_decl_file   : 5
    <281>   DW_AT_decl_line   : 832
    <283>   DW_AT_decl_column : 17
    <284>   DW_AT_type        : <0xd4>
    <288>   DW_AT_data_member_location: 12
 <2><289>: Abbrev Number: 13 (DW_TAG_member)
    <28a>   DW_AT_name        : (indirect string, offset: 0x38409): GTPR
    <28e>   DW_AT_decl_file   : 5
    <28f>   DW_AT_decl_line   : 833
    <291>   DW_AT_decl_column : 17
    <292>   DW_AT_type        : <0xc3>
    <296>   DW_AT_data_member_location: 16
 <2><297>: Abbrev Number: 13 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0xbfeb9): RESERVED2
    <29c>   DW_AT_decl_file   : 5
    <29d>   DW_AT_decl_line   : 834
    <29f>   DW_AT_decl_column : 13
    <2a0>   DW_AT_type        : <0xb7>
    <2a4>   DW_AT_data_member_location: 18
 <2><2a5>: Abbrev Number: 13 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x78483): RTOR
    <2aa>   DW_AT_decl_file   : 5
    <2ab>   DW_AT_decl_line   : 835
    <2ad>   DW_AT_decl_column : 17
    <2ae>   DW_AT_type        : <0xd4>
    <2b2>   DW_AT_data_member_location: 20
 <2><2b3>: Abbrev Number: 12 (DW_TAG_member)
    <2b4>   DW_AT_name        : RQR
    <2b8>   DW_AT_decl_file   : 5
    <2b9>   DW_AT_decl_line   : 836
    <2bb>   DW_AT_decl_column : 17
    <2bc>   DW_AT_type        : <0xc3>
    <2c0>   DW_AT_data_member_location: 24
 <2><2c1>: Abbrev Number: 13 (DW_TAG_member)
    <2c2>   DW_AT_name        : (indirect string, offset: 0xbfec3): RESERVED3
    <2c6>   DW_AT_decl_file   : 5
    <2c7>   DW_AT_decl_line   : 837
    <2c9>   DW_AT_decl_column : 13
    <2ca>   DW_AT_type        : <0xb7>
    <2ce>   DW_AT_data_member_location: 26
 <2><2cf>: Abbrev Number: 12 (DW_TAG_member)
    <2d0>   DW_AT_name        : ISR
    <2d4>   DW_AT_decl_file   : 5
    <2d5>   DW_AT_decl_line   : 838
    <2d7>   DW_AT_decl_column : 17
    <2d8>   DW_AT_type        : <0xd4>
    <2dc>   DW_AT_data_member_location: 28
 <2><2dd>: Abbrev Number: 12 (DW_TAG_member)
    <2de>   DW_AT_name        : ICR
    <2e2>   DW_AT_decl_file   : 5
    <2e3>   DW_AT_decl_line   : 839
    <2e5>   DW_AT_decl_column : 17
    <2e6>   DW_AT_type        : <0xd4>
    <2ea>   DW_AT_data_member_location: 32
 <2><2eb>: Abbrev Number: 12 (DW_TAG_member)
    <2ec>   DW_AT_name        : RDR
    <2f0>   DW_AT_decl_file   : 5
    <2f1>   DW_AT_decl_line   : 840
    <2f3>   DW_AT_decl_column : 17
    <2f4>   DW_AT_type        : <0xc3>
    <2f8>   DW_AT_data_member_location: 36
 <2><2f9>: Abbrev Number: 13 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x79570): RESERVED4
    <2fe>   DW_AT_decl_file   : 5
    <2ff>   DW_AT_decl_line   : 841
    <301>   DW_AT_decl_column : 13
    <302>   DW_AT_type        : <0xb7>
    <306>   DW_AT_data_member_location: 38
 <2><307>: Abbrev Number: 12 (DW_TAG_member)
    <308>   DW_AT_name        : TDR
    <30c>   DW_AT_decl_file   : 5
    <30d>   DW_AT_decl_line   : 842
    <30f>   DW_AT_decl_column : 17
    <310>   DW_AT_type        : <0xc3>
    <314>   DW_AT_data_member_location: 40
 <2><315>: Abbrev Number: 13 (DW_TAG_member)
    <316>   DW_AT_name        : (indirect string, offset: 0xbfef1): RESERVED5
    <31a>   DW_AT_decl_file   : 5
    <31b>   DW_AT_decl_line   : 843
    <31d>   DW_AT_decl_column : 13
    <31e>   DW_AT_type        : <0xb7>
    <322>   DW_AT_data_member_location: 42
 <2><323>: Abbrev Number: 0
 <1><324>: Abbrev Number: 14 (DW_TAG_typedef)
    <325>   DW_AT_name        : (indirect string, offset: 0xca086): USART_TypeDef
    <329>   DW_AT_decl_file   : 5
    <32a>   DW_AT_decl_line   : 844
    <32c>   DW_AT_decl_column : 3
    <32d>   DW_AT_type        : <0x247>
 <1><331>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <332>   DW_AT_encoding    : 7	(unsigned)
    <333>   DW_AT_byte_size   : 1
    <334>   DW_AT_type        : <0x64>
    <338>   DW_AT_decl_file   : 6
    <339>   DW_AT_decl_line   : 39
    <33a>   DW_AT_decl_column : 1
    <33b>   DW_AT_sibling     : <0x358>
 <2><33f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <340>   DW_AT_name        : (indirect string, offset: 0x44624): HAL_OK
    <344>   DW_AT_const_value : 0
 <2><345>: Abbrev Number: 18 (DW_TAG_enumerator)
    <346>   DW_AT_name        : (indirect string, offset: 0x7fcce): HAL_ERROR
    <34a>   DW_AT_const_value : 1
 <2><34b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <34c>   DW_AT_name        : (indirect string, offset: 0x23874): HAL_BUSY
    <350>   DW_AT_const_value : 2
 <2><351>: Abbrev Number: 18 (DW_TAG_enumerator)
    <352>   DW_AT_name        : (indirect string, offset: 0x3b2d1): HAL_TIMEOUT
    <356>   DW_AT_const_value : 3
 <2><357>: Abbrev Number: 0
 <1><358>: Abbrev Number: 3 (DW_TAG_typedef)
    <359>   DW_AT_name        : (indirect string, offset: 0x248e): HAL_StatusTypeDef
    <35d>   DW_AT_decl_file   : 6
    <35e>   DW_AT_decl_line   : 44
    <35f>   DW_AT_decl_column : 3
    <360>   DW_AT_type        : <0x331>
 <1><364>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <365>   DW_AT_encoding    : 7	(unsigned)
    <366>   DW_AT_byte_size   : 1
    <367>   DW_AT_type        : <0x64>
    <36b>   DW_AT_decl_file   : 6
    <36c>   DW_AT_decl_line   : 50
    <36d>   DW_AT_decl_column : 1
    <36e>   DW_AT_sibling     : <0x37f>
 <2><372>: Abbrev Number: 18 (DW_TAG_enumerator)
    <373>   DW_AT_name        : (indirect string, offset: 0x96a7c): HAL_UNLOCKED
    <377>   DW_AT_const_value : 0
 <2><378>: Abbrev Number: 18 (DW_TAG_enumerator)
    <379>   DW_AT_name        : (indirect string, offset: 0xcba39): HAL_LOCKED
    <37d>   DW_AT_const_value : 1
 <2><37e>: Abbrev Number: 0
 <1><37f>: Abbrev Number: 3 (DW_TAG_typedef)
    <380>   DW_AT_name        : (indirect string, offset: 0x78400): HAL_LockTypeDef
    <384>   DW_AT_decl_file   : 6
    <385>   DW_AT_decl_line   : 53
    <386>   DW_AT_decl_column : 3
    <387>   DW_AT_type        : <0x364>
 <1><38b>: Abbrev Number: 19 (DW_TAG_structure_type)
    <38c>   DW_AT_byte_size   : 32
    <38d>   DW_AT_decl_file   : 7
    <38e>   DW_AT_decl_line   : 46
    <38f>   DW_AT_decl_column : 9
    <390>   DW_AT_sibling     : <0x3fd>
 <2><394>: Abbrev Number: 20 (DW_TAG_member)
    <395>   DW_AT_name        : (indirect string, offset: 0xb6a69): Request
    <399>   DW_AT_decl_file   : 7
    <39a>   DW_AT_decl_line   : 48
    <39b>   DW_AT_decl_column : 12
    <39c>   DW_AT_type        : <0xc8>
    <3a0>   DW_AT_data_member_location: 0
 <2><3a1>: Abbrev Number: 20 (DW_TAG_member)
    <3a2>   DW_AT_name        : (indirect string, offset: 0xcf2bf): Direction
    <3a6>   DW_AT_decl_file   : 7
    <3a7>   DW_AT_decl_line   : 51
    <3a8>   DW_AT_decl_column : 12
    <3a9>   DW_AT_type        : <0xc8>
    <3ad>   DW_AT_data_member_location: 4
 <2><3ae>: Abbrev Number: 20 (DW_TAG_member)
    <3af>   DW_AT_name        : (indirect string, offset: 0xdd81): PeriphInc
    <3b3>   DW_AT_decl_file   : 7
    <3b4>   DW_AT_decl_line   : 55
    <3b5>   DW_AT_decl_column : 12
    <3b6>   DW_AT_type        : <0xc8>
    <3ba>   DW_AT_data_member_location: 8
 <2><3bb>: Abbrev Number: 20 (DW_TAG_member)
    <3bc>   DW_AT_name        : (indirect string, offset: 0x1fa19): MemInc
    <3c0>   DW_AT_decl_file   : 7
    <3c1>   DW_AT_decl_line   : 58
    <3c2>   DW_AT_decl_column : 12
    <3c3>   DW_AT_type        : <0xc8>
    <3c7>   DW_AT_data_member_location: 12
 <2><3c8>: Abbrev Number: 20 (DW_TAG_member)
    <3c9>   DW_AT_name        : (indirect string, offset: 0x65d29): PeriphDataAlignment
    <3cd>   DW_AT_decl_file   : 7
    <3ce>   DW_AT_decl_line   : 61
    <3cf>   DW_AT_decl_column : 12
    <3d0>   DW_AT_type        : <0xc8>
    <3d4>   DW_AT_data_member_location: 16
 <2><3d5>: Abbrev Number: 20 (DW_TAG_member)
    <3d6>   DW_AT_name        : (indirect string, offset: 0xb7f30): MemDataAlignment
    <3da>   DW_AT_decl_file   : 7
    <3db>   DW_AT_decl_line   : 64
    <3dc>   DW_AT_decl_column : 12
    <3dd>   DW_AT_type        : <0xc8>
    <3e1>   DW_AT_data_member_location: 20
 <2><3e2>: Abbrev Number: 20 (DW_TAG_member)
    <3e3>   DW_AT_name        : (indirect string, offset: 0xce626): Mode
    <3e7>   DW_AT_decl_file   : 7
    <3e8>   DW_AT_decl_line   : 67
    <3e9>   DW_AT_decl_column : 12
    <3ea>   DW_AT_type        : <0xc8>
    <3ee>   DW_AT_data_member_location: 24
 <2><3ef>: Abbrev Number: 20 (DW_TAG_member)
    <3f0>   DW_AT_name        : (indirect string, offset: 0xce0fb): Priority
    <3f4>   DW_AT_decl_file   : 7
    <3f5>   DW_AT_decl_line   : 72
    <3f6>   DW_AT_decl_column : 12
    <3f7>   DW_AT_type        : <0xc8>
    <3fb>   DW_AT_data_member_location: 28
 <2><3fc>: Abbrev Number: 0
 <1><3fd>: Abbrev Number: 3 (DW_TAG_typedef)
    <3fe>   DW_AT_name        : (indirect string, offset: 0x369ef): DMA_InitTypeDef
    <402>   DW_AT_decl_file   : 7
    <403>   DW_AT_decl_line   : 74
    <404>   DW_AT_decl_column : 3
    <405>   DW_AT_type        : <0x38b>
 <1><409>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <40a>   DW_AT_encoding    : 7	(unsigned)
    <40b>   DW_AT_byte_size   : 1
    <40c>   DW_AT_type        : <0x64>
    <410>   DW_AT_decl_file   : 7
    <411>   DW_AT_decl_line   : 80
    <412>   DW_AT_decl_column : 1
    <413>   DW_AT_sibling     : <0x430>
 <2><417>: Abbrev Number: 18 (DW_TAG_enumerator)
    <418>   DW_AT_name        : (indirect string, offset: 0x97cc0): HAL_DMA_STATE_RESET
    <41c>   DW_AT_const_value : 0
 <2><41d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <41e>   DW_AT_name        : (indirect string, offset: 0x37cbd): HAL_DMA_STATE_READY
    <422>   DW_AT_const_value : 1
 <2><423>: Abbrev Number: 18 (DW_TAG_enumerator)
    <424>   DW_AT_name        : (indirect string, offset: 0x8d872): HAL_DMA_STATE_BUSY
    <428>   DW_AT_const_value : 2
 <2><429>: Abbrev Number: 18 (DW_TAG_enumerator)
    <42a>   DW_AT_name        : (indirect string, offset: 0xc89f4): HAL_DMA_STATE_TIMEOUT
    <42e>   DW_AT_const_value : 3
 <2><42f>: Abbrev Number: 0
 <1><430>: Abbrev Number: 3 (DW_TAG_typedef)
    <431>   DW_AT_name        : (indirect string, offset: 0x70c69): HAL_DMA_StateTypeDef
    <435>   DW_AT_decl_file   : 7
    <436>   DW_AT_decl_line   : 85
    <437>   DW_AT_decl_column : 2
    <438>   DW_AT_type        : <0x409>
 <1><43c>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <43d>   DW_AT_type        : <0x430>
 <1><441>: Abbrev Number: 21 (DW_TAG_structure_type)
    <442>   DW_AT_name        : (indirect string, offset: 0xad7a0): __DMA_HandleTypeDef
    <446>   DW_AT_byte_size   : 72
    <447>   DW_AT_decl_file   : 7
    <448>   DW_AT_decl_line   : 112
    <449>   DW_AT_decl_column : 16
    <44a>   DW_AT_sibling     : <0x4eb>
 <2><44e>: Abbrev Number: 20 (DW_TAG_member)
    <44f>   DW_AT_name        : (indirect string, offset: 0xa62ef): Instance
    <453>   DW_AT_decl_file   : 7
    <454>   DW_AT_decl_line   : 114
    <455>   DW_AT_decl_column : 27
    <456>   DW_AT_type        : <0x4eb>
    <45a>   DW_AT_data_member_location: 0
 <2><45b>: Abbrev Number: 20 (DW_TAG_member)
    <45c>   DW_AT_name        : (indirect string, offset: 0xcf2b1): Init
    <460>   DW_AT_decl_file   : 7
    <461>   DW_AT_decl_line   : 116
    <462>   DW_AT_decl_column : 25
    <463>   DW_AT_type        : <0x3fd>
    <467>   DW_AT_data_member_location: 4
 <2><468>: Abbrev Number: 20 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0x91590): Lock
    <46d>   DW_AT_decl_file   : 7
    <46e>   DW_AT_decl_line   : 118
    <46f>   DW_AT_decl_column : 25
    <470>   DW_AT_type        : <0x37f>
    <474>   DW_AT_data_member_location: 36
 <2><475>: Abbrev Number: 20 (DW_TAG_member)
    <476>   DW_AT_name        : (indirect string, offset: 0xd033c): State
    <47a>   DW_AT_decl_file   : 7
    <47b>   DW_AT_decl_line   : 120
    <47c>   DW_AT_decl_column : 30
    <47d>   DW_AT_type        : <0x43c>
    <481>   DW_AT_data_member_location: 37
 <2><482>: Abbrev Number: 20 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0xc1bb9): Parent
    <487>   DW_AT_decl_file   : 7
    <488>   DW_AT_decl_line   : 122
    <489>   DW_AT_decl_column : 26
    <48a>   DW_AT_type        : <0xea>
    <48e>   DW_AT_data_member_location: 40
 <2><48f>: Abbrev Number: 20 (DW_TAG_member)
    <490>   DW_AT_name        : (indirect string, offset: 0xcac23): XferCpltCallback
    <494>   DW_AT_decl_file   : 7
    <495>   DW_AT_decl_line   : 124
    <496>   DW_AT_decl_column : 28
    <497>   DW_AT_type        : <0x502>
    <49b>   DW_AT_data_member_location: 44
 <2><49c>: Abbrev Number: 20 (DW_TAG_member)
    <49d>   DW_AT_name        : (indirect string, offset: 0x9e52a): XferHalfCpltCallback
    <4a1>   DW_AT_decl_file   : 7
    <4a2>   DW_AT_decl_line   : 126
    <4a3>   DW_AT_decl_column : 28
    <4a4>   DW_AT_type        : <0x502>
    <4a8>   DW_AT_data_member_location: 48
 <2><4a9>: Abbrev Number: 20 (DW_TAG_member)
    <4aa>   DW_AT_name        : (indirect string, offset: 0x1d0e9): XferErrorCallback
    <4ae>   DW_AT_decl_file   : 7
    <4af>   DW_AT_decl_line   : 128
    <4b0>   DW_AT_decl_column : 28
    <4b1>   DW_AT_type        : <0x502>
    <4b5>   DW_AT_data_member_location: 52
 <2><4b6>: Abbrev Number: 20 (DW_TAG_member)
    <4b7>   DW_AT_name        : (indirect string, offset: 0xbe03e): XferAbortCallback
    <4bb>   DW_AT_decl_file   : 7
    <4bc>   DW_AT_decl_line   : 130
    <4bd>   DW_AT_decl_column : 28
    <4be>   DW_AT_type        : <0x502>
    <4c2>   DW_AT_data_member_location: 56
 <2><4c3>: Abbrev Number: 20 (DW_TAG_member)
    <4c4>   DW_AT_name        : (indirect string, offset: 0xc74e9): ErrorCode
    <4c8>   DW_AT_decl_file   : 7
    <4c9>   DW_AT_decl_line   : 132
    <4ca>   DW_AT_decl_column : 25
    <4cb>   DW_AT_type        : <0xd4>
    <4cf>   DW_AT_data_member_location: 60
 <2><4d0>: Abbrev Number: 20 (DW_TAG_member)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x52bfc): DmaBaseAddress
    <4d5>   DW_AT_decl_file   : 7
    <4d6>   DW_AT_decl_line   : 134
    <4d7>   DW_AT_decl_column : 26
    <4d8>   DW_AT_type        : <0x508>
    <4dc>   DW_AT_data_member_location: 64
 <2><4dd>: Abbrev Number: 20 (DW_TAG_member)
    <4de>   DW_AT_name        : (indirect string, offset: 0xbce3c): ChannelIndex
    <4e2>   DW_AT_decl_file   : 7
    <4e3>   DW_AT_decl_line   : 136
    <4e4>   DW_AT_decl_column : 25
    <4e5>   DW_AT_type        : <0xc8>
    <4e9>   DW_AT_data_member_location: 68
 <2><4ea>: Abbrev Number: 0
 <1><4eb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <4ec>   DW_AT_byte_size   : 4
    <4ed>   DW_AT_type        : <0x14d>
 <1><4f1>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <4f2>   DW_AT_prototyped  : 1
    <4f2>   DW_AT_sibling     : <0x4fc>
 <2><4f6>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <4f7>   DW_AT_type        : <0x4fc>
 <2><4fb>: Abbrev Number: 0
 <1><4fc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <4fd>   DW_AT_byte_size   : 4
    <4fe>   DW_AT_type        : <0x441>
 <1><502>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <503>   DW_AT_byte_size   : 4
    <504>   DW_AT_type        : <0x4f1>
 <1><508>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <509>   DW_AT_byte_size   : 4
    <50a>   DW_AT_type        : <0x181>
 <1><50e>: Abbrev Number: 3 (DW_TAG_typedef)
    <50f>   DW_AT_name        : (indirect string, offset: 0xad7a2): DMA_HandleTypeDef
    <513>   DW_AT_decl_file   : 7
    <514>   DW_AT_decl_line   : 153
    <515>   DW_AT_decl_column : 2
    <516>   DW_AT_type        : <0x441>
 <1><51a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <51b>   DW_AT_byte_size   : 4
    <51c>   DW_AT_type        : <0x50e>
 <1><520>: Abbrev Number: 19 (DW_TAG_structure_type)
    <521>   DW_AT_byte_size   : 32
    <522>   DW_AT_decl_file   : 8
    <523>   DW_AT_decl_line   : 46
    <524>   DW_AT_decl_column : 9
    <525>   DW_AT_sibling     : <0x592>
 <2><529>: Abbrev Number: 20 (DW_TAG_member)
    <52a>   DW_AT_name        : (indirect string, offset: 0xba3f3): BaudRate
    <52e>   DW_AT_decl_file   : 8
    <52f>   DW_AT_decl_line   : 48
    <530>   DW_AT_decl_column : 12
    <531>   DW_AT_type        : <0xc8>
    <535>   DW_AT_data_member_location: 0
 <2><536>: Abbrev Number: 20 (DW_TAG_member)
    <537>   DW_AT_name        : (indirect string, offset: 0x6042): WordLength
    <53b>   DW_AT_decl_file   : 8
    <53c>   DW_AT_decl_line   : 68
    <53d>   DW_AT_decl_column : 12
    <53e>   DW_AT_type        : <0xc8>
    <542>   DW_AT_data_member_location: 4
 <2><543>: Abbrev Number: 20 (DW_TAG_member)
    <544>   DW_AT_name        : (indirect string, offset: 0xba70e): StopBits
    <548>   DW_AT_decl_file   : 8
    <549>   DW_AT_decl_line   : 71
    <54a>   DW_AT_decl_column : 12
    <54b>   DW_AT_type        : <0xc8>
    <54f>   DW_AT_data_member_location: 8
 <2><550>: Abbrev Number: 20 (DW_TAG_member)
    <551>   DW_AT_name        : (indirect string, offset: 0x39d1c): Parity
    <555>   DW_AT_decl_file   : 8
    <556>   DW_AT_decl_line   : 74
    <557>   DW_AT_decl_column : 12
    <558>   DW_AT_type        : <0xc8>
    <55c>   DW_AT_data_member_location: 12
 <2><55d>: Abbrev Number: 20 (DW_TAG_member)
    <55e>   DW_AT_name        : (indirect string, offset: 0xce626): Mode
    <562>   DW_AT_decl_file   : 8
    <563>   DW_AT_decl_line   : 81
    <564>   DW_AT_decl_column : 12
    <565>   DW_AT_type        : <0xc8>
    <569>   DW_AT_data_member_location: 16
 <2><56a>: Abbrev Number: 20 (DW_TAG_member)
    <56b>   DW_AT_name        : (indirect string, offset: 0x6e0b1): HwFlowCtl
    <56f>   DW_AT_decl_file   : 8
    <570>   DW_AT_decl_line   : 84
    <571>   DW_AT_decl_column : 12
    <572>   DW_AT_type        : <0xc8>
    <576>   DW_AT_data_member_location: 20
 <2><577>: Abbrev Number: 20 (DW_TAG_member)
    <578>   DW_AT_name        : (indirect string, offset: 0xaadc4): OverSampling
    <57c>   DW_AT_decl_file   : 8
    <57d>   DW_AT_decl_line   : 88
    <57e>   DW_AT_decl_column : 12
    <57f>   DW_AT_type        : <0xc8>
    <583>   DW_AT_data_member_location: 24
 <2><584>: Abbrev Number: 20 (DW_TAG_member)
    <585>   DW_AT_name        : (indirect string, offset: 0x29223): OneBitSampling
    <589>   DW_AT_decl_file   : 8
    <58a>   DW_AT_decl_line   : 92
    <58b>   DW_AT_decl_column : 12
    <58c>   DW_AT_type        : <0xc8>
    <590>   DW_AT_data_member_location: 28
 <2><591>: Abbrev Number: 0
 <1><592>: Abbrev Number: 3 (DW_TAG_typedef)
    <593>   DW_AT_name        : (indirect string, offset: 0x6b768): UART_InitTypeDef
    <597>   DW_AT_decl_file   : 8
    <598>   DW_AT_decl_line   : 101
    <599>   DW_AT_decl_column : 3
    <59a>   DW_AT_type        : <0x520>
 <1><59e>: Abbrev Number: 19 (DW_TAG_structure_type)
    <59f>   DW_AT_byte_size   : 40
    <5a0>   DW_AT_decl_file   : 8
    <5a1>   DW_AT_decl_line   : 106
    <5a2>   DW_AT_decl_column : 9
    <5a3>   DW_AT_sibling     : <0x62a>
 <2><5a7>: Abbrev Number: 20 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x27adc): AdvFeatureInit
    <5ac>   DW_AT_decl_file   : 8
    <5ad>   DW_AT_decl_line   : 108
    <5ae>   DW_AT_decl_column : 12
    <5af>   DW_AT_type        : <0xc8>
    <5b3>   DW_AT_data_member_location: 0
 <2><5b4>: Abbrev Number: 20 (DW_TAG_member)
    <5b5>   DW_AT_name        : (indirect string, offset: 0xbda6a): TxPinLevelInvert
    <5b9>   DW_AT_decl_file   : 8
    <5ba>   DW_AT_decl_line   : 113
    <5bb>   DW_AT_decl_column : 12
    <5bc>   DW_AT_type        : <0xc8>
    <5c0>   DW_AT_data_member_location: 4
 <2><5c1>: Abbrev Number: 20 (DW_TAG_member)
    <5c2>   DW_AT_name        : (indirect string, offset: 0xab0a0): RxPinLevelInvert
    <5c6>   DW_AT_decl_file   : 8
    <5c7>   DW_AT_decl_line   : 116
    <5c8>   DW_AT_decl_column : 12
    <5c9>   DW_AT_type        : <0xc8>
    <5cd>   DW_AT_data_member_location: 8
 <2><5ce>: Abbrev Number: 20 (DW_TAG_member)
    <5cf>   DW_AT_name        : (indirect string, offset: 0x89954): DataInvert
    <5d3>   DW_AT_decl_file   : 8
    <5d4>   DW_AT_decl_line   : 119
    <5d5>   DW_AT_decl_column : 12
    <5d6>   DW_AT_type        : <0xc8>
    <5da>   DW_AT_data_member_location: 12
 <2><5db>: Abbrev Number: 20 (DW_TAG_member)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x40696): Swap
    <5e0>   DW_AT_decl_file   : 8
    <5e1>   DW_AT_decl_line   : 123
    <5e2>   DW_AT_decl_column : 12
    <5e3>   DW_AT_type        : <0xc8>
    <5e7>   DW_AT_data_member_location: 16
 <2><5e8>: Abbrev Number: 20 (DW_TAG_member)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x27dc0): OverrunDisable
    <5ed>   DW_AT_decl_file   : 8
    <5ee>   DW_AT_decl_line   : 126
    <5ef>   DW_AT_decl_column : 12
    <5f0>   DW_AT_type        : <0xc8>
    <5f4>   DW_AT_data_member_location: 20
 <2><5f5>: Abbrev Number: 20 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x7639): DMADisableonRxError
    <5fa>   DW_AT_decl_file   : 8
    <5fb>   DW_AT_decl_line   : 129
    <5fc>   DW_AT_decl_column : 12
    <5fd>   DW_AT_type        : <0xc8>
    <601>   DW_AT_data_member_location: 24
 <2><602>: Abbrev Number: 20 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0xb8541): AutoBaudRateEnable
    <607>   DW_AT_decl_file   : 8
    <608>   DW_AT_decl_line   : 132
    <609>   DW_AT_decl_column : 12
    <60a>   DW_AT_type        : <0xc8>
    <60e>   DW_AT_data_member_location: 28
 <2><60f>: Abbrev Number: 20 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0x2760a): AutoBaudRateMode
    <614>   DW_AT_decl_file   : 8
    <615>   DW_AT_decl_line   : 135
    <616>   DW_AT_decl_column : 12
    <617>   DW_AT_type        : <0xc8>
    <61b>   DW_AT_data_member_location: 32
 <2><61c>: Abbrev Number: 20 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0x5a54a): MSBFirst
    <621>   DW_AT_decl_file   : 8
    <622>   DW_AT_decl_line   : 139
    <623>   DW_AT_decl_column : 12
    <624>   DW_AT_type        : <0xc8>
    <628>   DW_AT_data_member_location: 36
 <2><629>: Abbrev Number: 0
 <1><62a>: Abbrev Number: 3 (DW_TAG_typedef)
    <62b>   DW_AT_name        : (indirect string, offset: 0x97ad8): UART_AdvFeatureInitTypeDef
    <62f>   DW_AT_decl_file   : 8
    <630>   DW_AT_decl_line   : 141
    <631>   DW_AT_decl_column : 3
    <632>   DW_AT_type        : <0x59e>
 <1><636>: Abbrev Number: 3 (DW_TAG_typedef)
    <637>   DW_AT_name        : (indirect string, offset: 0x3dad3): HAL_UART_StateTypeDef
    <63b>   DW_AT_decl_file   : 8
    <63c>   DW_AT_decl_line   : 183
    <63d>   DW_AT_decl_column : 18
    <63e>   DW_AT_type        : <0xc8>
 <1><642>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <643>   DW_AT_type        : <0x636>
 <1><647>: Abbrev Number: 3 (DW_TAG_typedef)
    <648>   DW_AT_name        : (indirect string, offset: 0x5380b): HAL_UART_RxTypeTypeDef
    <64c>   DW_AT_decl_file   : 8
    <64d>   DW_AT_decl_line   : 207
    <64e>   DW_AT_decl_column : 18
    <64f>   DW_AT_type        : <0xc8>
 <1><653>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <654>   DW_AT_type        : <0x647>
 <1><658>: Abbrev Number: 21 (DW_TAG_structure_type)
    <659>   DW_AT_name        : (indirect string, offset: 0x76562): __UART_HandleTypeDef
    <65d>   DW_AT_byte_size   : 132
    <65e>   DW_AT_decl_file   : 8
    <65f>   DW_AT_decl_line   : 212
    <660>   DW_AT_decl_column : 16
    <661>   DW_AT_sibling     : <0x75f>
 <2><665>: Abbrev Number: 20 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0xa62ef): Instance
    <66a>   DW_AT_decl_file   : 8
    <66b>   DW_AT_decl_line   : 214
    <66c>   DW_AT_decl_column : 29
    <66d>   DW_AT_type        : <0x75f>
    <671>   DW_AT_data_member_location: 0
 <2><672>: Abbrev Number: 20 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0xcf2b1): Init
    <677>   DW_AT_decl_file   : 8
    <678>   DW_AT_decl_line   : 216
    <679>   DW_AT_decl_column : 28
    <67a>   DW_AT_type        : <0x592>
    <67e>   DW_AT_data_member_location: 4
 <2><67f>: Abbrev Number: 20 (DW_TAG_member)
    <680>   DW_AT_name        : (indirect string, offset: 0x9f291): AdvancedInit
    <684>   DW_AT_decl_file   : 8
    <685>   DW_AT_decl_line   : 218
    <686>   DW_AT_decl_column : 30
    <687>   DW_AT_type        : <0x62a>
    <68b>   DW_AT_data_member_location: 36
 <2><68c>: Abbrev Number: 20 (DW_TAG_member)
    <68d>   DW_AT_name        : (indirect string, offset: 0x61d1f): pTxBuffPtr
    <691>   DW_AT_decl_file   : 8
    <692>   DW_AT_decl_line   : 220
    <693>   DW_AT_decl_column : 29
    <694>   DW_AT_type        : <0x765>
    <698>   DW_AT_data_member_location: 76
 <2><699>: Abbrev Number: 20 (DW_TAG_member)
    <69a>   DW_AT_name        : (indirect string, offset: 0x55f3a): TxXferSize
    <69e>   DW_AT_decl_file   : 8
    <69f>   DW_AT_decl_line   : 222
    <6a0>   DW_AT_decl_column : 28
    <6a1>   DW_AT_type        : <0xb7>
    <6a5>   DW_AT_data_member_location: 80
 <2><6a6>: Abbrev Number: 20 (DW_TAG_member)
    <6a7>   DW_AT_name        : (indirect string, offset: 0x6ffeb): TxXferCount
    <6ab>   DW_AT_decl_file   : 8
    <6ac>   DW_AT_decl_line   : 224
    <6ad>   DW_AT_decl_column : 28
    <6ae>   DW_AT_type        : <0xc3>
    <6b2>   DW_AT_data_member_location: 82
 <2><6b3>: Abbrev Number: 20 (DW_TAG_member)
    <6b4>   DW_AT_name        : (indirect string, offset: 0xbd260): pRxBuffPtr
    <6b8>   DW_AT_decl_file   : 8
    <6b9>   DW_AT_decl_line   : 226
    <6ba>   DW_AT_decl_column : 29
    <6bb>   DW_AT_type        : <0xec>
    <6bf>   DW_AT_data_member_location: 84
 <2><6c0>: Abbrev Number: 20 (DW_TAG_member)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x65da8): RxXferSize
    <6c5>   DW_AT_decl_file   : 8
    <6c6>   DW_AT_decl_line   : 228
    <6c7>   DW_AT_decl_column : 28
    <6c8>   DW_AT_type        : <0xb7>
    <6cc>   DW_AT_data_member_location: 88
 <2><6cd>: Abbrev Number: 20 (DW_TAG_member)
    <6ce>   DW_AT_name        : (indirect string, offset: 0x7ab28): RxXferCount
    <6d2>   DW_AT_decl_file   : 8
    <6d3>   DW_AT_decl_line   : 230
    <6d4>   DW_AT_decl_column : 28
    <6d5>   DW_AT_type        : <0xc3>
    <6d9>   DW_AT_data_member_location: 90
 <2><6da>: Abbrev Number: 20 (DW_TAG_member)
    <6db>   DW_AT_name        : (indirect string, offset: 0xd0862): Mask
    <6df>   DW_AT_decl_file   : 8
    <6e0>   DW_AT_decl_line   : 232
    <6e1>   DW_AT_decl_column : 28
    <6e2>   DW_AT_type        : <0xb7>
    <6e6>   DW_AT_data_member_location: 92
 <2><6e7>: Abbrev Number: 20 (DW_TAG_member)
    <6e8>   DW_AT_name        : (indirect string, offset: 0xaa197): ReceptionType
    <6ec>   DW_AT_decl_file   : 8
    <6ed>   DW_AT_decl_line   : 243
    <6ee>   DW_AT_decl_column : 31
    <6ef>   DW_AT_type        : <0x653>
    <6f3>   DW_AT_data_member_location: 96
 <2><6f4>: Abbrev Number: 20 (DW_TAG_member)
    <6f5>   DW_AT_name        : (indirect string, offset: 0xaf85e): RxISR
    <6f9>   DW_AT_decl_file   : 8
    <6fa>   DW_AT_decl_line   : 245
    <6fb>   DW_AT_decl_column : 10
    <6fc>   DW_AT_type        : <0x77c>
    <700>   DW_AT_data_member_location: 100
 <2><701>: Abbrev Number: 20 (DW_TAG_member)
    <702>   DW_AT_name        : (indirect string, offset: 0x66897): TxISR
    <706>   DW_AT_decl_file   : 8
    <707>   DW_AT_decl_line   : 247
    <708>   DW_AT_decl_column : 10
    <709>   DW_AT_type        : <0x77c>
    <70d>   DW_AT_data_member_location: 104
 <2><70e>: Abbrev Number: 20 (DW_TAG_member)
    <70f>   DW_AT_name        : (indirect string, offset: 0xa7100): hdmatx
    <713>   DW_AT_decl_file   : 8
    <714>   DW_AT_decl_line   : 249
    <715>   DW_AT_decl_column : 29
    <716>   DW_AT_type        : <0x51a>
    <71a>   DW_AT_data_member_location: 108
 <2><71b>: Abbrev Number: 20 (DW_TAG_member)
    <71c>   DW_AT_name        : (indirect string, offset: 0xc5b9d): hdmarx
    <720>   DW_AT_decl_file   : 8
    <721>   DW_AT_decl_line   : 251
    <722>   DW_AT_decl_column : 29
    <723>   DW_AT_type        : <0x51a>
    <727>   DW_AT_data_member_location: 112
 <2><728>: Abbrev Number: 20 (DW_TAG_member)
    <729>   DW_AT_name        : (indirect string, offset: 0x91590): Lock
    <72d>   DW_AT_decl_file   : 8
    <72e>   DW_AT_decl_line   : 253
    <72f>   DW_AT_decl_column : 29
    <730>   DW_AT_type        : <0x37f>
    <734>   DW_AT_data_member_location: 116
 <2><735>: Abbrev Number: 20 (DW_TAG_member)
    <736>   DW_AT_name        : (indirect string, offset: 0x52f0e): gState
    <73a>   DW_AT_decl_file   : 8
    <73b>   DW_AT_decl_line   : 255
    <73c>   DW_AT_decl_column : 33
    <73d>   DW_AT_type        : <0x642>
    <741>   DW_AT_data_member_location: 120
 <2><742>: Abbrev Number: 13 (DW_TAG_member)
    <743>   DW_AT_name        : (indirect string, offset: 0xb77f6): RxState
    <747>   DW_AT_decl_file   : 8
    <748>   DW_AT_decl_line   : 259
    <74a>   DW_AT_decl_column : 33
    <74b>   DW_AT_type        : <0x642>
    <74f>   DW_AT_data_member_location: 124
 <2><750>: Abbrev Number: 13 (DW_TAG_member)
    <751>   DW_AT_name        : (indirect string, offset: 0xc74e9): ErrorCode
    <755>   DW_AT_decl_file   : 8
    <756>   DW_AT_decl_line   : 262
    <758>   DW_AT_decl_column : 33
    <759>   DW_AT_type        : <0xd4>
    <75d>   DW_AT_data_member_location: 128
 <2><75e>: Abbrev Number: 0
 <1><75f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <760>   DW_AT_byte_size   : 4
    <761>   DW_AT_type        : <0x324>
 <1><765>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <766>   DW_AT_byte_size   : 4
    <767>   DW_AT_type        : <0xb2>
 <1><76b>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <76c>   DW_AT_prototyped  : 1
    <76c>   DW_AT_sibling     : <0x776>
 <2><770>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <771>   DW_AT_type        : <0x776>
 <2><775>: Abbrev Number: 0
 <1><776>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <777>   DW_AT_byte_size   : 4
    <778>   DW_AT_type        : <0x658>
 <1><77c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <77d>   DW_AT_byte_size   : 4
    <77e>   DW_AT_type        : <0x76b>
 <1><782>: Abbrev Number: 14 (DW_TAG_typedef)
    <783>   DW_AT_name        : (indirect string, offset: 0x76564): UART_HandleTypeDef
    <787>   DW_AT_decl_file   : 8
    <788>   DW_AT_decl_line   : 284
    <78a>   DW_AT_decl_column : 3
    <78b>   DW_AT_type        : <0x658>
 <1><78f>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <790>   DW_AT_encoding    : 5	(signed)
    <791>   DW_AT_byte_size   : 4
    <792>   DW_AT_type        : <0x29>
    <796>   DW_AT_decl_file   : 9
    <797>   DW_AT_decl_line   : 82
    <798>   DW_AT_decl_column : 14
    <799>   DW_AT_sibling     : <0x8df>
 <2><79d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <79e>   DW_AT_name        : (indirect string, offset: 0x3c1d1): osPriorityNone
    <7a2>   DW_AT_const_value : 0
 <2><7a3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7a4>   DW_AT_name        : (indirect string, offset: 0xb0da7): osPriorityIdle
    <7a8>   DW_AT_const_value : 1
 <2><7a9>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7aa>   DW_AT_name        : (indirect string, offset: 0xbbb31): osPriorityLow
    <7ae>   DW_AT_const_value : 8
 <2><7af>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7b0>   DW_AT_name        : (indirect string, offset: 0xa2d96): osPriorityLow1
    <7b4>   DW_AT_const_value : 9
 <2><7b5>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xc1548): osPriorityLow2
    <7ba>   DW_AT_const_value : 10
 <2><7bb>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7bc>   DW_AT_name        : (indirect string, offset: 0xc1557): osPriorityLow3
    <7c0>   DW_AT_const_value : 11
 <2><7c1>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7c2>   DW_AT_name        : (indirect string, offset: 0xc1566): osPriorityLow4
    <7c6>   DW_AT_const_value : 12
 <2><7c7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7c8>   DW_AT_name        : (indirect string, offset: 0xc1575): osPriorityLow5
    <7cc>   DW_AT_const_value : 13
 <2><7cd>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7ce>   DW_AT_name        : (indirect string, offset: 0xc1584): osPriorityLow6
    <7d2>   DW_AT_const_value : 14
 <2><7d3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7d4>   DW_AT_name        : (indirect string, offset: 0x4bfb1): osPriorityLow7
    <7d8>   DW_AT_const_value : 15
 <2><7d9>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7da>   DW_AT_name        : (indirect string, offset: 0xc3bae): osPriorityBelowNormal
    <7de>   DW_AT_const_value : 16
 <2><7df>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7e0>   DW_AT_name        : (indirect string, offset: 0x7a75c): osPriorityBelowNormal1
    <7e4>   DW_AT_const_value : 17
 <2><7e5>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7e6>   DW_AT_name        : (indirect string, offset: 0xacd85): osPriorityBelowNormal2
    <7ea>   DW_AT_const_value : 18
 <2><7eb>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7ec>   DW_AT_name        : (indirect string, offset: 0x8b3a3): osPriorityBelowNormal3
    <7f0>   DW_AT_const_value : 19
 <2><7f1>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7f2>   DW_AT_name        : (indirect string, offset: 0xacdb4): osPriorityBelowNormal4
    <7f6>   DW_AT_const_value : 20
 <2><7f7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7f8>   DW_AT_name        : (indirect string, offset: 0xacdcb): osPriorityBelowNormal5
    <7fc>   DW_AT_const_value : 21
 <2><7fd>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7fe>   DW_AT_name        : (indirect string, offset: 0xacde2): osPriorityBelowNormal6
    <802>   DW_AT_const_value : 22
 <2><803>: Abbrev Number: 18 (DW_TAG_enumerator)
    <804>   DW_AT_name        : (indirect string, offset: 0x9c00d): osPriorityBelowNormal7
    <808>   DW_AT_const_value : 23
 <2><809>: Abbrev Number: 18 (DW_TAG_enumerator)
    <80a>   DW_AT_name        : (indirect string, offset: 0xa5e12): osPriorityNormal
    <80e>   DW_AT_const_value : 24
 <2><80f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <810>   DW_AT_name        : (indirect string, offset: 0x202eb): osPriorityNormal1
    <814>   DW_AT_const_value : 25
 <2><815>: Abbrev Number: 18 (DW_TAG_enumerator)
    <816>   DW_AT_name        : (indirect string, offset: 0x202fd): osPriorityNormal2
    <81a>   DW_AT_const_value : 26
 <2><81b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <81c>   DW_AT_name        : (indirect string, offset: 0x2030f): osPriorityNormal3
    <820>   DW_AT_const_value : 27
 <2><821>: Abbrev Number: 18 (DW_TAG_enumerator)
    <822>   DW_AT_name        : (indirect string, offset: 0x20321): osPriorityNormal4
    <826>   DW_AT_const_value : 28
 <2><827>: Abbrev Number: 18 (DW_TAG_enumerator)
    <828>   DW_AT_name        : (indirect string, offset: 0x9a4c6): osPriorityNormal5
    <82c>   DW_AT_const_value : 29
 <2><82d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <82e>   DW_AT_name        : (indirect string, offset: 0x20359): osPriorityNormal6
    <832>   DW_AT_const_value : 30
 <2><833>: Abbrev Number: 18 (DW_TAG_enumerator)
    <834>   DW_AT_name        : (indirect string, offset: 0x2036b): osPriorityNormal7
    <838>   DW_AT_const_value : 31
 <2><839>: Abbrev Number: 18 (DW_TAG_enumerator)
    <83a>   DW_AT_name        : (indirect string, offset: 0x83373): osPriorityAboveNormal
    <83e>   DW_AT_const_value : 32
 <2><83f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <840>   DW_AT_name        : (indirect string, offset: 0xcb4ba): osPriorityAboveNormal1
    <844>   DW_AT_const_value : 33
 <2><845>: Abbrev Number: 18 (DW_TAG_enumerator)
    <846>   DW_AT_name        : (indirect string, offset: 0xcb4d1): osPriorityAboveNormal2
    <84a>   DW_AT_const_value : 34
 <2><84b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <84c>   DW_AT_name        : (indirect string, offset: 0xcb4e8): osPriorityAboveNormal3
    <850>   DW_AT_const_value : 35
 <2><851>: Abbrev Number: 18 (DW_TAG_enumerator)
    <852>   DW_AT_name        : (indirect string, offset: 0xcb4ff): osPriorityAboveNormal4
    <856>   DW_AT_const_value : 36
 <2><857>: Abbrev Number: 18 (DW_TAG_enumerator)
    <858>   DW_AT_name        : (indirect string, offset: 0xb4122): osPriorityAboveNormal5
    <85c>   DW_AT_const_value : 37
 <2><85d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <85e>   DW_AT_name        : (indirect string, offset: 0xcb52c): osPriorityAboveNormal6
    <862>   DW_AT_const_value : 38
 <2><863>: Abbrev Number: 18 (DW_TAG_enumerator)
    <864>   DW_AT_name        : (indirect string, offset: 0xcb543): osPriorityAboveNormal7
    <868>   DW_AT_const_value : 39
 <2><869>: Abbrev Number: 18 (DW_TAG_enumerator)
    <86a>   DW_AT_name        : (indirect string, offset: 0x4894e): osPriorityHigh
    <86e>   DW_AT_const_value : 40
 <2><86f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <870>   DW_AT_name        : (indirect string, offset: 0x87905): osPriorityHigh1
    <874>   DW_AT_const_value : 41
 <2><875>: Abbrev Number: 18 (DW_TAG_enumerator)
    <876>   DW_AT_name        : (indirect string, offset: 0x87915): osPriorityHigh2
    <87a>   DW_AT_const_value : 42
 <2><87b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <87c>   DW_AT_name        : (indirect string, offset: 0x87925): osPriorityHigh3
    <880>   DW_AT_const_value : 43
 <2><881>: Abbrev Number: 18 (DW_TAG_enumerator)
    <882>   DW_AT_name        : (indirect string, offset: 0x87935): osPriorityHigh4
    <886>   DW_AT_const_value : 44
 <2><887>: Abbrev Number: 18 (DW_TAG_enumerator)
    <888>   DW_AT_name        : (indirect string, offset: 0x43b3): osPriorityHigh5
    <88c>   DW_AT_const_value : 45
 <2><88d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <88e>   DW_AT_name        : (indirect string, offset: 0x87971): osPriorityHigh6
    <892>   DW_AT_const_value : 46
 <2><893>: Abbrev Number: 18 (DW_TAG_enumerator)
    <894>   DW_AT_name        : (indirect string, offset: 0x87981): osPriorityHigh7
    <898>   DW_AT_const_value : 47
 <2><899>: Abbrev Number: 18 (DW_TAG_enumerator)
    <89a>   DW_AT_name        : (indirect string, offset: 0xb8743): osPriorityRealtime
    <89e>   DW_AT_const_value : 48
 <2><89f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8a0>   DW_AT_name        : (indirect string, offset: 0x80552): osPriorityRealtime1
    <8a4>   DW_AT_const_value : 49
 <2><8a5>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8a6>   DW_AT_name        : (indirect string, offset: 0x80566): osPriorityRealtime2
    <8aa>   DW_AT_const_value : 50
 <2><8ab>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x8057a): osPriorityRealtime3
    <8b0>   DW_AT_const_value : 51
 <2><8b1>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8b2>   DW_AT_name        : (indirect string, offset: 0x8058e): osPriorityRealtime4
    <8b6>   DW_AT_const_value : 52
 <2><8b7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8b8>   DW_AT_name        : (indirect string, offset: 0x805a2): osPriorityRealtime5
    <8bc>   DW_AT_const_value : 53
 <2><8bd>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8be>   DW_AT_name        : (indirect string, offset: 0x805b6): osPriorityRealtime6
    <8c2>   DW_AT_const_value : 54
 <2><8c3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8c4>   DW_AT_name        : (indirect string, offset: 0x805ca): osPriorityRealtime7
    <8c8>   DW_AT_const_value : 55
 <2><8c9>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8ca>   DW_AT_name        : (indirect string, offset: 0xd14): osPriorityISR
    <8ce>   DW_AT_const_value : 56
 <2><8cf>: Abbrev Number: 22 (DW_TAG_enumerator)
    <8d0>   DW_AT_name        : (indirect string, offset: 0xb3c52): osPriorityError
    <8d4>   DW_AT_const_value : -1
 <2><8d5>: Abbrev Number: 23 (DW_TAG_enumerator)
    <8d6>   DW_AT_name        : (indirect string, offset: 0xc1b51): osPriorityReserved
    <8da>   DW_AT_const_value : 0x7fffffff
 <2><8de>: Abbrev Number: 0
 <1><8df>: Abbrev Number: 3 (DW_TAG_typedef)
    <8e0>   DW_AT_name        : (indirect string, offset: 0x962ec): osPriority_t
    <8e4>   DW_AT_decl_file   : 9
    <8e5>   DW_AT_decl_line   : 136
    <8e6>   DW_AT_decl_column : 3
    <8e7>   DW_AT_type        : <0x78f>
 <1><8eb>: Abbrev Number: 3 (DW_TAG_typedef)
    <8ec>   DW_AT_name        : (indirect string, offset: 0x6ec52): osThreadFunc_t
    <8f0>   DW_AT_decl_file   : 9
    <8f1>   DW_AT_decl_line   : 139
    <8f2>   DW_AT_decl_column : 16
    <8f3>   DW_AT_type        : <0xd9>
 <1><8f7>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <8f8>   DW_AT_encoding    : 5	(signed)
    <8f9>   DW_AT_byte_size   : 4
    <8fa>   DW_AT_type        : <0x29>
    <8fe>   DW_AT_decl_file   : 9
    <8ff>   DW_AT_decl_line   : 176
    <900>   DW_AT_decl_column : 14
    <901>   DW_AT_sibling     : <0x939>
 <2><905>: Abbrev Number: 18 (DW_TAG_enumerator)
    <906>   DW_AT_name        : (indirect string, offset: 0x9ce25): osOK
    <90a>   DW_AT_const_value : 0
 <2><90b>: Abbrev Number: 22 (DW_TAG_enumerator)
    <90c>   DW_AT_name        : (indirect string, offset: 0x5e7a6): osError
    <910>   DW_AT_const_value : -1
 <2><911>: Abbrev Number: 22 (DW_TAG_enumerator)
    <912>   DW_AT_name        : (indirect string, offset: 0x22b9b): osErrorTimeout
    <916>   DW_AT_const_value : -2
 <2><917>: Abbrev Number: 22 (DW_TAG_enumerator)
    <918>   DW_AT_name        : (indirect string, offset: 0x85cf7): osErrorResource
    <91c>   DW_AT_const_value : -3
 <2><91d>: Abbrev Number: 22 (DW_TAG_enumerator)
    <91e>   DW_AT_name        : (indirect string, offset: 0x34d3b): osErrorParameter
    <922>   DW_AT_const_value : -4
 <2><923>: Abbrev Number: 22 (DW_TAG_enumerator)
    <924>   DW_AT_name        : (indirect string, offset: 0x2328f): osErrorNoMemory
    <928>   DW_AT_const_value : -5
 <2><929>: Abbrev Number: 22 (DW_TAG_enumerator)
    <92a>   DW_AT_name        : (indirect string, offset: 0x36dfa): osErrorISR
    <92e>   DW_AT_const_value : -6
 <2><92f>: Abbrev Number: 23 (DW_TAG_enumerator)
    <930>   DW_AT_name        : (indirect string, offset: 0x6744f): osStatusReserved
    <934>   DW_AT_const_value : 0x7fffffff
 <2><938>: Abbrev Number: 0
 <1><939>: Abbrev Number: 3 (DW_TAG_typedef)
    <93a>   DW_AT_name        : (indirect string, offset: 0x45144): osStatus_t
    <93e>   DW_AT_decl_file   : 9
    <93f>   DW_AT_decl_line   : 185
    <940>   DW_AT_decl_column : 3
    <941>   DW_AT_type        : <0x8f7>
 <1><945>: Abbrev Number: 3 (DW_TAG_typedef)
    <946>   DW_AT_name        : (indirect string, offset: 0x25092): osThreadId_t
    <94a>   DW_AT_decl_file   : 9
    <94b>   DW_AT_decl_line   : 189
    <94c>   DW_AT_decl_column : 15
    <94d>   DW_AT_type        : <0xea>
 <1><951>: Abbrev Number: 3 (DW_TAG_typedef)
    <952>   DW_AT_name        : (indirect string, offset: 0x894e8): TZ_ModuleId_t
    <956>   DW_AT_decl_file   : 9
    <957>   DW_AT_decl_line   : 213
    <958>   DW_AT_decl_column : 18
    <959>   DW_AT_type        : <0xc8>
 <1><95d>: Abbrev Number: 19 (DW_TAG_structure_type)
    <95e>   DW_AT_byte_size   : 36
    <95f>   DW_AT_decl_file   : 9
    <960>   DW_AT_decl_line   : 218
    <961>   DW_AT_decl_column : 9
    <962>   DW_AT_sibling     : <0x9dc>
 <2><966>: Abbrev Number: 20 (DW_TAG_member)
    <967>   DW_AT_name        : (indirect string, offset: 0x17d3d): name
    <96b>   DW_AT_decl_file   : 9
    <96c>   DW_AT_decl_line   : 219
    <96d>   DW_AT_decl_column : 33
    <96e>   DW_AT_type        : <0x104>
    <972>   DW_AT_data_member_location: 0
 <2><973>: Abbrev Number: 20 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0x85a3b): attr_bits
    <978>   DW_AT_decl_file   : 9
    <979>   DW_AT_decl_line   : 220
    <97a>   DW_AT_decl_column : 28
    <97b>   DW_AT_type        : <0xc8>
    <97f>   DW_AT_data_member_location: 4
 <2><980>: Abbrev Number: 20 (DW_TAG_member)
    <981>   DW_AT_name        : (indirect string, offset: 0x278e5): cb_mem
    <985>   DW_AT_decl_file   : 9
    <986>   DW_AT_decl_line   : 221
    <987>   DW_AT_decl_column : 30
    <988>   DW_AT_type        : <0xea>
    <98c>   DW_AT_data_member_location: 8
 <2><98d>: Abbrev Number: 20 (DW_TAG_member)
    <98e>   DW_AT_name        : (indirect string, offset: 0xc0d18): cb_size
    <992>   DW_AT_decl_file   : 9
    <993>   DW_AT_decl_line   : 222
    <994>   DW_AT_decl_column : 30
    <995>   DW_AT_type        : <0xc8>
    <999>   DW_AT_data_member_location: 12
 <2><99a>: Abbrev Number: 20 (DW_TAG_member)
    <99b>   DW_AT_name        : (indirect string, offset: 0xb905e): stack_mem
    <99f>   DW_AT_decl_file   : 9
    <9a0>   DW_AT_decl_line   : 223
    <9a1>   DW_AT_decl_column : 27
    <9a2>   DW_AT_type        : <0xea>
    <9a6>   DW_AT_data_member_location: 16
 <2><9a7>: Abbrev Number: 20 (DW_TAG_member)
    <9a8>   DW_AT_name        : (indirect string, offset: 0x8062f): stack_size
    <9ac>   DW_AT_decl_file   : 9
    <9ad>   DW_AT_decl_line   : 224
    <9ae>   DW_AT_decl_column : 27
    <9af>   DW_AT_type        : <0xc8>
    <9b3>   DW_AT_data_member_location: 20
 <2><9b4>: Abbrev Number: 20 (DW_TAG_member)
    <9b5>   DW_AT_name        : (indirect string, offset: 0x50fb2): priority
    <9b9>   DW_AT_decl_file   : 9
    <9ba>   DW_AT_decl_line   : 225
    <9bb>   DW_AT_decl_column : 29
    <9bc>   DW_AT_type        : <0x8df>
    <9c0>   DW_AT_data_member_location: 24
 <2><9c1>: Abbrev Number: 20 (DW_TAG_member)
    <9c2>   DW_AT_name        : (indirect string, offset: 0x570c6): tz_module
    <9c6>   DW_AT_decl_file   : 9
    <9c7>   DW_AT_decl_line   : 226
    <9c8>   DW_AT_decl_column : 28
    <9c9>   DW_AT_type        : <0x951>
    <9cd>   DW_AT_data_member_location: 28
 <2><9ce>: Abbrev Number: 20 (DW_TAG_member)
    <9cf>   DW_AT_name        : (indirect string, offset: 0xb6da0): reserved
    <9d3>   DW_AT_decl_file   : 9
    <9d4>   DW_AT_decl_line   : 227
    <9d5>   DW_AT_decl_column : 29
    <9d6>   DW_AT_type        : <0xc8>
    <9da>   DW_AT_data_member_location: 32
 <2><9db>: Abbrev Number: 0
 <1><9dc>: Abbrev Number: 3 (DW_TAG_typedef)
    <9dd>   DW_AT_name        : (indirect string, offset: 0x20125): osThreadAttr_t
    <9e1>   DW_AT_decl_file   : 9
    <9e2>   DW_AT_decl_line   : 228
    <9e3>   DW_AT_decl_column : 3
    <9e4>   DW_AT_type        : <0x95d>
 <1><9e8>: Abbrev Number: 5 (DW_TAG_const_type)
    <9e9>   DW_AT_type        : <0x9dc>
 <1><9ed>: Abbrev Number: 24 (DW_TAG_variable)
    <9ee>   DW_AT_name        : (indirect string, offset: 0x6df09): huart2
    <9f2>   DW_AT_decl_file   : 10
    <9f3>   DW_AT_decl_line   : 35
    <9f4>   DW_AT_decl_column : 27
    <9f5>   DW_AT_type        : <0x782>
    <9f9>   DW_AT_external    : 1
    <9f9>   DW_AT_declaration : 1
 <1><9f9>: Abbrev Number: 15 (DW_TAG_array_type)
    <9fa>   DW_AT_type        : <0xff>
    <9fe>   DW_AT_sibling     : <0xa04>
 <2><a02>: Abbrev Number: 25 (DW_TAG_subrange_type)
 <2><a03>: Abbrev Number: 0
 <1><a04>: Abbrev Number: 5 (DW_TAG_const_type)
    <a05>   DW_AT_type        : <0x9f9>
 <1><a09>: Abbrev Number: 24 (DW_TAG_variable)
    <a0a>   DW_AT_name        : (indirect string, offset: 0xc9cbd): _ctype_
    <a0e>   DW_AT_decl_file   : 11
    <a0f>   DW_AT_decl_line   : 70
    <a10>   DW_AT_decl_column : 28
    <a11>   DW_AT_type        : <0xa04>
    <a15>   DW_AT_external    : 1
    <a15>   DW_AT_declaration : 1
 <1><a15>: Abbrev Number: 26 (DW_TAG_variable)
    <a16>   DW_AT_name        : (indirect string, offset: 0xd759): ledDelay
    <a1a>   DW_AT_decl_file   : 1
    <a1b>   DW_AT_decl_line   : 54
    <a1c>   DW_AT_decl_column : 17
    <a1d>   DW_AT_type        : <0xb7>
    <a21>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><a27>: Abbrev Number: 27 (DW_TAG_variable)
    <a28>   DW_AT_name        : (indirect string, offset: 0x99d7): UART_taskHandle
    <a2c>   DW_AT_decl_file   : 1
    <a2d>   DW_AT_decl_line   : 58
    <a2e>   DW_AT_decl_column : 14
    <a2f>   DW_AT_type        : <0x945>
    <a33>   DW_AT_external    : 1
    <a33>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><a39>: Abbrev Number: 27 (DW_TAG_variable)
    <a3a>   DW_AT_name        : (indirect string, offset: 0x92a04): UART_task_attributes
    <a3e>   DW_AT_decl_file   : 1
    <a3f>   DW_AT_decl_line   : 59
    <a40>   DW_AT_decl_column : 22
    <a41>   DW_AT_type        : <0x9e8>
    <a45>   DW_AT_external    : 1
    <a45>   DW_AT_location    : 5 byte block: 3 7c 6e 0 8 	(DW_OP_addr: 8006e7c)
 <1><a4b>: Abbrev Number: 27 (DW_TAG_variable)
    <a4c>   DW_AT_name        : (indirect string, offset: 0x40189): blinkLED_taskHandle
    <a50>   DW_AT_decl_file   : 1
    <a51>   DW_AT_decl_line   : 65
    <a52>   DW_AT_decl_column : 14
    <a53>   DW_AT_type        : <0x945>
    <a57>   DW_AT_external    : 1
    <a57>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><a5d>: Abbrev Number: 27 (DW_TAG_variable)
    <a5e>   DW_AT_name        : (indirect string, offset: 0x4821f): blinkLED_task_attributes
    <a62>   DW_AT_decl_file   : 1
    <a63>   DW_AT_decl_line   : 66
    <a64>   DW_AT_decl_column : 22
    <a65>   DW_AT_type        : <0x9e8>
    <a69>   DW_AT_external    : 1
    <a69>   DW_AT_location    : 5 byte block: 3 a0 6e 0 8 	(DW_OP_addr: 8006ea0)
 <1><a6f>: Abbrev Number: 28 (DW_TAG_subprogram)
    <a70>   DW_AT_external    : 1
    <a70>   DW_AT_name        : (indirect string, offset: 0xc9b65): osDelay
    <a74>   DW_AT_decl_file   : 9
    <a75>   DW_AT_decl_line   : 459
    <a77>   DW_AT_decl_column : 12
    <a78>   DW_AT_prototyped  : 1
    <a78>   DW_AT_type        : <0x939>
    <a7c>   DW_AT_declaration : 1
    <a7c>   DW_AT_sibling     : <0xa86>
 <2><a80>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a81>   DW_AT_type        : <0xc8>
 <2><a85>: Abbrev Number: 0
 <1><a86>: Abbrev Number: 29 (DW_TAG_subprogram)
    <a87>   DW_AT_external    : 1
    <a87>   DW_AT_name        : (indirect string, offset: 0x3d8a1): HAL_GPIO_TogglePin
    <a8b>   DW_AT_decl_file   : 15
    <a8c>   DW_AT_decl_line   : 297
    <a8e>   DW_AT_decl_column : 19
    <a8f>   DW_AT_prototyped  : 1
    <a8f>   DW_AT_declaration : 1
    <a8f>   DW_AT_sibling     : <0xa9e>
 <2><a93>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a94>   DW_AT_type        : <0xa9e>
 <2><a98>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a99>   DW_AT_type        : <0xb7>
 <2><a9d>: Abbrev Number: 0
 <1><a9e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a9f>   DW_AT_byte_size   : 4
    <aa0>   DW_AT_type        : <0x23a>
 <1><aa4>: Abbrev Number: 30 (DW_TAG_subprogram)
    <aa5>   DW_AT_external    : 1
    <aa5>   DW_AT_name        : (indirect string, offset: 0xc1be0): memset
    <aa9>   DW_AT_decl_file   : 12
    <aaa>   DW_AT_decl_line   : 33
    <aab>   DW_AT_decl_column : 9
    <aac>   DW_AT_prototyped  : 1
    <aac>   DW_AT_type        : <0xea>
    <ab0>   DW_AT_declaration : 1
    <ab0>   DW_AT_sibling     : <0xac4>
 <2><ab4>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ab5>   DW_AT_type        : <0xea>
 <2><ab9>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <aba>   DW_AT_type        : <0x29>
 <2><abe>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <abf>   DW_AT_type        : <0x30>
 <2><ac3>: Abbrev Number: 0
 <1><ac4>: Abbrev Number: 30 (DW_TAG_subprogram)
    <ac5>   DW_AT_external    : 1
    <ac5>   DW_AT_name        : (indirect string, offset: 0x35383): sprintf
    <ac9>   DW_AT_decl_file   : 13
    <aca>   DW_AT_decl_line   : 244
    <acb>   DW_AT_decl_column : 5
    <acc>   DW_AT_prototyped  : 1
    <acc>   DW_AT_type        : <0x29>
    <ad0>   DW_AT_declaration : 1
    <ad0>   DW_AT_sibling     : <0xae0>
 <2><ad4>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ad5>   DW_AT_type        : <0xf2>
 <2><ad9>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ada>   DW_AT_type        : <0x104>
 <2><ade>: Abbrev Number: 31 (DW_TAG_unspecified_parameters)
 <2><adf>: Abbrev Number: 0
 <1><ae0>: Abbrev Number: 30 (DW_TAG_subprogram)
    <ae1>   DW_AT_external    : 1
    <ae1>   DW_AT_name        : (indirect string, offset: 0x685aa): atoi
    <ae5>   DW_AT_decl_file   : 14
    <ae6>   DW_AT_decl_line   : 81
    <ae7>   DW_AT_decl_column : 5
    <ae8>   DW_AT_prototyped  : 1
    <ae8>   DW_AT_type        : <0x29>
    <aec>   DW_AT_declaration : 1
    <aec>   DW_AT_sibling     : <0xaf6>
 <2><af0>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <af1>   DW_AT_type        : <0x104>
 <2><af5>: Abbrev Number: 0
 <1><af6>: Abbrev Number: 28 (DW_TAG_subprogram)
    <af7>   DW_AT_external    : 1
    <af7>   DW_AT_name        : (indirect string, offset: 0x5bdf6): HAL_UART_Receive
    <afb>   DW_AT_decl_file   : 8
    <afc>   DW_AT_decl_line   : 1675
    <afe>   DW_AT_decl_column : 19
    <aff>   DW_AT_prototyped  : 1
    <aff>   DW_AT_type        : <0x358>
    <b03>   DW_AT_declaration : 1
    <b03>   DW_AT_sibling     : <0xb1c>
 <2><b07>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b08>   DW_AT_type        : <0xb1c>
 <2><b0c>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b0d>   DW_AT_type        : <0xec>
 <2><b11>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b12>   DW_AT_type        : <0xb7>
 <2><b16>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b17>   DW_AT_type        : <0xc8>
 <2><b1b>: Abbrev Number: 0
 <1><b1c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b1d>   DW_AT_byte_size   : 4
    <b1e>   DW_AT_type        : <0x782>
 <1><b22>: Abbrev Number: 28 (DW_TAG_subprogram)
    <b23>   DW_AT_external    : 1
    <b23>   DW_AT_name        : (indirect string, offset: 0x42df9): HAL_UART_Transmit
    <b27>   DW_AT_decl_file   : 8
    <b28>   DW_AT_decl_line   : 1674
    <b2a>   DW_AT_decl_column : 19
    <b2b>   DW_AT_prototyped  : 1
    <b2b>   DW_AT_type        : <0x358>
    <b2f>   DW_AT_declaration : 1
    <b2f>   DW_AT_sibling     : <0xb48>
 <2><b33>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b34>   DW_AT_type        : <0xb1c>
 <2><b38>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b39>   DW_AT_type        : <0x765>
 <2><b3d>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b3e>   DW_AT_type        : <0xb7>
 <2><b42>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b43>   DW_AT_type        : <0xc8>
 <2><b47>: Abbrev Number: 0
 <1><b48>: Abbrev Number: 30 (DW_TAG_subprogram)
    <b49>   DW_AT_external    : 1
    <b49>   DW_AT_name        : (indirect string, offset: 0x451e9): strlen
    <b4d>   DW_AT_decl_file   : 12
    <b4e>   DW_AT_decl_line   : 41
    <b4f>   DW_AT_decl_column : 9
    <b50>   DW_AT_prototyped  : 1
    <b50>   DW_AT_type        : <0x30>
    <b54>   DW_AT_declaration : 1
    <b54>   DW_AT_sibling     : <0xb5e>
 <2><b58>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b59>   DW_AT_type        : <0x104>
 <2><b5d>: Abbrev Number: 0
 <1><b5e>: Abbrev Number: 28 (DW_TAG_subprogram)
    <b5f>   DW_AT_external    : 1
    <b5f>   DW_AT_name        : (indirect string, offset: 0x71a9b): osThreadNew
    <b63>   DW_AT_decl_file   : 9
    <b64>   DW_AT_decl_line   : 349
    <b66>   DW_AT_decl_column : 14
    <b67>   DW_AT_prototyped  : 1
    <b67>   DW_AT_type        : <0x945>
    <b6b>   DW_AT_declaration : 1
    <b6b>   DW_AT_sibling     : <0xb7f>
 <2><b6f>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b70>   DW_AT_type        : <0x8eb>
 <2><b74>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b75>   DW_AT_type        : <0xea>
 <2><b79>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b7a>   DW_AT_type        : <0xb7f>
 <2><b7e>: Abbrev Number: 0
 <1><b7f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b80>   DW_AT_byte_size   : 4
    <b81>   DW_AT_type        : <0x9e8>
 <1><b85>: Abbrev Number: 32 (DW_TAG_subprogram)
    <b86>   DW_AT_external    : 1
    <b86>   DW_AT_name        : (indirect string, offset: 0x6dbbc): BlinkLED
    <b8a>   DW_AT_decl_file   : 1
    <b8b>   DW_AT_decl_line   : 182
    <b8c>   DW_AT_decl_column : 6
    <b8d>   DW_AT_prototyped  : 1
    <b8d>   DW_AT_low_pc      : 0x8000768
    <b91>   DW_AT_high_pc     : 0x28
    <b95>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b97>   DW_AT_GNU_all_tail_call_sites: 1
    <b97>   DW_AT_sibling     : <0xbba>
 <2><b9b>: Abbrev Number: 33 (DW_TAG_formal_parameter)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x2b67a): argument
    <ba0>   DW_AT_decl_file   : 1
    <ba1>   DW_AT_decl_line   : 182
    <ba2>   DW_AT_decl_column : 21
    <ba3>   DW_AT_type        : <0xea>
    <ba7>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><baa>: Abbrev Number: 26 (DW_TAG_variable)
    <bab>   DW_AT_name        : (indirect string, offset: 0x4ba28): current_delay
    <baf>   DW_AT_decl_file   : 1
    <bb0>   DW_AT_decl_line   : 186
    <bb1>   DW_AT_decl_column : 11
    <bb2>   DW_AT_type        : <0xb7>
    <bb6>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><bb9>: Abbrev Number: 0
 <1><bba>: Abbrev Number: 32 (DW_TAG_subprogram)
    <bbb>   DW_AT_external    : 1
    <bbb>   DW_AT_name        : (indirect string, offset: 0xa1ede): UARTThread
    <bbf>   DW_AT_decl_file   : 1
    <bc0>   DW_AT_decl_line   : 132
    <bc1>   DW_AT_decl_column : 6
    <bc2>   DW_AT_prototyped  : 1
    <bc2>   DW_AT_low_pc      : 0x80005c4
    <bc6>   DW_AT_high_pc     : 0x1a4
    <bca>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bcc>   DW_AT_GNU_all_tail_call_sites: 1
    <bcc>   DW_AT_sibling     : <0xc2f>
 <2><bd0>: Abbrev Number: 33 (DW_TAG_formal_parameter)
    <bd1>   DW_AT_name        : (indirect string, offset: 0x2b67a): argument
    <bd5>   DW_AT_decl_file   : 1
    <bd6>   DW_AT_decl_line   : 132
    <bd7>   DW_AT_decl_column : 23
    <bd8>   DW_AT_type        : <0xea>
    <bdc>   DW_AT_location    : 3 byte block: 91 cc 7d 	(DW_OP_fbreg: -308)
 <2><be0>: Abbrev Number: 26 (DW_TAG_variable)
    <be1>   DW_AT_name        : (indirect string, offset: 0x2395f): txBuffer
    <be5>   DW_AT_decl_file   : 1
    <be6>   DW_AT_decl_line   : 136
    <be7>   DW_AT_decl_column : 7
    <be8>   DW_AT_type        : <0xc2f>
    <bec>   DW_AT_location    : 3 byte block: 91 e0 7d 	(DW_OP_fbreg: -288)
 <2><bf0>: Abbrev Number: 26 (DW_TAG_variable)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x53eb0): rxBuffer
    <bf5>   DW_AT_decl_file   : 1
    <bf6>   DW_AT_decl_line   : 138
    <bf7>   DW_AT_decl_column : 7
    <bf8>   DW_AT_type        : <0xc3f>
    <bfc>   DW_AT_location    : 3 byte block: 91 d8 7d 	(DW_OP_fbreg: -296)
 <2><c00>: Abbrev Number: 26 (DW_TAG_variable)
    <c01>   DW_AT_name        : (indirect string, offset: 0x1f2e5): rxByte
    <c05>   DW_AT_decl_file   : 1
    <c06>   DW_AT_decl_line   : 139
    <c07>   DW_AT_decl_column : 10
    <c08>   DW_AT_type        : <0xa6>
    <c0c>   DW_AT_location    : 3 byte block: 91 d7 7d 	(DW_OP_fbreg: -297)
 <2><c10>: Abbrev Number: 26 (DW_TAG_variable)
    <c11>   DW_AT_name        : (indirect string, offset: 0x36609): rxIndex
    <c15>   DW_AT_decl_file   : 1
    <c16>   DW_AT_decl_line   : 140
    <c17>   DW_AT_decl_column : 10
    <c18>   DW_AT_type        : <0xa6>
    <c1c>   DW_AT_location    : 2 byte block: 91 67 	(DW_OP_fbreg: -25)
 <2><c1f>: Abbrev Number: 26 (DW_TAG_variable)
    <c20>   DW_AT_name        : (indirect string, offset: 0x6e427): tmpDelay
    <c24>   DW_AT_decl_file   : 1
    <c25>   DW_AT_decl_line   : 141
    <c26>   DW_AT_decl_column : 15
    <c27>   DW_AT_type        : <0x3c>
    <c2b>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><c2e>: Abbrev Number: 0
 <1><c2f>: Abbrev Number: 15 (DW_TAG_array_type)
    <c30>   DW_AT_type        : <0xf8>
    <c34>   DW_AT_sibling     : <0xc3f>
 <2><c38>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <c39>   DW_AT_type        : <0x3c>
    <c3d>   DW_AT_upper_bound : 254
 <2><c3e>: Abbrev Number: 0
 <1><c3f>: Abbrev Number: 15 (DW_TAG_array_type)
    <c40>   DW_AT_type        : <0xf8>
    <c44>   DW_AT_sibling     : <0xc4f>
 <2><c48>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <c49>   DW_AT_type        : <0x3c>
    <c4d>   DW_AT_upper_bound : 5
 <2><c4e>: Abbrev Number: 0
 <1><c4f>: Abbrev Number: 34 (DW_TAG_subprogram)
    <c50>   DW_AT_external    : 1
    <c50>   DW_AT_name        : (indirect string, offset: 0xa3da2): MX_FREERTOS_Init
    <c54>   DW_AT_decl_file   : 1
    <c55>   DW_AT_decl_line   : 87
    <c56>   DW_AT_decl_column : 6
    <c57>   DW_AT_prototyped  : 1
    <c57>   DW_AT_low_pc      : 0x8000584
    <c5b>   DW_AT_high_pc     : 0x40
    <c5f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c61>   DW_AT_GNU_all_tail_call_sites: 1
 <1><c61>: Abbrev Number: 0
  Compilation Unit @ offset 0xc62:
   Length:        0x4ce (32-bit)
   Version:       4
   Abbrev Offset: 0x1e6
   Pointer Size:  4
 <0><c6d>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c6e>   DW_AT_producer    : (indirect string, offset: 0xc5fa5): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <c72>   DW_AT_language    : 12	(ANSI C99)
    <c73>   DW_AT_name        : (indirect string, offset: 0xcc7f4): ../Core/Src/gpio.c
    <c77>   DW_AT_comp_dir    : (indirect string, offset: 0x840f5): D:/FH Technikum - BIC/SS2023/EMBSYS - Embedded Systems/CubeIDE_Workspace/RTOS_Tutorial_Part3/Debug
    <c7b>   DW_AT_ranges      : 0x20
    <c7f>   DW_AT_low_pc      : 0x0
    <c83>   DW_AT_stmt_list   : 0xb86
    <c87>   DW_AT_GNU_macros  : 0x20373
 <1><c8b>: Abbrev Number: 2 (DW_TAG_base_type)
    <c8c>   DW_AT_byte_size   : 1
    <c8d>   DW_AT_encoding    : 6	(signed char)
    <c8e>   DW_AT_name        : (indirect string, offset: 0x668ab): signed char
 <1><c92>: Abbrev Number: 2 (DW_TAG_base_type)
    <c93>   DW_AT_byte_size   : 1
    <c94>   DW_AT_encoding    : 8	(unsigned char)
    <c95>   DW_AT_name        : (indirect string, offset: 0xc4bd7): unsigned char
 <1><c99>: Abbrev Number: 2 (DW_TAG_base_type)
    <c9a>   DW_AT_byte_size   : 2
    <c9b>   DW_AT_encoding    : 5	(signed)
    <c9c>   DW_AT_name        : (indirect string, offset: 0x97979): short int
 <1><ca0>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca1>   DW_AT_name        : (indirect string, offset: 0xa658c): __uint16_t
    <ca5>   DW_AT_decl_file   : 2
    <ca6>   DW_AT_decl_line   : 57
    <ca7>   DW_AT_decl_column : 25
    <ca8>   DW_AT_type        : <0xcac>
 <1><cac>: Abbrev Number: 2 (DW_TAG_base_type)
    <cad>   DW_AT_byte_size   : 2
    <cae>   DW_AT_encoding    : 7	(unsigned)
    <caf>   DW_AT_name        : (indirect string, offset: 0xc3334): short unsigned int
 <1><cb3>: Abbrev Number: 2 (DW_TAG_base_type)
    <cb4>   DW_AT_byte_size   : 4
    <cb5>   DW_AT_encoding    : 5	(signed)
    <cb6>   DW_AT_name        : (indirect string, offset: 0x1163e): long int
 <1><cba>: Abbrev Number: 3 (DW_TAG_typedef)
    <cbb>   DW_AT_name        : (indirect string, offset: 0x8248a): __uint32_t
    <cbf>   DW_AT_decl_file   : 2
    <cc0>   DW_AT_decl_line   : 79
    <cc1>   DW_AT_decl_column : 25
    <cc2>   DW_AT_type        : <0xcc6>
 <1><cc6>: Abbrev Number: 2 (DW_TAG_base_type)
    <cc7>   DW_AT_byte_size   : 4
    <cc8>   DW_AT_encoding    : 7	(unsigned)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x4e2c5): long unsigned int
 <1><ccd>: Abbrev Number: 2 (DW_TAG_base_type)
    <cce>   DW_AT_byte_size   : 8
    <ccf>   DW_AT_encoding    : 5	(signed)
    <cd0>   DW_AT_name        : (indirect string, offset: 0x5d43c): long long int
 <1><cd4>: Abbrev Number: 2 (DW_TAG_base_type)
    <cd5>   DW_AT_byte_size   : 8
    <cd6>   DW_AT_encoding    : 7	(unsigned)
    <cd7>   DW_AT_name        : (indirect string, offset: 0x2a392): long long unsigned int
 <1><cdb>: Abbrev Number: 4 (DW_TAG_base_type)
    <cdc>   DW_AT_byte_size   : 4
    <cdd>   DW_AT_encoding    : 5	(signed)
    <cde>   DW_AT_name        : int
 <1><ce2>: Abbrev Number: 2 (DW_TAG_base_type)
    <ce3>   DW_AT_byte_size   : 4
    <ce4>   DW_AT_encoding    : 7	(unsigned)
    <ce5>   DW_AT_name        : (indirect string, offset: 0x10c01): unsigned int
 <1><ce9>: Abbrev Number: 3 (DW_TAG_typedef)
    <cea>   DW_AT_name        : (indirect string, offset: 0x94b21): uint16_t
    <cee>   DW_AT_decl_file   : 3
    <cef>   DW_AT_decl_line   : 36
    <cf0>   DW_AT_decl_column : 20
    <cf1>   DW_AT_type        : <0xca0>
 <1><cf5>: Abbrev Number: 3 (DW_TAG_typedef)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x940d0): uint32_t
    <cfa>   DW_AT_decl_file   : 3
    <cfb>   DW_AT_decl_line   : 48
    <cfc>   DW_AT_decl_column : 20
    <cfd>   DW_AT_type        : <0xcba>
 <1><d01>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <d02>   DW_AT_type        : <0xcf5>
 <1><d06>: Abbrev Number: 6 (DW_TAG_structure_type)
    <d07>   DW_AT_byte_size   : 44
    <d08>   DW_AT_decl_file   : 4
    <d09>   DW_AT_decl_line   : 451
    <d0b>   DW_AT_decl_column : 9
    <d0c>   DW_AT_sibling     : <0xd9d>
 <2><d10>: Abbrev Number: 7 (DW_TAG_member)
    <d11>   DW_AT_name        : (indirect string, offset: 0x1586): MODER
    <d15>   DW_AT_decl_file   : 4
    <d16>   DW_AT_decl_line   : 453
    <d18>   DW_AT_decl_column : 17
    <d19>   DW_AT_type        : <0xd01>
    <d1d>   DW_AT_data_member_location: 0
 <2><d1e>: Abbrev Number: 7 (DW_TAG_member)
    <d1f>   DW_AT_name        : (indirect string, offset: 0x9da9d): OTYPER
    <d23>   DW_AT_decl_file   : 4
    <d24>   DW_AT_decl_line   : 454
    <d26>   DW_AT_decl_column : 17
    <d27>   DW_AT_type        : <0xd01>
    <d2b>   DW_AT_data_member_location: 4
 <2><d2c>: Abbrev Number: 7 (DW_TAG_member)
    <d2d>   DW_AT_name        : (indirect string, offset: 0xb1343): OSPEEDR
    <d31>   DW_AT_decl_file   : 4
    <d32>   DW_AT_decl_line   : 455
    <d34>   DW_AT_decl_column : 17
    <d35>   DW_AT_type        : <0xd01>
    <d39>   DW_AT_data_member_location: 8
 <2><d3a>: Abbrev Number: 7 (DW_TAG_member)
    <d3b>   DW_AT_name        : (indirect string, offset: 0x845e3): PUPDR
    <d3f>   DW_AT_decl_file   : 4
    <d40>   DW_AT_decl_line   : 456
    <d42>   DW_AT_decl_column : 17
    <d43>   DW_AT_type        : <0xd01>
    <d47>   DW_AT_data_member_location: 12
 <2><d48>: Abbrev Number: 8 (DW_TAG_member)
    <d49>   DW_AT_name        : IDR
    <d4d>   DW_AT_decl_file   : 4
    <d4e>   DW_AT_decl_line   : 457
    <d50>   DW_AT_decl_column : 17
    <d51>   DW_AT_type        : <0xd01>
    <d55>   DW_AT_data_member_location: 16
 <2><d56>: Abbrev Number: 8 (DW_TAG_member)
    <d57>   DW_AT_name        : ODR
    <d5b>   DW_AT_decl_file   : 4
    <d5c>   DW_AT_decl_line   : 458
    <d5e>   DW_AT_decl_column : 17
    <d5f>   DW_AT_type        : <0xd01>
    <d63>   DW_AT_data_member_location: 20
 <2><d64>: Abbrev Number: 7 (DW_TAG_member)
    <d65>   DW_AT_name        : (indirect string, offset: 0x2d637): BSRR
    <d69>   DW_AT_decl_file   : 4
    <d6a>   DW_AT_decl_line   : 459
    <d6c>   DW_AT_decl_column : 17
    <d6d>   DW_AT_type        : <0xd01>
    <d71>   DW_AT_data_member_location: 24
 <2><d72>: Abbrev Number: 7 (DW_TAG_member)
    <d73>   DW_AT_name        : (indirect string, offset: 0xaebf6): LCKR
    <d77>   DW_AT_decl_file   : 4
    <d78>   DW_AT_decl_line   : 460
    <d7a>   DW_AT_decl_column : 17
    <d7b>   DW_AT_type        : <0xd01>
    <d7f>   DW_AT_data_member_location: 28
 <2><d80>: Abbrev Number: 8 (DW_TAG_member)
    <d81>   DW_AT_name        : AFR
    <d85>   DW_AT_decl_file   : 4
    <d86>   DW_AT_decl_line   : 461
    <d88>   DW_AT_decl_column : 17
    <d89>   DW_AT_type        : <0xdad>
    <d8d>   DW_AT_data_member_location: 32
 <2><d8e>: Abbrev Number: 8 (DW_TAG_member)
    <d8f>   DW_AT_name        : BRR
    <d93>   DW_AT_decl_file   : 4
    <d94>   DW_AT_decl_line   : 462
    <d96>   DW_AT_decl_column : 17
    <d97>   DW_AT_type        : <0xd01>
    <d9b>   DW_AT_data_member_location: 40
 <2><d9c>: Abbrev Number: 0
 <1><d9d>: Abbrev Number: 9 (DW_TAG_array_type)
    <d9e>   DW_AT_type        : <0xd01>
    <da2>   DW_AT_sibling     : <0xdad>
 <2><da6>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <da7>   DW_AT_type        : <0xce2>
    <dab>   DW_AT_upper_bound : 1
 <2><dac>: Abbrev Number: 0
 <1><dad>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <dae>   DW_AT_type        : <0xd9d>
 <1><db2>: Abbrev Number: 11 (DW_TAG_typedef)
    <db3>   DW_AT_name        : (indirect string, offset: 0xc5e9e): GPIO_TypeDef
    <db7>   DW_AT_decl_file   : 4
    <db8>   DW_AT_decl_line   : 464
    <dba>   DW_AT_decl_column : 3
    <dbb>   DW_AT_type        : <0xd06>
 <1><dbf>: Abbrev Number: 6 (DW_TAG_structure_type)
    <dc0>   DW_AT_byte_size   : 156
    <dc1>   DW_AT_decl_file   : 4
    <dc2>   DW_AT_decl_line   : 590
    <dc4>   DW_AT_decl_column : 9
    <dc5>   DW_AT_sibling     : <0xfeb>
 <2><dc9>: Abbrev Number: 8 (DW_TAG_member)
    <dca>   DW_AT_name        : CR
    <dcd>   DW_AT_decl_file   : 4
    <dce>   DW_AT_decl_line   : 592
    <dd0>   DW_AT_decl_column : 17
    <dd1>   DW_AT_type        : <0xd01>
    <dd5>   DW_AT_data_member_location: 0
 <2><dd6>: Abbrev Number: 7 (DW_TAG_member)
    <dd7>   DW_AT_name        : (indirect string, offset: 0xcc8cb): ICSCR
    <ddb>   DW_AT_decl_file   : 4
    <ddc>   DW_AT_decl_line   : 593
    <dde>   DW_AT_decl_column : 17
    <ddf>   DW_AT_type        : <0xd01>
    <de3>   DW_AT_data_member_location: 4
 <2><de4>: Abbrev Number: 7 (DW_TAG_member)
    <de5>   DW_AT_name        : (indirect string, offset: 0xcc84a): CFGR
    <de9>   DW_AT_decl_file   : 4
    <dea>   DW_AT_decl_line   : 594
    <dec>   DW_AT_decl_column : 17
    <ded>   DW_AT_type        : <0xd01>
    <df1>   DW_AT_data_member_location: 8
 <2><df2>: Abbrev Number: 7 (DW_TAG_member)
    <df3>   DW_AT_name        : (indirect string, offset: 0xcc8d1): PLLCFGR
    <df7>   DW_AT_decl_file   : 4
    <df8>   DW_AT_decl_line   : 595
    <dfa>   DW_AT_decl_column : 17
    <dfb>   DW_AT_type        : <0xd01>
    <dff>   DW_AT_data_member_location: 12
 <2><e00>: Abbrev Number: 7 (DW_TAG_member)
    <e01>   DW_AT_name        : (indirect string, offset: 0xcc843): PLLSAI1CFGR
    <e05>   DW_AT_decl_file   : 4
    <e06>   DW_AT_decl_line   : 596
    <e08>   DW_AT_decl_column : 17
    <e09>   DW_AT_type        : <0xd01>
    <e0d>   DW_AT_data_member_location: 16
 <2><e0e>: Abbrev Number: 7 (DW_TAG_member)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x7b493): RESERVED
    <e13>   DW_AT_decl_file   : 4
    <e14>   DW_AT_decl_line   : 597
    <e16>   DW_AT_decl_column : 17
    <e17>   DW_AT_type        : <0xcf5>
    <e1b>   DW_AT_data_member_location: 20
 <2><e1c>: Abbrev Number: 7 (DW_TAG_member)
    <e1d>   DW_AT_name        : (indirect string, offset: 0xcc792): CIER
    <e21>   DW_AT_decl_file   : 4
    <e22>   DW_AT_decl_line   : 598
    <e24>   DW_AT_decl_column : 17
    <e25>   DW_AT_type        : <0xd01>
    <e29>   DW_AT_data_member_location: 24
 <2><e2a>: Abbrev Number: 7 (DW_TAG_member)
    <e2b>   DW_AT_name        : (indirect string, offset: 0xcc797): CIFR
    <e2f>   DW_AT_decl_file   : 4
    <e30>   DW_AT_decl_line   : 599
    <e32>   DW_AT_decl_column : 17
    <e33>   DW_AT_type        : <0xd01>
    <e37>   DW_AT_data_member_location: 28
 <2><e38>: Abbrev Number: 7 (DW_TAG_member)
    <e39>   DW_AT_name        : (indirect string, offset: 0xcc78d): CICR
    <e3d>   DW_AT_decl_file   : 4
    <e3e>   DW_AT_decl_line   : 600
    <e40>   DW_AT_decl_column : 17
    <e41>   DW_AT_type        : <0xd01>
    <e45>   DW_AT_data_member_location: 32
 <2><e46>: Abbrev Number: 7 (DW_TAG_member)
    <e47>   DW_AT_name        : (indirect string, offset: 0xcc923): RESERVED0
    <e4b>   DW_AT_decl_file   : 4
    <e4c>   DW_AT_decl_line   : 601
    <e4e>   DW_AT_decl_column : 17
    <e4f>   DW_AT_type        : <0xcf5>
    <e53>   DW_AT_data_member_location: 36
 <2><e54>: Abbrev Number: 7 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0xcc8ea): AHB1RSTR
    <e59>   DW_AT_decl_file   : 4
    <e5a>   DW_AT_decl_line   : 602
    <e5c>   DW_AT_decl_column : 17
    <e5d>   DW_AT_type        : <0xd01>
    <e61>   DW_AT_data_member_location: 40
 <2><e62>: Abbrev Number: 7 (DW_TAG_member)
    <e63>   DW_AT_name        : (indirect string, offset: 0xcc7eb): AHB2RSTR
    <e67>   DW_AT_decl_file   : 4
    <e68>   DW_AT_decl_line   : 603
    <e6a>   DW_AT_decl_column : 17
    <e6b>   DW_AT_type        : <0xd01>
    <e6f>   DW_AT_data_member_location: 44
 <2><e70>: Abbrev Number: 7 (DW_TAG_member)
    <e71>   DW_AT_name        : (indirect string, offset: 0xcc862): AHB3RSTR
    <e75>   DW_AT_decl_file   : 4
    <e76>   DW_AT_decl_line   : 604
    <e78>   DW_AT_decl_column : 17
    <e79>   DW_AT_type        : <0xd01>
    <e7d>   DW_AT_data_member_location: 48
 <2><e7e>: Abbrev Number: 7 (DW_TAG_member)
    <e7f>   DW_AT_name        : (indirect string, offset: 0xcc92d): RESERVED1
    <e83>   DW_AT_decl_file   : 4
    <e84>   DW_AT_decl_line   : 605
    <e86>   DW_AT_decl_column : 17
    <e87>   DW_AT_type        : <0xcf5>
    <e8b>   DW_AT_data_member_location: 52
 <2><e8c>: Abbrev Number: 7 (DW_TAG_member)
    <e8d>   DW_AT_name        : (indirect string, offset: 0xcc807): APB1RSTR1
    <e91>   DW_AT_decl_file   : 4
    <e92>   DW_AT_decl_line   : 606
    <e94>   DW_AT_decl_column : 17
    <e95>   DW_AT_type        : <0xd01>
    <e99>   DW_AT_data_member_location: 56
 <2><e9a>: Abbrev Number: 7 (DW_TAG_member)
    <e9b>   DW_AT_name        : (indirect string, offset: 0xcc811): APB1RSTR2
    <e9f>   DW_AT_decl_file   : 4
    <ea0>   DW_AT_decl_line   : 607
    <ea2>   DW_AT_decl_column : 17
    <ea3>   DW_AT_type        : <0xd01>
    <ea7>   DW_AT_data_member_location: 60
 <2><ea8>: Abbrev Number: 7 (DW_TAG_member)
    <ea9>   DW_AT_name        : (indirect string, offset: 0xcc859): APB2RSTR
    <ead>   DW_AT_decl_file   : 4
    <eae>   DW_AT_decl_line   : 608
    <eb0>   DW_AT_decl_column : 17
    <eb1>   DW_AT_type        : <0xd01>
    <eb5>   DW_AT_data_member_location: 64
 <2><eb6>: Abbrev Number: 7 (DW_TAG_member)
    <eb7>   DW_AT_name        : (indirect string, offset: 0xbfeb9): RESERVED2
    <ebb>   DW_AT_decl_file   : 4
    <ebc>   DW_AT_decl_line   : 609
    <ebe>   DW_AT_decl_column : 17
    <ebf>   DW_AT_type        : <0xcf5>
    <ec3>   DW_AT_data_member_location: 68
 <2><ec4>: Abbrev Number: 7 (DW_TAG_member)
    <ec5>   DW_AT_name        : (indirect string, offset: 0xcc7c4): AHB1ENR
    <ec9>   DW_AT_decl_file   : 4
    <eca>   DW_AT_decl_line   : 610
    <ecc>   DW_AT_decl_column : 17
    <ecd>   DW_AT_type        : <0xd01>
    <ed1>   DW_AT_data_member_location: 72
 <2><ed2>: Abbrev Number: 7 (DW_TAG_member)
    <ed3>   DW_AT_name        : (indirect string, offset: 0xcc82f): AHB2ENR
    <ed7>   DW_AT_decl_file   : 4
    <ed8>   DW_AT_decl_line   : 611
    <eda>   DW_AT_decl_column : 17
    <edb>   DW_AT_type        : <0xd01>
    <edf>   DW_AT_data_member_location: 76
 <2><ee0>: Abbrev Number: 7 (DW_TAG_member)
    <ee1>   DW_AT_name        : (indirect string, offset: 0xcc86b): AHB3ENR
    <ee5>   DW_AT_decl_file   : 4
    <ee6>   DW_AT_decl_line   : 612
    <ee8>   DW_AT_decl_column : 17
    <ee9>   DW_AT_type        : <0xd01>
    <eed>   DW_AT_data_member_location: 80
 <2><eee>: Abbrev Number: 7 (DW_TAG_member)
    <eef>   DW_AT_name        : (indirect string, offset: 0xbfec3): RESERVED3
    <ef3>   DW_AT_decl_file   : 4
    <ef4>   DW_AT_decl_line   : 613
    <ef6>   DW_AT_decl_column : 17
    <ef7>   DW_AT_type        : <0xcf5>
    <efb>   DW_AT_data_member_location: 84
 <2><efc>: Abbrev Number: 7 (DW_TAG_member)
    <efd>   DW_AT_name        : (indirect string, offset: 0xcc79c): APB1ENR1
    <f01>   DW_AT_decl_file   : 4
    <f02>   DW_AT_decl_line   : 614
    <f04>   DW_AT_decl_column : 17
    <f05>   DW_AT_type        : <0xd01>
    <f09>   DW_AT_data_member_location: 88
 <2><f0a>: Abbrev Number: 7 (DW_TAG_member)
    <f0b>   DW_AT_name        : (indirect string, offset: 0xcc7a5): APB1ENR2
    <f0f>   DW_AT_decl_file   : 4
    <f10>   DW_AT_decl_line   : 615
    <f12>   DW_AT_decl_column : 17
    <f13>   DW_AT_type        : <0xd01>
    <f17>   DW_AT_data_member_location: 92
 <2><f18>: Abbrev Number: 7 (DW_TAG_member)
    <f19>   DW_AT_name        : (indirect string, offset: 0xcc893): APB2ENR
    <f1d>   DW_AT_decl_file   : 4
    <f1e>   DW_AT_decl_line   : 616
    <f20>   DW_AT_decl_column : 17
    <f21>   DW_AT_type        : <0xd01>
    <f25>   DW_AT_data_member_location: 96
 <2><f26>: Abbrev Number: 7 (DW_TAG_member)
    <f27>   DW_AT_name        : (indirect string, offset: 0x79570): RESERVED4
    <f2b>   DW_AT_decl_file   : 4
    <f2c>   DW_AT_decl_line   : 617
    <f2e>   DW_AT_decl_column : 17
    <f2f>   DW_AT_type        : <0xcf5>
    <f33>   DW_AT_data_member_location: 100
 <2><f34>: Abbrev Number: 7 (DW_TAG_member)
    <f35>   DW_AT_name        : (indirect string, offset: 0xcc87d): AHB1SMENR
    <f39>   DW_AT_decl_file   : 4
    <f3a>   DW_AT_decl_line   : 618
    <f3c>   DW_AT_decl_column : 17
    <f3d>   DW_AT_type        : <0xd01>
    <f41>   DW_AT_data_member_location: 104
 <2><f42>: Abbrev Number: 7 (DW_TAG_member)
    <f43>   DW_AT_name        : (indirect string, offset: 0xcc90d): AHB2SMENR
    <f47>   DW_AT_decl_file   : 4
    <f48>   DW_AT_decl_line   : 619
    <f4a>   DW_AT_decl_column : 17
    <f4b>   DW_AT_type        : <0xd01>
    <f4f>   DW_AT_data_member_location: 108
 <2><f50>: Abbrev Number: 7 (DW_TAG_member)
    <f51>   DW_AT_name        : (indirect string, offset: 0xcc84f): AHB3SMENR
    <f55>   DW_AT_decl_file   : 4
    <f56>   DW_AT_decl_line   : 620
    <f58>   DW_AT_decl_column : 17
    <f59>   DW_AT_type        : <0xd01>
    <f5d>   DW_AT_data_member_location: 112
 <2><f5e>: Abbrev Number: 7 (DW_TAG_member)
    <f5f>   DW_AT_name        : (indirect string, offset: 0xbfef1): RESERVED5
    <f63>   DW_AT_decl_file   : 4
    <f64>   DW_AT_decl_line   : 621
    <f66>   DW_AT_decl_column : 17
    <f67>   DW_AT_type        : <0xcf5>
    <f6b>   DW_AT_data_member_location: 116
 <2><f6c>: Abbrev Number: 7 (DW_TAG_member)
    <f6d>   DW_AT_name        : (indirect string, offset: 0xcc7ae): APB1SMENR1
    <f71>   DW_AT_decl_file   : 4
    <f72>   DW_AT_decl_line   : 622
    <f74>   DW_AT_decl_column : 17
    <f75>   DW_AT_type        : <0xd01>
    <f79>   DW_AT_data_member_location: 120
 <2><f7a>: Abbrev Number: 7 (DW_TAG_member)
    <f7b>   DW_AT_name        : (indirect string, offset: 0xcc7b9): APB1SMENR2
    <f7f>   DW_AT_decl_file   : 4
    <f80>   DW_AT_decl_line   : 623
    <f82>   DW_AT_decl_column : 17
    <f83>   DW_AT_type        : <0xd01>
    <f87>   DW_AT_data_member_location: 124
 <2><f88>: Abbrev Number: 7 (DW_TAG_member)
    <f89>   DW_AT_name        : (indirect string, offset: 0xcc903): APB2SMENR
    <f8d>   DW_AT_decl_file   : 4
    <f8e>   DW_AT_decl_line   : 624
    <f90>   DW_AT_decl_column : 17
    <f91>   DW_AT_type        : <0xd01>
    <f95>   DW_AT_data_member_location: 128
 <2><f96>: Abbrev Number: 7 (DW_TAG_member)
    <f97>   DW_AT_name        : (indirect string, offset: 0xcc8a6): RESERVED6
    <f9b>   DW_AT_decl_file   : 4
    <f9c>   DW_AT_decl_line   : 625
    <f9e>   DW_AT_decl_column : 17
    <f9f>   DW_AT_type        : <0xcf5>
    <fa3>   DW_AT_data_member_location: 132
 <2><fa4>: Abbrev Number: 7 (DW_TAG_member)
    <fa5>   DW_AT_name        : (indirect string, offset: 0xcc83d): CCIPR
    <fa9>   DW_AT_decl_file   : 4
    <faa>   DW_AT_decl_line   : 626
    <fac>   DW_AT_decl_column : 17
    <fad>   DW_AT_type        : <0xd01>
    <fb1>   DW_AT_data_member_location: 136
 <2><fb2>: Abbrev Number: 7 (DW_TAG_member)
    <fb3>   DW_AT_name        : (indirect string, offset: 0xcc937): RESERVED7
    <fb7>   DW_AT_decl_file   : 4
    <fb8>   DW_AT_decl_line   : 627
    <fba>   DW_AT_decl_column : 17
    <fbb>   DW_AT_type        : <0xcf5>
    <fbf>   DW_AT_data_member_location: 140
 <2><fc0>: Abbrev Number: 7 (DW_TAG_member)
    <fc1>   DW_AT_name        : (indirect string, offset: 0xcc82a): BDCR
    <fc5>   DW_AT_decl_file   : 4
    <fc6>   DW_AT_decl_line   : 628
    <fc8>   DW_AT_decl_column : 17
    <fc9>   DW_AT_type        : <0xd01>
    <fcd>   DW_AT_data_member_location: 144
 <2><fce>: Abbrev Number: 8 (DW_TAG_member)
    <fcf>   DW_AT_name        : CSR
    <fd3>   DW_AT_decl_file   : 4
    <fd4>   DW_AT_decl_line   : 629
    <fd6>   DW_AT_decl_column : 17
    <fd7>   DW_AT_type        : <0xd01>
    <fdb>   DW_AT_data_member_location: 148
 <2><fdc>: Abbrev Number: 7 (DW_TAG_member)
    <fdd>   DW_AT_name        : (indirect string, offset: 0xcc837): CRRCR
    <fe1>   DW_AT_decl_file   : 4
    <fe2>   DW_AT_decl_line   : 630
    <fe4>   DW_AT_decl_column : 17
    <fe5>   DW_AT_type        : <0xd01>
    <fe9>   DW_AT_data_member_location: 152
 <2><fea>: Abbrev Number: 0
 <1><feb>: Abbrev Number: 11 (DW_TAG_typedef)
    <fec>   DW_AT_name        : (indirect string, offset: 0xcc887): RCC_TypeDef
    <ff0>   DW_AT_decl_file   : 4
    <ff1>   DW_AT_decl_line   : 631
    <ff3>   DW_AT_decl_column : 3
    <ff4>   DW_AT_type        : <0xdbf>
 <1><ff8>: Abbrev Number: 2 (DW_TAG_base_type)
    <ff9>   DW_AT_byte_size   : 8
    <ffa>   DW_AT_encoding    : 4	(float)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x12e14): long double
 <1><fff>: Abbrev Number: 12 (DW_TAG_structure_type)
    <1000>   DW_AT_byte_size   : 20
    <1001>   DW_AT_decl_file   : 5
    <1002>   DW_AT_decl_line   : 46
    <1003>   DW_AT_decl_column : 9
    <1004>   DW_AT_sibling     : <0x104a>
 <2><1008>: Abbrev Number: 13 (DW_TAG_member)
    <1009>   DW_AT_name        : Pin
    <100d>   DW_AT_decl_file   : 5
    <100e>   DW_AT_decl_line   : 48
    <100f>   DW_AT_decl_column : 12
    <1010>   DW_AT_type        : <0xcf5>
    <1014>   DW_AT_data_member_location: 0
 <2><1015>: Abbrev Number: 14 (DW_TAG_member)
    <1016>   DW_AT_name        : (indirect string, offset: 0xce626): Mode
    <101a>   DW_AT_decl_file   : 5
    <101b>   DW_AT_decl_line   : 51
    <101c>   DW_AT_decl_column : 12
    <101d>   DW_AT_type        : <0xcf5>
    <1021>   DW_AT_data_member_location: 4
 <2><1022>: Abbrev Number: 14 (DW_TAG_member)
    <1023>   DW_AT_name        : (indirect string, offset: 0xcc89b): Pull
    <1027>   DW_AT_decl_file   : 5
    <1028>   DW_AT_decl_line   : 54
    <1029>   DW_AT_decl_column : 12
    <102a>   DW_AT_type        : <0xcf5>
    <102e>   DW_AT_data_member_location: 8
 <2><102f>: Abbrev Number: 14 (DW_TAG_member)
    <1030>   DW_AT_name        : (indirect string, offset: 0xcc8a0): Speed
    <1034>   DW_AT_decl_file   : 5
    <1035>   DW_AT_decl_line   : 57
    <1036>   DW_AT_decl_column : 12
    <1037>   DW_AT_type        : <0xcf5>
    <103b>   DW_AT_data_member_location: 12
 <2><103c>: Abbrev Number: 14 (DW_TAG_member)
    <103d>   DW_AT_name        : (indirect string, offset: 0xcc873): Alternate
    <1041>   DW_AT_decl_file   : 5
    <1042>   DW_AT_decl_line   : 60
    <1043>   DW_AT_decl_column : 12
    <1044>   DW_AT_type        : <0xcf5>
    <1048>   DW_AT_data_member_location: 16
 <2><1049>: Abbrev Number: 0
 <1><104a>: Abbrev Number: 3 (DW_TAG_typedef)
    <104b>   DW_AT_name        : (indirect string, offset: 0xcc8d9): GPIO_InitTypeDef
    <104f>   DW_AT_decl_file   : 5
    <1050>   DW_AT_decl_line   : 62
    <1051>   DW_AT_decl_column : 3
    <1052>   DW_AT_type        : <0xfff>
 <1><1056>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <1057>   DW_AT_encoding    : 7	(unsigned)
    <1058>   DW_AT_byte_size   : 1
    <1059>   DW_AT_type        : <0xc92>
    <105d>   DW_AT_decl_file   : 5
    <105e>   DW_AT_decl_line   : 68
    <105f>   DW_AT_decl_column : 1
    <1060>   DW_AT_sibling     : <0x1071>
 <2><1064>: Abbrev Number: 16 (DW_TAG_enumerator)
    <1065>   DW_AT_name        : (indirect string, offset: 0xcc81b): GPIO_PIN_RESET
    <1069>   DW_AT_const_value : 0
 <2><106a>: Abbrev Number: 16 (DW_TAG_enumerator)
    <106b>   DW_AT_name        : (indirect string, offset: 0xcc7cc): GPIO_PIN_SET
    <106f>   DW_AT_const_value : 1
 <2><1070>: Abbrev Number: 0
 <1><1071>: Abbrev Number: 3 (DW_TAG_typedef)
    <1072>   DW_AT_name        : (indirect string, offset: 0xcc941): GPIO_PinState
    <1076>   DW_AT_decl_file   : 5
    <1077>   DW_AT_decl_line   : 71
